[{"id":"64003","title":"Farm Frenzy","description":"Farm Frenzy: Match 3 Puzzle Game Dive into the world of Farm Frenzy, the ultimate match 3 puzzle game! This fun-filled adventure challenges you to match 3 or more fruits to complete unique tasks in each level. With vibrant graphics and addictive gameplay, every level offers new and exciting challenges. Features: - Easy-to-learn gameplay for all ages. - Hundreds of levels filled with colorful fruit puzzles. - Challenging and rewarding levels to keep you hooked. Perfect for fans of match 3 games, puzzle challenges, and casual gaming. Whether you&rsquo;re a beginner or a pro, Farm Frenzy offers endless hours of entertainment.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/b09rgxnv6omua0vczpjw2s4spubeuj4x\/","category":"Puzzle","tags":"Bejeweled, Fruits, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/b09rgxnv6omua0vczpjw2s4spubeuj4x\/512x384.jpg","width":"800","height":"600"},{"id":"61974","title":"Sprunki Memory Game","description":"Get ready for a fast-paced memory challenge with a Sprunki twist! In Sprunki Card Match, your mission is simple: flip the cards and find matching pairs&mdash;all featuring the adventurous Sprunki character in action. Test your memory skills across Easy and Medium modes as you race against the clock. Spot Sprunki jumping, running, and exploring in different poses and match them as quickly as you can. The faster you match, the higher your score! Perfect for players of all ages who love a quick brain boost with an adventurous vibe. Are you sharp enough to match them all? Flip the cards and prove it!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/b8luqlja0cx3y69zzni9ah10z0lxd05f\/","category":"Clicker","tags":"Brain, Card, HTML, mapi games, Matching, Memory, Sprunki","thumb":"https:\/\/img.gamemonetize.com\/b8luqlja0cx3y69zzni9ah10z0lxd05f\/512x384.jpg","width":"1280","height":"800"},{"id":"61380","title":"Combo Snake","description":"Control the snake to move and collect gems. Collecting gems of the same color will create nodes of the corresponding color on the snakes body. When three nodes of the same color are connected, they will be automatically eliminated. Eliminating nodes can earn you extra points. Hitting the wall or colliding with itself will lead to the end of the game. Successfully eliminating the entire snakes body results in a game victory.","instructions":"Computer Use the arrow keys to control Mobile phone Tap the screen to control the direction ","url":"https:\/\/html5.gamemonetize.com\/s3qipzsmowz03sobcyid3h15cn3zssfv\/","category":"Bejeweled","tags":"1 Player, 2D","thumb":"https:\/\/img.gamemonetize.com\/s3qipzsmowz03sobcyid3h15cn3zssfv\/512x384.jpg","width":"800","height":"800"},{"id":"60801","title":"Lines 98 Old School","description":"Classic puzzle Balls of Lines 98, made in old school style. Move the balls around the field so as to line up 5 balls of the same color in a row. Score points and take the first place in the leaderboard.","instructions":"Control - touch the ball you want to move and with the second touch choose where to move this ball When playing from a computer select a ball with a mouse click and the next click indicate where to move this ball ","url":"https:\/\/html5.gamemonetize.com\/xycs3mlvr6nmmyjcu9j2stle0wqpp2kp\/","category":"Puzzle","tags":"2048, amazing, Ball, Bejeweled, Brain, Bubble, Jewel, Pixel, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/xycs3mlvr6nmmyjcu9j2stle0wqpp2kp\/512x384.jpg","width":"960","height":"600"},{"id":"60128","title":"Survival Rush","description":"Gear up for the ultimate survival showdown in Survival Rush! In this 3D action-packed adventure,you&rsquo;ll face waves of enemies while testing your attack, defense, and survival skills. You run around the platform, spotting enemies and using your skills to destroy them.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/omv8gh31cvl17uw8ekvv4qa7uvaj1ucr\/","category":"Bejeweled","tags":"attack, running","thumb":"https:\/\/img.gamemonetize.com\/omv8gh31cvl17uw8ekvv4qa7uvaj1ucr\/512x384.jpg","width":"640","height":"1138"},{"id":"53667","title":"Snowball The Cat Christmas Fun","description":"Welcome to the difficult and distant world of the brave Snowball the Cat. will start your adventure! In this Christmas fun game, Snowball the Cat will start your adventure! Snowball the Cat is lost and needs your help to find his way home in time for dinner. And on the way home, you need catch all the birds and rats of their world. Find the key and go through the door that leads to a new level!","instructions":"Jump avoid enemies collect keys and hit the doors ","url":"https:\/\/html5.gamemonetize.com\/nlf6fa3jwf6tc9xiv7h1scifx73ek2aa\/","category":"Clicker","tags":"Animal, Barbie","thumb":"https:\/\/img.gamemonetize.com\/nlf6fa3jwf6tc9xiv7h1scifx73ek2aa\/512x384.jpg","width":"1280","height":"720"},{"id":"59003","title":"Winter Blast","description":"Welcome to Winter Blast Match3 puzzle Game. Swipe to match 3 or more identical Christmas winter items to eleminate them and keep matching to win the level. Match 4 or 5 items to get super boosters. Explore tons of amazing and chellenging levels and try to finish them all. Enjoy Winter Blast Christmas match3 game.","instructions":"Follow the game instructions","url":"https:\/\/html5.gamemonetize.com\/ibdahpzhiyatdd5fyvlbcgv4c9fj7sgz\/","category":"Puzzle","tags":"Candy, Jewel, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/ibdahpzhiyatdd5fyvlbcgv4c9fj7sgz\/512x384.jpg","width":"720","height":"1080"},{"id":"58769","title":"Jewel Miner Quest","description":"The dazzling world of gems awaits! Participate in thrilling events within limited moves or time. Solve captivating puzzles, complete fun tasks, and enjoy daily bonuses. Discover many terrific surprises with every move and see how far you can go.","instructions":"The game features limitless match-3 levels Players connect three or more jewels to clear levels and progress Four unique boosters help overcome challenges Daily login rewards the Lucky Wheel and special tasks offer opportunities to earn prizes and en","url":"https:\/\/html5.gamemonetize.com\/dpnk0do4wordmnhcmejlqly9horc8dpi\/","category":"Hypercasual","tags":"Bejeweled, Casual, Color, Coloring, Jewel, Match 3, Match-3, Match3, Math","thumb":"https:\/\/img.gamemonetize.com\/dpnk0do4wordmnhcmejlqly9horc8dpi\/512x384.jpg","width":"600","height":"800"},{"id":"57463","title":"Halloween Burst","description":"Welcome to Halloween Burst Match3 Puzzle Game! Swipe to match 3 or more identical halloween elements to eleminate them and finish your mission. Explore tons of amazing and challenging halloween match3 levels and try to complete them all. Good luck!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/lw83yeu8lwx2gjpso3ggowc5kzct9vga\/","category":"Puzzle","tags":"Halloween, Horror, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/lw83yeu8lwx2gjpso3ggowc5kzct9vga\/512x384.jpg","width":"350","height":"600"},{"id":"56557","title":"Jelly Block Puzzle","description":"Dive into the fun with our vibrant jelly merging game! Explore a world filled with countless levels, merge jellies, use power-ups, and stay entertained. Challenge your brain and see how far you can go in this delightful, jelly-colored adventure!","instructions":"The game features an unlimited number of levels Your goal is to connect jellies of the same color and achieve the required number of color combinations to complete each level You can use two power-ups one to destroy a selected jelly and another to swap","url":"https:\/\/html5.gamemonetize.com\/k7upgf6z69thpz5uq3yg74uedrw7r24y\/","category":"Puzzle","tags":"Block, Clash, Color, Coloring, Jelly, Jewel, Logic, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/k7upgf6z69thpz5uq3yg74uedrw7r24y\/512x384.jpg","width":"600","height":"800"},{"id":"56353","title":"GemMine Match 3","description":"Dive into the depths of mines filled with dazzling gems in GemMine Match 3, the ultimate casual match-3 puzzle adventure! Swap and match colourful gems to help the Miner accumulate richness and get to the top of the leaderboards. Journey through various levels, each set in a unique underground environment, from glittering caverns to ancient, forgotten mines. Each level has its own unique movement patterns that will challenge your mental reflexes as you compete against other players on the leaderboards.","instructions":"Click or tap to play","url":"https:\/\/html5.gamemonetize.com\/lqo3z4lzhug8b0xcyn83ojbtzyvrv5c0\/","category":"Puzzle","tags":"Casual, Match 3, Matching, Miner","thumb":"https:\/\/img.gamemonetize.com\/lqo3z4lzhug8b0xcyn83ojbtzyvrv5c0\/512x384.jpg","width":"1920","height":"1080"},{"id":"55790","title":"Jewel Garden Story","description":"Enter a dazzling realm where sparkling jewels await your matching skills. Challenge yourself to achieve high scores and enjoy the visually stunning jewel combinations. Perfect for puzzle enthusiasts seeking endless entertainment.","instructions":"The game features limitless puzzles Connect three or more jewels of the same type to clear levels Use 6 unique boosters to progress through the game faster Earn rewards through daily logins and Garden Expeditions and aim for top rankings in the competi","url":"https:\/\/html5.gamemonetize.com\/oezoo219v0bf4t552hfiityulzwls396\/","category":"Hypercasual","tags":"Bejeweled, Casual, Jewel, Match 3, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/oezoo219v0bf4t552hfiityulzwls396\/512x384.jpg","width":"600","height":"800"},{"id":"54848","title":"TimeGems","description":"Embark on an exciting adventure in the colorful world of Time Gems, a delightful match-three game designed for quick, enjoyable gaming moments. In Time Gems, youll be racing against the clock to match stunning gems and score high points. Timed Challenges: Each game session is a fast-paced race against the clock. Match gems to add precious seconds and prolong the excitement!","instructions":"Click and drag gems to swap them","url":"https:\/\/html5.gamemonetize.com\/hw9hz2my1ezyci7yavxz4cyg33e4o2bw\/","category":"Puzzle","tags":"Match 3, Match-3, Match3, Matching, Puzzle, puzzleblock","thumb":"https:\/\/img.gamemonetize.com\/hw9hz2my1ezyci7yavxz4cyg33e4o2bw\/512x384.jpg","width":"600","height":"800"},{"id":"52242","title":"Yummi Bubbles","description":"Embark on a delightful journey of popping bubbles with Yummi Bubbles &ndash; a fun-filled HTML5 bubble click game that will immerse you in a world of colorful orbs and addictive gameplay. In Yummi Bubbles, your objective is simple yet captivating: pop as many bubbles as you can within the given time limit. But dont be fooled by its simplicity; as you progress through the levels, the challenge intensifies, requiring quick reflexes and strategic thinking to master. Featuring vibrant and eye-catching graphics, each bubble bursts with its own unique charm, adding to the games visual appeal. From glittering gems to delectable treats.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/qrqghd0f9yegb0r3aakij0gnfnbaumo4\/","category":"Puzzle","tags":".io Games, 1 Player, Android, Ball, Bejeweled, Bricks, Bubble, Bubble Shooter, Cake, Color, Coloring, Fantasy, Friv, Kids","thumb":"https:\/\/img.gamemonetize.com\/qrqghd0f9yegb0r3aakij0gnfnbaumo4\/512x384.jpg","width":"800","height":"600"},{"id":"54846","title":"Match Cake 2D","description":"Match Cake 2D is an engaging puzzle game where players click to change the positions of various cake pieces on a 2D grid. The objective is to align similar cakes in a row or column to score points. As players advance, the game introduces more complex cake types and obstacles, enhancing the challenge. website dev <a href='https:\/\/www.playbestgames.io\/'>https:\/\/www.playbestgames.io\/<\/a>","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ab5hl38jcicn24pz2hj9gr9ibp9ljlsg\/","category":"Bejeweled","tags":"2D, amazing, Cake, Puzzle, puzzleblock","thumb":"https:\/\/img.gamemonetize.com\/ab5hl38jcicn24pz2hj9gr9ibp9ljlsg\/512x384.jpg","width":"800","height":"600"},{"id":"54813","title":"Zoo Zoom Shapes","description":"Get ready for a wild shape-matching adventure in Zoo Zoom Shapes! Match the adorable animal pictures with their corresponding shadow outlines. Earn points for each correct match and unlock new levels with even more challenging shapes. Have fun learning about different animals while you sharpen your observation skills!","instructions":"Match the invisible shapes with visible animals ","url":"https:\/\/html5.gamemonetize.com\/8i8brl7tumt5mjsnbdq4hwckxb470vzm\/","category":"Bejeweled","tags":"1 Player, Best Games, Educational, Fun","thumb":"https:\/\/img.gamemonetize.com\/8i8brl7tumt5mjsnbdq4hwckxb470vzm\/512x384.jpg","width":"1366","height":"768"},{"id":"53517","title":"Emerland Solitaire","description":"Welcome to the wonderful country of Emerland! Dive deep into the world of magical tale where great mages battle for the Source of the ancient magic of the Cards! Explore mysterious lands accompanied by heroes that include a noble Knight, an Elven Archeress and a mystical Sorceress to defeat the malevolent Dark Master! Solve puzzles and collect combinations to complete difficult and varied levels! Get rewards and find new assistants! Prove that you have learned all of the mysteries of the magic of Solitaire and challenge the most difficult trials at the card table! This game is easy to learn, but are you brave enough to master it?","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/p64058ybqqb8gwhmesfp87rsqm1m4o7n\/","category":"Bejeweled","tags":"1 Player, Mahjong, Solitaire","thumb":"https:\/\/img.gamemonetize.com\/p64058ybqqb8gwhmesfp87rsqm1m4o7n\/512x384.jpg","width":"800","height":"600"},{"id":"54332","title":"Magic Solitaire","description":"Welcome to the amazing magical world of solitaire! Here you can make yourself at home, playing layouts on a tavern table by the fireside, or in the shade of an oak tree by a majestic rushing waterfall. Your fairy helper will guide you through this magical world full of mystery and ancient secrets.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/j2qpzxqk4a54ho37ilyxj5q06othpvjs\/","category":"Bejeweled","tags":"1 Player, 2D, Mahjong, Solitaire","thumb":"https:\/\/img.gamemonetize.com\/j2qpzxqk4a54ho37ilyxj5q06othpvjs\/512x384.jpg","width":"800","height":"600"},{"id":"53210","title":"Candy Shuffle","description":"Welcome to Candy Shuffle Match3 Puzzle Game! Candy Shuffle is a delightful match-3 puzzle game that will satisfy your sweet tooth! Swap colorful candies to make matches of three or more and clear the board. With tons of levels, each packed with challenges and special power-ups, youll embark on a tasty adventure through candy-filled worlds. Can you shuffle your way to victory and become the ultimate candy matcher?","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/4343mfkxxw6sx1psbf220mofhfvpm2yk\/","category":"Puzzle","tags":"Candy, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/4343mfkxxw6sx1psbf220mofhfvpm2yk\/512x384.jpg","width":"720","height":"1280"},{"id":"52745","title":"Sweet Match","description":"Welcome to Sweet Match Puzzle Game! Swipe to match 3 or more identical candies to eliminate them and keep matching till you finish your mission to unlocked the next level. Explore 25 Challenging level and try to complete them all! Good Luck!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/mrnfepi9o508sb3gm7csl6k83y63dy5d\/","category":"Puzzle","tags":"Candy, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/mrnfepi9o508sb3gm7csl6k83y63dy5d\/512x384.jpg","width":"720","height":"1280"},{"id":"52463","title":"Fruitta Link","description":"Welcome to Fruitta Link Match3 Puzzle Game! Try to Link 3 or more identical fruits to earn point and add more time. Try to get the highest score to be the winner. Have fun!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/9fh29vpq3zxl44egrhumusjxqpvwg7e5\/","category":"Puzzle","tags":"Fruit, Fruits, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/9fh29vpq3zxl44egrhumusjxqpvwg7e5\/512x384.jpg","width":"720","height":"1280"},{"id":"52578","title":"rotating triangle","description":"Triangle rotation matching color elimination puzzle game.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/tmb4t8jblus3zquzydo6b989zz3p364y\/","category":"Hypercasual","tags":"2D, airplane, Best Games, Color, H5, Matching","thumb":"https:\/\/img.gamemonetize.com\/tmb4t8jblus3zquzydo6b989zz3p364y\/512x384.jpg","width":"800","height":"600"},{"id":"52361","title":"Stars Crush","description":"Welcome to Stars Crush Puzzle Game! Tap or click to eliminate 2 or more blocks of the same color to get points. Explore tons of challenging levels and try to finish them all.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ghn3r2h45pufqrplmy2tbo7rzmhqz028\/","category":"Clicker","tags":"Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ghn3r2h45pufqrplmy2tbo7rzmhqz028\/512x384.jpg","width":"720","height":"1280"},{"id":"52137","title":"Match Emoji","description":"Match Emoji is a casual puzzle game. In the game, players need to join three identical blocks together to eliminate them. The pictures contained on each block are different. Players are in the process of elimination. You must think carefully. In the process of connecting, there must be more than three blocks before they can be eliminated. Levels: 100 levels. We will continue to launch new levels in the future. Youll never be bored!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/2wmq5crts83quutjwhu2b3x1lorurzwr\/","category":"Hypercasual","tags":"1 Player, Bejeweled, Best Games, Brain, Click, Funny, H5, Hypercasual, touchscreen","thumb":"https:\/\/img.gamemonetize.com\/2wmq5crts83quutjwhu2b3x1lorurzwr\/512x384.jpg","width":"800","height":"600"},{"id":"51673","title":"GemFit Frenzy","description":"In GemFit Frenzy dive into a jewel-fitting challenge on a 7x7 grid. Test your agility and strategy as you race against time to form complete rows and columns. Confront the Gem Frenzy and achieve incredible scores!","instructions":"Drag and drop the pieces to the grid","url":"https:\/\/html5.gamemonetize.com\/yhjyqgtmyuguheez84bl7bqmkeurz7k5\/","category":"Puzzle","tags":"Jewel, Matching","thumb":"https:\/\/img.gamemonetize.com\/yhjyqgtmyuguheez84bl7bqmkeurz7k5\/512x384.jpg","width":"2160","height":"3840"},{"id":"51718","title":"BlocksEliminate","description":"Eliminating blocks is a simple game where players need to get points by eliminating blocks of the same color. The goal of the game is to gain points by eliminating blocks of the same color.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/hg3yt9z75maehkt74trzislqzlgg6sqg\/","category":"Hypercasual","tags":"blocky, Classic, Color, html5 games, Hypercasual, Logic, unity games","thumb":"https:\/\/img.gamemonetize.com\/hg3yt9z75maehkt74trzislqzlgg6sqg\/512x384.jpg","width":"800","height":"600"},{"id":"47470","title":"Kids Education","description":"Kids Education is game that aims to educate kids in a funny way without them getting bored or feel like they are studying.The game has many different Sections like Puzzles, learn how to read,write etc.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/iqjxnqk15h0mxj0be9hi3gxoh39dd16y\/","category":"Bejeweled","tags":"Android, Boys, Educational, HTML5, iPad, Kids, Mobile","thumb":"https:\/\/img.gamemonetize.com\/iqjxnqk15h0mxj0be9hi3gxoh39dd16y\/512x384.jpg","width":"300","height":"600"},{"id":"51548","title":"Fantasy Forest 2","description":"Fantasy Forest &ndash; is a HTML5 Game! Cool match logic game. The game has 100 levels and an in-game store that will help you complete this puzzle game.You need to collect the required number of three types of blocks for each level and at the same time not leaving more than one extra block.","instructions":"mouse","url":"https:\/\/html5.gamemonetize.com\/61qhaiw98hx93lwa3tbe6u4tau5cbf9c\/","category":"Bejeweled","tags":"1 Player, Bejeweled, Block, Funny, Logical, Mind, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/61qhaiw98hx93lwa3tbe6u4tau5cbf9c\/512x384.jpg","width":"1080","height":"1920"},{"id":"47630","title":"Christmas Connect","description":"Christmas Connect is a cute matching game where you connect 3 or more cute Xmas items of the same color. You have 30 seconds! connect as much items as you can to earn points and get the highest score. Good Luck!","instructions":"Slide your finger or mouse click to link 3 or more items","url":"https:\/\/html5.gamemonetize.com\/ms1kha00zjhm4kodf5cq2nzddhw8xjuc\/","category":"Puzzle","tags":"Christmas, Match 3, Match3, Puzzle, Winter","thumb":"https:\/\/img.gamemonetize.com\/ms1kha00zjhm4kodf5cq2nzddhw8xjuc\/512x384.jpg","width":"720","height":"1280"},{"id":"50571","title":"Farm Match Saga","description":"if you love match3 puzzle games then you will fall in love with Farm Match Saga! Play against time and swipe to match 3 or more identical fruits to earn extra time. Chellenge your friends and lets see who will get the best score. Are you ready to crush some delicious fruits?","instructions":"Slide your finger or hold mouse click to move fruits","url":"https:\/\/html5.gamemonetize.com\/43x2s9jopa47nffxsj2r1lsf2w2jcghb\/","category":"Puzzle","tags":"Fruit, Fruits, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/43x2s9jopa47nffxsj2r1lsf2w2jcghb\/512x384.jpg","width":"1280","height":"720"},{"id":"43881","title":"Dice Math","description":"A fun math game for kids to learn basic arithmetic skills using dice. Improve addition, subtraction, multiplication, and division. The Dice Math Kids Game is an exciting and educational game designed for kids to learn and improve their arithmetic skills using dice. With this game, your child will have fun while practicing addition, subtraction, multiplication, and division.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/n412slsirp0rlj8kjc4133gdecjvs72k\/","category":"Bejeweled","tags":"Boy, Boys, Fun, Game, Games, Girl, Girls, Matching, Math, NapTech Games, Online","thumb":"https:\/\/img.gamemonetize.com\/n412slsirp0rlj8kjc4133gdecjvs72k\/512x384.jpg","width":"720","height":"1280"},{"id":"50204","title":"2048 X2 Legends","description":"The elusive 2048 block is almost within your reach. Combine and count up your blocks. Reach higher and higher scores, sharpening your mind in the process.","instructions":"Shoot blocks of the same number to combine them into a higher number Get to the highest number possible before running out of space Use boosters to make the game easier ","url":"https:\/\/html5.gamemonetize.com\/dlewrko3e9s1074yicv4q5sydfoynash\/","category":"Puzzle","tags":"Block, Number","thumb":"https:\/\/img.gamemonetize.com\/dlewrko3e9s1074yicv4q5sydfoynash\/512x384.jpg","width":"600","height":"800"},{"id":"49998","title":"Fruit Match","description":"Fruits Match is a match-three game where you collect three matching tiles to clear them. Collect and clear three or more fruit tiles to solve the stage. You may use one additional deck, shuffle, or undo chance per stage. These powerups allow you to add an additional deck slot, shuffle the cards or undo your previous action. Get started today and show the world your mastery of fruit-matching!","instructions":"Mouse click or Touch","url":"https:\/\/html5.gamemonetize.com\/vos6pgamgcwxmmgnnb0ri7te4gscn20q\/","category":"Puzzle","tags":"2D, Bejeweled, Block, Casual, Fruit, Fruits, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/vos6pgamgcwxmmgnnb0ri7te4gscn20q\/512x384.jpg","width":"600","height":"600"},{"id":"39962","title":"Card Memory Match","description":"Card Memory Match","instructions":"Click or Touch","url":"https:\/\/html5.gamemonetize.com\/2mgeccmvxbmgw5nkk2mvrvsry7ennecj\/","category":"Puzzle","tags":"Card, Memory, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/2mgeccmvxbmgw5nkk2mvrvsry7ennecj\/512x384.jpg","width":"800","height":"600"},{"id":"46221","title":"1001 Arabian Nights","description":"Get ready for an enchanting journey in 1001 Arabian Nights. The sands of this legendary desert are full of magic, mystery, and much more! Ali Baba and the Forty Thieves, Aladdins Lamp, and The Fisherman and the Genie are just a few of the stories waiting for you in this match-3 game that was inspired by One Thousand and One Nights, the famous collection of fairy tales from the Middle East. They will gradually unfold as you match the identical tiles on the board in each challenging level.","instructions":"Your goal is to collect a group of enchanted objects scattered across the board in each level Link together the colorful tiles They can be removed once you put them into groups of three or more ","url":"https:\/\/html5.gamemonetize.com\/rd70fy18ke65ge0d6ygek4wyvsfilq74\/","category":"Puzzle","tags":"1 Player, Bejeweled, Game, Games, HTML, HTML5, Jewel, Match 3, Match-3, Match3, Matching, Online, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/rd70fy18ke65ge0d6ygek4wyvsfilq74\/512x384.jpg","width":"700","height":"510"},{"id":"49445","title":"Candy Match Sagas 2","description":"Enjoy the adventure in the magic world of Candy Match Sagas 2. Immerse yourself in an exciting Match 3 game Secuel with many levels and excellent graphics. Help the little Witch to solve all the Match 3 puzzles and escape from the magic world using your skills, and amazing power-ups to complete the levels. Website Developer <a href='https:\/\/kiz10.com'>https:\/\/kiz10.com<\/a>","instructions":"Use the mouse or Touch to match the blocks","url":"https:\/\/html5.gamemonetize.com\/o2bv4nu33660pv8v0zgh4u1zzw6eylge\/","category":"Hypercasual","tags":"Arcade, Bejeweled, Best Games, Candy, Casual, Farm, Google, HTML5, kiz10, Match-3, Witch","thumb":"https:\/\/img.gamemonetize.com\/o2bv4nu33660pv8v0zgh4u1zzw6eylge\/512x384.jpg","width":"720","height":"1280"},{"id":"47843","title":"Jewel Match Deluxe","description":"Journey through a whimsical world of jewels with this match 3 puzzle game. Match colorful gems to level up with classic gameplay challenges. -Create longer match combinations to earn extra points! -Unlock special jewels! -Beat your highest score!","instructions":"Swap your jewels position to align them in one shiny horizontal or vertical row of three or more This clears all the matching items leaving space for more precious gems to fall into the game If you match four or more jewels they will combine to create","url":"https:\/\/html5.gamemonetize.com\/znvnwuolwor8izt2tvt21s4v1jtep9id\/","category":"Puzzle","tags":"2D, Bejeweled, Crazy, Fun, Funny, Game, Games, Match 3, Match3","thumb":"https:\/\/img.gamemonetize.com\/znvnwuolwor8izt2tvt21s4v1jtep9id\/512x384.jpg","width":"800","height":"450"},{"id":"46878","title":"Coloring books","description":"Coloring books is a free online coloring and kids game! In this game you will find different books pictures which have to be colored as you want. You have the enough amount of colors to choose for your perfect art. You can also save the colored image. Have fun!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/rvyjptyd1lhrfwbw2x3hveyb8kxont2s\/","category":"Girls","tags":"Android, Color, Coloring, Fun, Girls, HTML5, iPhone, Kids, Mobile","thumb":"https:\/\/img.gamemonetize.com\/rvyjptyd1lhrfwbw2x3hveyb8kxont2s\/512x384.jpg","width":"300","height":"600"},{"id":"46045","title":"Kitty Jewel Quest","description":"Spend your free time with a true delight for all cat lovers! Race against the clock to match three or more adorable kittens in a row or column. This game will provide hours of fun and relaxation for all ages.","instructions":"Connect at least three kittens of the same type in a row or column and beat the levels Complete missions and special events to gather coins Buy boosters to make the levels easier ","url":"https:\/\/html5.gamemonetize.com\/p68gqeop8iooudh88fl8g5ulxlf600na\/","category":"Hypercasual","tags":"Bejeweled, Jewel, Match 3, Match-3, Match3","thumb":"https:\/\/img.gamemonetize.com\/p68gqeop8iooudh88fl8g5ulxlf600na\/512x384.jpg","width":"600","height":"800"},{"id":"46299","title":"Classic Tetris","description":"Welcome to TETRIS&reg;, the official mobile app for the world&rsquo;s favorite puzzle game. Play through hundreds of unique TETRIS Levels in a new Tetris experience. Play a quick round to beat your own score, or play infinite rounds to master your skills in the TETRIS Single Player Modes. TETRIS forever!","instructions":" bull Master your skills with the iconic Tetris gameplay you know and love Pick between the Marathon mode for endless rounds or the new Quick Play Mode for when you want to play Tetris but only have a few minutes to play bull Rotate Tetriminos cle","url":"https:\/\/html5.gamemonetize.com\/mmaxm2pvvre67rj2ce1eo5s4ugf4bxro\/","category":"Puzzle","tags":"1 Player, 2D, Android, Block, Puzzle, Tetris","thumb":"https:\/\/img.gamemonetize.com\/mmaxm2pvvre67rj2ce1eo5s4ugf4bxro\/512x384.jpg","width":"640","height":"1136"},{"id":"44133","title":"Pets Match3","description":"Welcome to Pets Match3 by vodogame.com Swipe to match 3 or more identical Pets and play fast to finish your level. explore amazing missions and complete them all. good luck!","instructions":"Swipe to match pets","url":"https:\/\/html5.gamemonetize.com\/i29ob2wlmkgltglxr9tq3cldtpveh7ox\/","category":"Puzzle","tags":"Candy, Kids, Match 3, Match-3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/i29ob2wlmkgltglxr9tq3cldtpveh7ox\/512x384.jpg","width":"720","height":"1280"},{"id":"38044","title":"Bubble Shooter - Puzzle games","description":"Bubble Shooter is the #1 addictive bubble shooting puzzle game on Android. Aim, fire and pop your way through this enchanting bubble shooter adventure today! Shoot and match 3 or more bubbles in this tasty game for sweet winning feeling! Pop and burst with quick thinking and smart tactics to progress to the next challenging level and be awarded with powerful boosters. Are you ready to pop and blast now?","instructions":"","url":"https:\/\/html5.gamemonetize.com\/q7v7muxh7cvjlzi9hbmj5oixkzxmqxr0\/","category":"Hypercasual","tags":"Bubble, Bubble Shooter, Game, Games","thumb":"https:\/\/img.gamemonetize.com\/q7v7muxh7cvjlzi9hbmj5oixkzxmqxr0\/512x384.jpg","width":"800","height":"600"},{"id":"42990","title":"Jewels Link","description":"Jewels Link is a puzzle jewel linking game. Slide your finger to link jewels of the same color and keep linking till you remove all the yellow squars. Explore some amazing levels and enjoy this game","instructions":"Slide your finger to link jewels","url":"https:\/\/html5.gamemonetize.com\/ezj0vnuufw8ebxip2eu29a16p43d4tto\/","category":"Puzzle","tags":"Jewel, Match 3, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ezj0vnuufw8ebxip2eu29a16p43d4tto\/512x384.jpg","width":"720","height":"1280"},{"id":"42464","title":"Math Playground","description":"Math Playground is an online educational game that helps kids learn math. It's a great way for kids to practice their math skills and have fun at the same time. Math Playground is an online educational game that helps kids learn math. It's a great way for kids to practice their math skills and have fun at the same time. Players can use the game to help them learn basic math concepts, including addition and subtraction, multiplication and division, and geometry. The game has a variety of challenges and activities to keep kids entertained, and it is free to play.","instructions":"Tap To Play","url":"https:\/\/html5.gamemonetize.com\/8wttfggfhrxxl4xfhyslodt3ei83sw0u\/","category":"Bejeweled","tags":"Baby, Baby Hazel, Boy, Boys, Game, Games, Girl, Girls, HTML5, Online","thumb":"https:\/\/img.gamemonetize.com\/8wttfggfhrxxl4xfhyslodt3ei83sw0u\/512x384.jpg","width":"720","height":"1280"},{"id":"43338","title":"Wake The Bubbles","description":"Are you ready to wake those bubbles up! Welcome to wake the bubbles puzzle connect game. Try to link bubbles of the same color to wake them up! Connect as much as you can and quickly to finish the level. Slide your finger and wake 3 or more colorful sleepy bubbles and eliminate them. Explore tons of amazing and chellenging levels and try to complete them all. Enjoy","instructions":"Slide you finger or hold mouse click ","url":"https:\/\/html5.gamemonetize.com\/unwz8oqa27wm8g5dg3fw3cti3ai1rd2a\/","category":"Puzzle","tags":"Bubble, Bubble Shooter, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/unwz8oqa27wm8g5dg3fw3cti3ai1rd2a\/512x384.jpg","width":"720","height":"1280"},{"id":"42595","title":"Donuts Pop","description":"Welcome to Donut puzzle world! Tap or click to pop 2 or more identical donuts to finish your mission. Explore tons of amazing and challenging joy levels. Enjoy beautiful graphics and sounds. Good Luck!","instructions":"Tap or click to pop 2 or more identical donuts","url":"https:\/\/html5.gamemonetize.com\/c8vmtnzqnhyx1aycl8m1od4p0fxi1b5b\/","category":"Puzzle","tags":"Arcade, Casual, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/c8vmtnzqnhyx1aycl8m1od4p0fxi1b5b\/512x384.jpg","width":"720","height":"1280"},{"id":"41930","title":"Match Jewel","description":"Match gems to destroy them! Match Jewel is a classic match 3 game with great gameplay for kids and adults! The game contains many challenging match 3 puzzle levels! MATCH JEWEL FEATURES: ★ Daily Lucky Roulette randomly offers a surprise in order to facilitate your progress; ★ Dozens of match 3 puzzle levels; ★ Combine gems to use different skills; ★ Match 3 puzzle game becomes progressively from easy to difficult, more obstacles will prevent your contact with gems; ★ Complete levels to unlock more challenges HOW TO PLAY MATCH JEWEL:","instructions":" Match 3 gems in a row to destroy them Match gemstones with horizontal stripes to destroy a line Combine gemstones with vertical stripes to destroy a column Combine gems and potions to destroy all gem","url":"https:\/\/html5.gamemonetize.com\/5d3ey3vpz50cxlxy0mpvfawid80p3kux\/","category":"Puzzle","tags":"2D, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/5d3ey3vpz50cxlxy0mpvfawid80p3kux\/512x384.jpg","width":"800","height":"600"},{"id":"41112","title":"Maze Pac Runner","description":"Pac Maze Runner is a puzzle game online and a free game that you will be addicted to, which is perfect for kids. You just need to click the button to launch the beans, Pac man eats all the beans. Pays attention to the moving obstacles. It's time to test your reflexes, and the classic Pacman gameplay gives you an exciting experience.","instructions":"Mouse or tap to play","url":"https:\/\/html5.gamemonetize.com\/cf6pwvtlghlup2ncdhzjvacxi5paszja\/","category":"Bejeweled","tags":"Adventure, Anime, Arena, Army, Barbie, Candy, Draw, HTML5, Match-3, Music, Punch, running, Shooter, Sim, Skating, Snake, Sofia, Space, Strategy, Submachine, Subway Surfers, sumo, Superhero, Surgery, Tank, Taxi, Timing, tomb, Traffic, Typing, Violence, Wizard, Word, World, Worm, Worms, Zombie","thumb":"https:\/\/img.gamemonetize.com\/cf6pwvtlghlup2ncdhzjvacxi5paszja\/512x384.jpg","width":"800","height":"600"},{"id":"41815","title":"Papa Cherry Blast Saga","description":"This smart chef has a sweet tooth! Help him collect lots of delicious desserts in <strong>Papa Cherry Blast Saga<\/strong>. <br> He will explore a magical kingdom filled with goodies. Join the chef as he matches donuts and other sugary treats in this one-player puzzle game. <br> Put them in unique letter-shaped combinations like L and T to trigger sensational effects! <strong>Papa Cherry Blast Saga<\/strong>. It also has useful boosters that are sure to help you on this incredible journey. Stay tuned for bonuses in this match-three game in this fun stylized puzzle!","instructions":"Papa Cherry s objective is to collect a certain number of desserts at each level Join and connect three or more of them to get them off the board ","url":"https:\/\/html5.gamemonetize.com\/utw88bcshtc3a8yl2ibt72qpc4ugpcxf\/","category":"Puzzle","tags":"Bejeweled, Candy, Clicker, HTML5, Kids, Match 3, Match-3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/utw88bcshtc3a8yl2ibt72qpc4ugpcxf\/512x384.jpg","width":"800","height":"600"},{"id":"41554","title":"La boutique de chapeaux","description":"Aide la bande de personnages des Looney Tunes à gérer leur boutique de chapeaux. Conçois et crée des chapeaux pour tes clients et montre-leur tes créations originales. Arriveras-tu à combler tous les clients ? Quelle sera ta plus belle création ? Dessine le chapeau, choisis le matériau, et invente des designs fous dans ce nouveau jeu amusant.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/1jamro5phcc5ct56ohqwc7exjkw0e0x7\/","category":"Puzzle","tags":"Anime, Cartoon","thumb":"https:\/\/img.gamemonetize.com\/1jamro5phcc5ct56ohqwc7exjkw0e0x7\/512x384.jpg","width":"800","height":"600"},{"id":"42375","title":"Jewels Blast","description":"Welcome to the popular match 3 puzzle game. Jewel Blast is the center of the puzzle games world with it's unique and popularity between all of match 3 puzzle games of all time. Tap, Pop, and Blast the jewels in this jungle puzzle adventure to explore the unknown and get the fun blasting jewels in just One Tap! Be the King of match 3 puzzles with creativity and tactical matching moves to get tasty blastful combos for the shiny bonuses rewarded. Think carefully! Match 3 or more jewels in a row and blast your way through the adventure of puzzles using varieties of items! Swing the Hammers and Blow all those jewels across never-ending of puzzle levels, BE THE BEST TREASURE HUNTER.","instructions":"Use Mouse Click to Swipe the Jewels","url":"https:\/\/html5.gamemonetize.com\/b8y0ug1gvbkc083yavx3vo3ak6304pls\/","category":"Puzzle","tags":"2D, Adventure, Arcade, Bejeweled, Classic, Fun, Jewel","thumb":"https:\/\/img.gamemonetize.com\/b8y0ug1gvbkc083yavx3vo3ak6304pls\/512x384.jpg","width":"400","height":"700"},{"id":"42310","title":"Jelly Quest Mania","description":"Collect the jellies in this free and fun match-3 puzzle game. Whenever you want to pass time, this game can provide the right experience thanks to the cool gameplay.","instructions":"In this game you can play and match three or more jellies of the same type to collect them Complete all the objectives before you run out of time or moves In each level you are playing against limited time and moves Some jellies are locked free them b","url":"https:\/\/html5.gamemonetize.com\/vjfiui6o55eabdtykutgthu0rr5whxbl\/","category":"Puzzle","tags":"Logic, Logical, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/vjfiui6o55eabdtykutgthu0rr5whxbl\/512x384.jpg","width":"600","height":"800"},{"id":"40615","title":"CatLines","description":"Simple match 5 game for kids designed to enhance logical thinking skills. Match 5 or more same colored cats in a straight lines, in any direction, to clear them from the board. How many lines can you make?","instructions":"Match 5 or more same colored cats in a straight lines horizontal vertical or diagonal to remove them Every removed line is worth 50 points Crossed lines are worth double Use your mouse or tap the screen to play ","url":"https:\/\/html5.gamemonetize.com\/v6m02j935s1pqa02c1zfqfeye6uy4fcz\/","category":"Puzzle","tags":"Arcade, Hypercasual, Kids, Match-3","thumb":"https:\/\/img.gamemonetize.com\/v6m02j935s1pqa02c1zfqfeye6uy4fcz\/512x384.jpg","width":"480","height":"800"},{"id":"41682","title":"Christmas Sweeper","description":"Welcome to Christmas Sweeper! This is an amazing Match3 puzzle game with winter christmas items. Swipe to match 3 or more candy christmas items to pop them and finish your mission. Explore tons of amazing and chellenging puzzle levels and try to finish them all. Enjoy!","instructions":"Swipe to match 3 or more items","url":"https:\/\/html5.gamemonetize.com\/4kyqjbb3yexewc5lsgyfoay6mrjoqwn2\/","category":"Puzzle","tags":"Bejeweled, Candy, Christmas, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/4kyqjbb3yexewc5lsgyfoay6mrjoqwn2\/512x384.jpg","width":"720","height":"1280"},{"id":"34727","title":"Jewel Star : Match 3 Game","description":"Jewel Star, classic and addictive match-3 type game! It's aim is to complete the assigned goals in given moves or seconds. Jewel Star has various mode: Backplane Mode: eliminate all backplanes on the screen. Collection Mode: let treasures fall to the specified location. Features: - Pretty scene - Up to 160 levels - Combination of different advanced gems - Various obstacles which bring you even more fun - More levels will be comming soon...","instructions":"Simply swipe jewels using your finger or mouse and match 3 or more jewels to collect Complete the goal within given moves or seconds to win ","url":"https:\/\/html5.gamemonetize.com\/g8w5pd6617kr0fgku5i2h7gp3moihuwp\/","category":"Puzzle","tags":"1 Player, Bejeweled, Board, Casual, Jewel, Magic, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/g8w5pd6617kr0fgku5i2h7gp3moihuwp\/512x384.jpg","width":"800","height":"600"},{"id":"41368","title":"Slider Block Puzzle","description":"Slider Block 2048 -Puzzle Game 2248 Puzzle Game: Minimalistic & Elegantly designed Game which lets you think out of the box and sharpen your mind. The goal is to connect the same numbered blocks so they merge into higher numbers. You get to enjoy this amazing new puzzle game while improving your memory, concentration levels and reflexes at the same time. Once you start playing it, you will absolutely get addicted to this puzzle game.","instructions":"- Slide the same numbers in any of the eight directions down left right or diagonally to merge them - Get higher numbers when you merge multiple same numbers together - Keep merging numbers to get the highest number possible ","url":"https:\/\/html5.gamemonetize.com\/huhmrrm2g1p7pwxcoqtke7p8rvpqduyn\/","category":"Puzzle","tags":"1 Player, 2D, Android, Bejeweled, Block, Games, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/huhmrrm2g1p7pwxcoqtke7p8rvpqduyn\/512x384.jpg","width":"750","height":"1334"},{"id":"41415","title":"Peppa Pig Bubble Shooter","description":"A bubble shooter game such as this Peppa Big Bubble Shooter one is exactly what and how it sounds like, it is a game in which you have a cannon with which you can shoot cannons and it is of course a lot of fun. You will already have some bubbles in each level, already there in a mixed up pattern and your mission is to make them all disappear and that is how you solve a level.","instructions":"Use mouse","url":"https:\/\/html5.gamemonetize.com\/lwm03op9s8jb09siewh3xuu5i135wr9g\/","category":"Girls","tags":"Bubble Shooter","thumb":"https:\/\/img.gamemonetize.com\/lwm03op9s8jb09siewh3xuu5i135wr9g\/512x384.jpg","width":"430","height":"760"},{"id":"39677","title":"Bullee éclateurs","description":"Are you ready for a cool and interesting game, classic bubble shooter? You can point and shoot, pop the bubbles until all the baby dragons are saved. Play now! This game has more than 680 well-designed levels, more levels will be uploaded very soon！","instructions":"","url":"https:\/\/html5.gamemonetize.com\/qo3a0s6p4bnvcyx9lftylo3d2pcrm1du\/","category":"Clicker","tags":"Bubble Shooter, Click, Clicker, Shoot","thumb":"https:\/\/img.gamemonetize.com\/qo3a0s6p4bnvcyx9lftylo3d2pcrm1du\/512x384.jpg","width":"800","height":"600"},{"id":"33881","title":" Christmas at Cattle Hill Jigsaw Puzzle Games For ","description":"Christmas Jigsaw puzzles game about Christmas! The most realistic jigsaw experience you can get on a smart phone.It is a fun jigsaw puzzle game applicable for all ages.","instructions":"Mouse or tap to play","url":"https:\/\/html5.gamemonetize.com\/l8c732cc1lyojfeofszhn4b265om5611\/","category":"Bejeweled","tags":"2 Player Games, 3D Games, Animal, Candy, Car, Card, Cartoon, Detective, Disney, Doctor, Dora, Fairy, Family, Fantasy, Farm, Fashion, Food, Fruit, Fruits, Funny, Girls, Gun, Halloween, Hello Kitty, Island, Jewel, Jigsaw, jump, Jumping, Kart, Kid, Kill, Killing, King, Kiss, Kissing, Kiz 10, kiz10, Knight, Ladybug, Launch, Lego, Letters, Logic, Logical, Love, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/l8c732cc1lyojfeofszhn4b265om5611\/512x384.jpg","width":"800","height":"600"},{"id":"39164","title":"Kardashians Spooky Makeup","description":"The famous Kardashian sisters look bright and spectacular at every event. The Halloween party was no exception. The beauties decided to carefully approach its preparation. Head to them to help create incredible looks.","instructions":"Choose the appropriate dress up ","url":"https:\/\/html5.gamemonetize.com\/pjn3q5e2o0omv9udu2vh9whw06s35w7j\/","category":"Girls","tags":"Bejeweled, Celebrity, Cute, Dress Up, Girl, Girls, Halloween","thumb":"https:\/\/img.gamemonetize.com\/pjn3q5e2o0omv9udu2vh9whw06s35w7j\/512x384.jpg","width":"1280","height":"720"},{"id":"39092","title":"Farm Pop Match3","description":"Welcome to a new match3 puzzle game with veggies and fruits! Swipe to match 3 or more identical veggies to eliminate them and complete your mission. Enjoy tons of amazing and challenging levels and try to finish them all! Good luck!","instructions":"follow the game instructions","url":"https:\/\/html5.gamemonetize.com\/b30ktce7c8tbiaaaz79beig7023v8smy\/","category":"Puzzle","tags":"Bejeweled, Fruits, Match 3, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/b30ktce7c8tbiaaaz79beig7023v8smy\/512x384.jpg","width":"720","height":"1200"},{"id":"40452","title":"Space Bubble Shooter","description":"Space Adventure Matching is a interesting addictive match3 game with a theme from outer space. You can use your free time to enjoy the fun of it. Swap adjacent tiles, make the line of at least three candies of the same color and remove them from the field. Call your friends and enjoy it!","instructions":"mouse or fingers","url":"https:\/\/html5.gamemonetize.com\/2h657xu4vrby74iiv20ektikzoz8vm4u\/","category":"Puzzle","tags":".io, .io Games, 1 Player, 2 Player, 2 Player Games, 2D, 3D, 3D Games, 8 Ball Pool, Action, Adult, Adventure, Air, Aircraft, Alien, Android, Animal, Anime, Arkanoid, Army, Avoid, Baby, Baby Hazel, Balance, Ball, Ballon, Barbie, Baseball, Basketball, Batman, Battle, Battlegrounds, Bejeweled, Ben 10, Best, Bike, Billiard, Bird, Block, Blood, Bomb, Bounce, Bow, Boxing, Boy, Boys, Brain, Brawl, Bricks, Bridge, Bubble, Bubble Shooter, Cartoon Network, Cool, Craft, Crafting, Crazy, CSGO, cut, Cute, Fantasy, gta, HTML5, Hypercasual, Minecraft","thumb":"https:\/\/img.gamemonetize.com\/2h657xu4vrby74iiv20ektikzoz8vm4u\/512x384.jpg","width":"800","height":"600"},{"id":"38279","title":"Solitaire Classique","description":"You can't ask for a better app to relax with your family and test your SAGACITY! This game will delight Solitaire fans, delight card game aficionados and delight casual gamers!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/nsdahuvzyoduhfrbutl45r78x97ilkri\/","category":"Hypercasual","tags":"Game, Games, HTML, HTML5","thumb":"https:\/\/img.gamemonetize.com\/nsdahuvzyoduhfrbutl45r78x97ilkri\/512x384.jpg","width":"800","height":"600"},{"id":"40454","title":"Wood Gems Bubble Shooter","description":"Wood Gems is a game for Match 3 lovers, with fantastic graphics and nice music, you will never get enough of this game! Game by Gamesnout.com","instructions":"mouse and fingers","url":"https:\/\/html5.gamemonetize.com\/kffuspjmb45kdfhdnzeia3q2ys23zn3i\/","category":"Puzzle","tags":".io, .io Games, 1 Player, 2 Player, 2 Player Games, 2D, Aircraft, Alien, Android, Animal, Anime, Arcade, Ballon, Barbie, Baseball, Basketball, Batman, Bird, Block, Blood, Board, Boat, Bomb, Bricks, Bridge, Bubble, Bubble Shooter, Castle, Casual, Cat, Celebrity, Chicken, Clicker, Color, Coloring, Doctor, Dora, Dragon, Dragon Ball Z, fly, Football, Friv, Girl, Girls, Gold, Golf, Google, Grooming, Hello Kitty, Hidden, Highscore, Holiday, Kid, Kids, Kiss, Kiz 10, kiz10, Ski, Skill, Skills, Slacking","thumb":"https:\/\/img.gamemonetize.com\/kffuspjmb45kdfhdnzeia3q2ys23zn3i\/512x384.jpg","width":"800","height":"600"},{"id":"39564","title":"Princess Jewelry Designer Game","description":"Countless girls are crazy for all kinds of different jewelry, including precious diamonds and beautiful gems. If you are also a jewelry lover, try to become an excellent jewelry designer. In the game Princess Jewelry Designer, cut precious pink diamonds and set the sparkling broken diamonds around the pink diamonds to create the most beautiful eternal star in the world. Design a diamond brooch for our princess. Are you ready?","instructions":"Tap or click","url":"https:\/\/html5.gamemonetize.com\/hy6quiaw4qpwbahc6tjsn3knrdvt56wm\/","category":"Girls","tags":"Design, Dress Up, Fashion, Girls, Jewel, Princess","thumb":"https:\/\/img.gamemonetize.com\/hy6quiaw4qpwbahc6tjsn3knrdvt56wm\/512x384.jpg","width":"504","height":"800"},{"id":"39903","title":"Fruits Crush Saga","description":"Welcome to Fruits Crush Saga! This is an amazing Match3 Fruits puzzle game with tons of challenging levels. before the level start, you will see the mission pop-up! Connect 3 or more identical fruits to feed the little baby panda! When you connect 6 or more fruits you will get some power-ups. Let's feed the panda!","instructions":"Slide your finger or hold mouse click to connect fruits","url":"https:\/\/html5.gamemonetize.com\/ywvprm488wytxo96a49janhck6dzy94l\/","category":"Puzzle","tags":"Bejeweled, Candy, Fruit, Fruits, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ywvprm488wytxo96a49janhck6dzy94l\/512x384.jpg","width":"720","height":"1200"},{"id":"40038","title":"Santas Mission","description":"Help Santa get his gifts ready for Christmas! Each level brings a list of different items to collect like Santa hats, candy canes and gifts. Match three or more of each gift to get the required number of each and make it to the next level. But be quick and get them all before your time runs out!","instructions":"mouse fingers","url":"https:\/\/html5.gamemonetize.com\/p1m3cshfqp8kkqxqa330sqec71iqf8gg\/","category":"Puzzle","tags":".io, .io Games, 1 Player, 2 Player, Arcade, Avoid, Baby, Baby Hazel, Battle, Bejeweled, Ben 10, Bricks, Bridge, Bubble, Bubble Shooter, Cake, Candy, Christmas, Click, Clicker, Collecting, Collection, Color, Coloring, Crazy, Friv, Fruit, Fruits, Fun, Funny, Game, Games, Girl, H5, HTML5, Ice, Jewel, Logic, Logical, Match 3, Match-3, Match3, Matching, Mobile, Snow","thumb":"https:\/\/img.gamemonetize.com\/p1m3cshfqp8kkqxqa330sqec71iqf8gg\/512x384.jpg","width":"800","height":"600"},{"id":"39952","title":"Jewel Christmas Story","description":"The most anticipated holiday of the year is here! Christmas is just around the corner and lots of holiday fun full of gifts and sweets is waiting for you in this new match3 game. Collect game currency, achieve combos and use boosters in various missions.","instructions":"Use your quick-thinking mind and boosters to beat the levels Match at least three identical items and reach the goal of the missions Collect game currency which you can use to buy boosters in the shop and in loot box Unlock your path to move forward ","url":"https:\/\/html5.gamemonetize.com\/12fn9qj8i4g24tidgttgjxepa5atx3i5\/","category":"Puzzle","tags":"Christmas, Jewel, Match 3, Match-3, Match3","thumb":"https:\/\/img.gamemonetize.com\/12fn9qj8i4g24tidgttgjxepa5atx3i5\/512x384.jpg","width":"600","height":"800"},{"id":"39965","title":"Card Match Memory!","description":"Click the cards to flip. Memorize their position and match them up in pairs. Match all of the cards on the board to complete the level. It's time to check your memory skill now. What's the max level can you play?","instructions":"Touch or Click","url":"https:\/\/html5.gamemonetize.com\/9n6sf8z20uzn7ocpxkk5ak9ldtbp74fh\/","category":"Puzzle","tags":"Card, Memory, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/9n6sf8z20uzn7ocpxkk5ak9ldtbp74fh\/512x384.jpg","width":"800","height":"600"},{"id":"39123","title":"Solitaire Da Card","description":"Card games that have been played on PC for a long time can now be played on Android, this game is free without any in-app purchases, happy playing","instructions":"just use touch to drag to the destination","url":"https:\/\/html5.gamemonetize.com\/upqdal65df22tpo2y7pldwzel4sworr5\/","category":"Puzzle","tags":"Solitaire","thumb":"https:\/\/img.gamemonetize.com\/upqdal65df22tpo2y7pldwzel4sworr5\/512x384.jpg","width":"800","height":"600"},{"id":"39166","title":"Glow Nails Halloween","description":"Imagine that you have your own nail salon, where everyone can make beautiful hands for themselves. Experiment with different decorative elements by placing them on your polished nails.","instructions":"Choose the your favorite Halloween nails ","url":"https:\/\/html5.gamemonetize.com\/wpq9wxeikf2ow35wybuy895ku2lo5fhh\/","category":"Girls","tags":"Bejeweled, Dress Up, Girl, Girls, Halloween, Nail, Nails","thumb":"https:\/\/img.gamemonetize.com\/wpq9wxeikf2ow35wybuy895ku2lo5fhh\/512x384.jpg","width":"1280","height":"720"},{"id":"39186","title":"Sweet Baby Girl Halloween","description":"Halloween is the favorite holiday of many people. Both adults and children are diligently preparing for its celebration. The sweet girl is no exception. She wants to create the right atmosphere for a Halloween party. Can you help her with this?","instructions":"Choose your favorite Halloween make up ","url":"https:\/\/html5.gamemonetize.com\/k6ydzpxnv62oakc9xx54517udnugze89\/","category":"Girls","tags":"Bejeweled, Dress Up, Girl, Girls, Hair, Halloween, Nail, Nails","thumb":"https:\/\/img.gamemonetize.com\/k6ydzpxnv62oakc9xx54517udnugze89\/512x384.jpg","width":"1280","height":"720"},{"id":"37346","title":"Anna Tattoo Shop","description":"Princess Anne opened her own tattoo parlor. Even though this place has only been around for a few days, it has already become quite popular with a lot of people. Dozens of clients come here every day, and Anna simply cannot cope with such a flow of visitors. So she decided to hire an assistant in the salon.","instructions":"Mouse or tap to play ","url":"https:\/\/html5.gamemonetize.com\/w9p5q7myb9811fcdmf1knp6w0vr59b0z\/","category":"Girls","tags":"3D, 3D Games, Adult, Barbie, Draw, Drawing, Games, Girl, Girls, Makeover","thumb":"https:\/\/img.gamemonetize.com\/w9p5q7myb9811fcdmf1knp6w0vr59b0z\/512x384.jpg","width":"720","height":"1280"},{"id":"38554","title":"My Little Pony Jelly Match","description":"The game is made from a number of levels and as you advance in them, you will see the level of difficulty increasing , the target score higher and the given time remaining the same. Twilight Sparkle, Fluttershy, Apple Jack, Pinkie Pie and Rarity are waiting for you to join them in this new and amazing online game","instructions":"Use mouse","url":"https:\/\/html5.gamemonetize.com\/0mmffb4o8ywr6kgs469z4jqc43xhpcrf\/","category":"Girls","tags":"Bejeweled, Jelly, Pony","thumb":"https:\/\/img.gamemonetize.com\/0mmffb4o8ywr6kgs469z4jqc43xhpcrf\/512x384.jpg","width":"800","height":"600"},{"id":"38744","title":"Jewel Halloween","description":"Use your sharpness and logic in the new halloween game. Enjoy the adventure full of pumpkins, monsters and skeletons while collecting coins. Can you beat all the levels without getting scared?","instructions":"You have to match at least three items as sharply as possible By matching at least four items you can get more points and useful boosters like bombs If you need a little help try spinning the lucky wheel Collect as much coins as you can and become th","url":"https:\/\/html5.gamemonetize.com\/lu2tb0xkeqjlyzo2uh0u8n1gcowweu3b\/","category":"Puzzle","tags":"Halloween, Match 3, Match-3, Match3","thumb":"https:\/\/img.gamemonetize.com\/lu2tb0xkeqjlyzo2uh0u8n1gcowweu3b\/512x384.jpg","width":"600","height":"800"},{"id":"36879","title":"Cake Madness","description":"Do you like Match3 candy games? Well this game will blow your mind! Welcome to Cake Madness, a crazy cake match3 puzzle game! Your mission is to Match 3 identical Cakes to crush them and keep matching to unlock the next level. Good luck!","instructions":"follow the game instructions","url":"https:\/\/html5.gamemonetize.com\/jrrsc3mwxu23kdjj1rrf3txlgipo48ac\/","category":"Puzzle","tags":"Best, Cake, Candy, Casual, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/jrrsc3mwxu23kdjj1rrf3txlgipo48ac\/512x384.jpg","width":"720","height":"1280"},{"id":"37303","title":"Candy Pop Match3","description":"Welcome to this amazing puzzle match3 candy crush game. the game have tons of stunning and challenging levels and your mission is to complete them all. Swipe to match 3 or more colorful candies to clear them from the board. Good luck","instructions":"swipe to match and crush candies","url":"https:\/\/html5.gamemonetize.com\/4e8zpflhpplt5t6ya2ue4m4rpbdew9er\/","category":"Puzzle","tags":"Candy, Casual, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/4e8zpflhpplt5t6ya2ue4m4rpbdew9er\/512x384.jpg","width":"800","height":"1280"},{"id":"37298","title":"Fruits Master","description":"It's Matching Fruits Time ^^ Welcome to Fruits Master a crazy Match3 puzzle game with delicious fruits. Swipe to match 3 or more identical fruits to clear them or to create a super powerful booster. Each level has a unique Challenge and different Mission. Let's match fruits","instructions":"Swipe to match fruits","url":"https:\/\/html5.gamemonetize.com\/liaxyb5kl7ffmeecq7xczf30exmezo9w\/","category":"Puzzle","tags":"Candy, Fruits, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/liaxyb5kl7ffmeecq7xczf30exmezo9w\/512x384.jpg","width":"720","height":"1200"},{"id":"37181","title":"Bubble Hunter","description":"Bubble Hunter is a cool bubble shooter game. You are a little boy who goes on an adventurous journey into the jungle. There you should help him unlock the valuable objects from times long past play it on iyigames.com. Play with your mouse or your fingers and always match 3 or more of the same bubbles in the sky to remove them from the game and unlock the treasure. Bubble Hunter is a classic bubble shooter play it on iyigames.com. Bubble Hunter has over 1000 stages and still playable with no internet! You can aim and shoot to pop the bubble to make the best bubble blast! Continuous lucky shot will activate your bubble shooter boosters and you can pop the stage easy!","instructions":"Mouse Match Shoot bubbles ","url":"https:\/\/html5.gamemonetize.com\/ajav2b2twudkbn3oy3if8s2tx99kwjxl\/","category":"Bejeweled","tags":"1 Player, Android, Arcade, Bejeweled, Boys, Classic, Girls, HTML5, Jewel","thumb":"https:\/\/img.gamemonetize.com\/ajav2b2twudkbn3oy3if8s2tx99kwjxl\/512x384.jpg","width":"800","height":"600"},{"id":"36429","title":"Block Puzzle Gem: Jewel Blast","description":"Gem Puzzle - Very good and easy to play puzzle game on DOP5. To play the game , the player uses the mouse to drag and drop gem blocks onto the map, vertically or horizontally to break them and score points. The Puzzle Game will end if there is no space left on the screen for the puzzle. The goal is to drop blocks in order to create and destroy full lines on the screen both vertically and horizontally. Don't forget to keep the blocks from filling the screen in this addictive puzzle game. As a free simple strategy game, Block Puzzle Gem can improve your spatial skills while relieving stress!","instructions":" Drag and drop jewel blocks into the 10 10 grid ","url":"https:\/\/html5.gamemonetize.com\/cmy72lsak73fpjhk9oklyjbd8tscn1b3\/","category":"Puzzle","tags":"Arcade, Bejeweled, Block, Brain, Bricks, Jewel, Logic, Logical, Match 3, Matching, Puzzle, Tetris","thumb":"https:\/\/img.gamemonetize.com\/cmy72lsak73fpjhk9oklyjbd8tscn1b3\/512x384.jpg","width":"800","height":"600"},{"id":"31613","title":"Musical Bubble","description":"Welcome to Musical Bubble! Burst bubbles of the same color as fast as possible to earn points and finish all the levels. Use three different powers to help you: the aim, the bomb and the quick shot.","instructions":"Aim and shoot the bubble to make a chain of 3 or more same-color bubbles ","url":"https:\/\/html5.gamemonetize.com\/wrfwczqiwv93yheyu2b08pk9x3rknffl\/","category":"Bejeweled","tags":"Arcade, Bejeweled, Bubble, Bubble Shooter, Color, Match 3","thumb":"https:\/\/img.gamemonetize.com\/wrfwczqiwv93yheyu2b08pk9x3rknffl\/512x384.jpg","width":"600","height":"800"},{"id":"36221","title":"Eggs Match3","description":"Eggs Match is a match3 puzzle game where you connect 3 or more eggs of the same color to pop them and let the little birds fly. Explore tons of amazing and chellenging levels with cool graphics. Let's connect colorful eggs","instructions":"slide your finger or hold mouse click","url":"https:\/\/html5.gamemonetize.com\/e4bxzus5yudut7d7tlm76apmlgb7gnx0\/","category":"Puzzle","tags":"Casual, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/e4bxzus5yudut7d7tlm76apmlgb7gnx0\/512x384.jpg","width":"720","height":"1280"},{"id":"35799","title":"Juice Fresh","description":"Ready for some Juice Fresh? Smash Jelly, Splash fruits, use Candy for Crush cages Juice Fresh is a very addictive Match 3 Juice game. Features: - 50 well designed levels - Sweet powerful combo boosters and delicious power ups","instructions":"Mouse","url":"https:\/\/html5.gamemonetize.com\/eqtps29mou30mwd4jdijyqknysqnva3m\/","category":"Puzzle","tags":"2D, Arcade, Candy, Cartoon, Casual, Classic, Click, endless, Fruit, Fruits, Highscore, Hypercasual, Mahjong, Match 3, Match-3, Match3","thumb":"https:\/\/img.gamemonetize.com\/eqtps29mou30mwd4jdijyqknysqnva3m\/512x384.jpg","width":"960","height":"600"},{"id":"35971","title":"Gardenscapes","description":"Enjoy the adventure in the garden to escape from this magic adventure. Immerse yourself in an exciting match 3 game with many levels and excellent graphics. Help the little dog to solve all the match 3 puzzles and escape from the magic island using your skills, and amazing power ups to complete the levels. Features: ● Amazing graphics. ● Collect gems three in a row in hundreds of exciting levels. ● Immerse yourself in a fantasy world to help the little dog in this adventure. ● 40 Different levels. ● Enjoy great artwork and 3D characters. ● Amazing garden world for a game for one","instructions":"Touch and mouse","url":"https:\/\/html5.gamemonetize.com\/lhwjgp2l8nfxcvamvzh5mwiwwotkjy5t\/","category":"Puzzle","tags":".io Games, 1 Player, Animal, Arcade, Bejeweled, Block, Fairy, Games, HTML5, Magic, Match-3","thumb":"https:\/\/img.gamemonetize.com\/lhwjgp2l8nfxcvamvzh5mwiwwotkjy5t\/512x384.jpg","width":"720","height":"1280"},{"id":"35271","title":"Farm Story","description":"Farm Story is a very funny html5 game, with fantastic graphics and sweet music, you will never get enough of this game!","instructions":"Make your way through each level by matching three of the same shape to clear the screen before the timer runs out ","url":"https:\/\/html5.gamemonetize.com\/wljsaqp5r06lhe0pb795lw3cgjshsm09\/","category":"Puzzle","tags":".io, .io Games, 1 Player, 2 Player, 2 Player Games, 2D, 3D, Adult, Adventure, Air, Aircraft, Alien, Android, Baby, Baby Hazel, Balance, Ball, Ballon, Barbie, Baseball, Basketball, Batman, Battle, Battlegrounds, Bejeweled, Ben 10, Best, Bike, Billiard, Bird, Block, Blood, Board, Bomb, Bounce, Bow, Boxing, Boy, Bubble, Bubble Shooter, Burger, bus, Business, Cake, Candy, Car, Card, Cars, Cartoon, Cartoon Network, Castle, Casual, Cat, Celebrity, Chicken, Christmas, Clans, Clash, Classic, Cleaning, Coloring, Cook, Cooking, Cool, Craft, Crafting, Crazy","thumb":"https:\/\/img.gamemonetize.com\/wljsaqp5r06lhe0pb795lw3cgjshsm09\/512x384.jpg","width":"800","height":"600"},{"id":"35275","title":"Frozen Winter","description":"Frozen Winter is a game for Match 3 lovers, with fantastic graphics and nice music, you will never get enough of this game!","instructions":"Make your way through each level by matching three of the same shape to clear the screen before the timer runs out ","url":"https:\/\/html5.gamemonetize.com\/501ungddrb4vquem1toz9rtkr9akhxxi\/","category":"Puzzle","tags":".io, .io Games, 1 Player, 2 Player, 2 Player Games, 2D, 3D, 8 Ball Pool, Action, Adult, Adventure, Air, Aircraft, Alien, Android, Animal, Anime, Arcade, Arena, Arkanoid, Army, Avoid, Baby, Baby Hazel, Balance, Ball, Ballon, Barbie, Baseball, Basketball, Batman, Battle, Battlegrounds, Bejeweled, Ben 10, Best, Bike, Billiard, Bird, Block, Blood, Board, Boat, Bomb, Bounce, Bow, Boxing, Boy, Boys, Brain, Brawl, Bricks, Bridge, Bubble, Bubble Shooter, Burger, bus, Business, Cake, Candy, Car, Card, Cars, Cartoon, Cartoon Network, Casino, Castle, Casual","thumb":"https:\/\/img.gamemonetize.com\/501ungddrb4vquem1toz9rtkr9akhxxi\/512x384.jpg","width":"800","height":"600"},{"id":"35164","title":"Colors separation","description":"This is a relaxing game. Various levels to play freely, all unlocked! Drag the blocks to move them in a corresponding slot by color (red, blue, green, yellow, orange). No time. No pression!","instructions":"Drag Touch the blocks to sort them ","url":"https:\/\/html5.gamemonetize.com\/yzomsf8i15pdvnfg232lgfotxxpklpml\/","category":"Puzzle","tags":"Bejeweled, Board, Logic, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/yzomsf8i15pdvnfg232lgfotxxpklpml\/512x384.jpg","width":"600","height":"800"},{"id":"31705","title":"Sea Diamonds Challenge","description":"For the lovers of games with jewels or diamonds, this game offers a fun gaming experience. Look at the diamonds on the screen and try to find the largest group of same color. Tap on the groups of three or more. More and more diamonds will be displayed. Get the highest score before time is over.","instructions":"Try to match the same color diamonds to reach the high score Try to clear all the blocks you will get more bonus Explode diamond groups to raise the mana You can use this mana for special powers that will help you to clear diamonds from the sc","url":"https:\/\/html5.gamemonetize.com\/z2z25bmnea4cvmprbe6u9ay6bxfmtcc7\/","category":"Hypercasual","tags":"Bejeweled, Casual, Match 3, Matching","thumb":"https:\/\/img.gamemonetize.com\/z2z25bmnea4cvmprbe6u9ay6bxfmtcc7\/512x384.jpg","width":"600","height":"800"},{"id":"35194","title":"9x9 Rotate and Flip","description":"This is a 9x9 grid block game. You must fit the pieces to make horizontal or vertical matches. There are three game modes: 'Classic': Make as many rows and columns as possible to score. You will lose the game if you don't have more spaces to fit the pieces; 'By time': You lose when your time's up. But you can gain extra time by destroying rows or columns that have the power-up Time.; and Bombs: Destroy rows or columns with bombs to defuse them. If any bomb explode you lose!","instructions":"Touch in the pieces and drag to the grid to fit them ","url":"https:\/\/html5.gamemonetize.com\/egij1alkaj3k4gi9aij3q32hr2x9di1u\/","category":"Puzzle","tags":"2D, Hypercasual, Jewel, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/egij1alkaj3k4gi9aij3q32hr2x9di1u\/512x384.jpg","width":"800","height":"600"},{"id":"35205","title":"Candy Bubble Blast","description":"Welcome this is an amazing puzzle candy popping game. Bubble candies are falling from the sky! Pop 3 or more candies of the same color and finish the mission before candies touch the top of the board. Try to unlock all levels to win! Good luck","instructions":"Tap or click","url":"https:\/\/html5.gamemonetize.com\/dbf0t2d1z20w0xy9pi2o6arr2tbqzcez\/","category":"Puzzle","tags":"Block, Bubble, Candy, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/dbf0t2d1z20w0xy9pi2o6arr2tbqzcez\/512x384.jpg","width":"720","height":"1280"},{"id":"35183","title":"Island Puzzle","description":"WELCOME TO THE FUNNIEST JUNGLE PUZZLE ADVENTURE GAME! Start an exciting adventure in the cutest jungle puzzle matching game! Help the brave pilot and charming cat Tom survive on a desert island. Restore and decorate different areas in the island, get to the bottom of the secrets it holds, and enjoy the company of amusing in-game characters. What are you waiting for? Indulge yourself and become the hero of a brand new story. Build your dream island for free! Search for rare and unique artifacts by playing with curious pets, connecting them together in lines as long as possible. Play with little Tom cat, get powerful boosters and help collect precious items!","instructions":"Mouse Touch","url":"https:\/\/html5.gamemonetize.com\/ono1u6bmtkk11a03q9ulcy4hjzdcpxc6\/","category":"Puzzle","tags":"Adult, Bejeweled, Best, Brain, Casual, Classic, Clicker, Decorate, Decoration, Family, Girls, HTML5, Jewel, Match 3, Match-3, Match3, Math, Mind, Puzzle, Relaxation, Zuma","thumb":"https:\/\/img.gamemonetize.com\/ono1u6bmtkk11a03q9ulcy4hjzdcpxc6\/512x384.jpg","width":"800","height":"600"},{"id":"34514","title":"nine31!","description":"Nine 31 is a matching game. You must match 9 diamonds in the correct order before time runs out. -test your memory -race against time","instructions":"It is played with mouse or touch only ","url":"https:\/\/html5.gamemonetize.com\/slpha1l2x807ssnhbkmzknrcr5yn1u8r\/","category":"Puzzle","tags":"Casual, Click, Match 3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/slpha1l2x807ssnhbkmzknrcr5yn1u8r\/512x384.jpg","width":"480","height":"854"},{"id":"32990","title":"Jewel Maya","description":"Do you like classic jewel games? Of course, yes! But what's about jewels and diamonds in mysterious and fresh jungle location? Meet new and free match-3 game: Jewel Maya The main feature of the game is a unique atmosphere of the ancient Maya’s world. Lost jewels, rare totems, treasure quests and temple jewels are here too! Also, Jewels Maya has the most amazing features from free match 3 games and jewel games such as beautiful gems, jewels and diamonds, smooth crushing animations, interesting levels and even more! It contains the aesthetic of a classic jewel quest game. - Small size! The game takes just a bit of space on your device - No wifi needed. The game is a part of casual and easy offline games - Fresh jungle visual style like in the other cool puzzle adventure games! - Crush and blast puzzles in match 3 adventure game! - Maya vibes in every game aspect: jewels, chests, temple, rare treasures and music! - No time and lives limit! Crush gems & jewels without interaction! - Light and fresh design of jewels and diamonds. Each ruby, gem and diamond looks like a charm! - Interesting 3 in a row levels and jungle quests - New puzzle game with an amazing story for adults and kids. Crush puzzles like in popular jewels classic games! Jewels Maya Quest will provide you a real challenge for hours! The game has a lot of dynamic three in a row levels, where you can use powerful helpers to blitz all them.","instructions":"Swap and match gems like in free matching games Make combinations with 3 and more jewels Blast helpers and win prices Collect stars and get rewards Find lost jewels ","url":"https:\/\/html5.gamemonetize.com\/rwrx6kz2i2izwnxa9j2981pifrwppcyk\/","category":"Hypercasual","tags":"Bejeweled, Highscore, HTML5, Jewel, Magic, Match 3, Match-3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/rwrx6kz2i2izwnxa9j2981pifrwppcyk\/512x384.jpg","width":"800","height":"600"},{"id":"33245","title":"Fruits Link Match3","description":"Welcome to Fruits Link Match3 Puzzle Game! Swipe to link 3 or more identical fruits and try to complete your level as soon as possible to unlock the other one. Explore many challenging levels and try to complete them all. Good luck!","instructions":"mouse click or slide your finger","url":"https:\/\/html5.gamemonetize.com\/4vbldwud0mxsa1l248kwituglkf6yt3f\/","category":"Puzzle","tags":"Bejeweled, Fruit, Fruits, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/4vbldwud0mxsa1l248kwituglkf6yt3f\/512x384.jpg","width":"720","height":"1280"},{"id":"33405","title":"Animal Tiles","description":"Animal Tiles Game requires you to match 3 blocks of the same element, you will pass the level when all tiles are matched. Which is different with Mahjong or other block puzzle game. Tile Master Match consists a large number of levels that get progressively more difficult.","instructions":" Tap to match 3 blocks of the same element","url":"https:\/\/html5.gamemonetize.com\/xlw1gis0phxca7qwg2m20ho2r88j5rws\/","category":"Bejeweled","tags":"Animal, Arcade, Bejeweled, Block, Bubble, Bubble Shooter, Candy, Casual, Cute, Mahjong, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/xlw1gis0phxca7qwg2m20ho2r88j5rws\/512x384.jpg","width":"540","height":"960"},{"id":"33202","title":"Wood Gems Full","description":"Wood Gems Full","instructions":"Wood Gems Full","url":"https:\/\/html5.gamemonetize.com\/wjl8pwojsivpvx3ftdj335iybwuvaar2\/","category":"Girls","tags":"2D","thumb":"https:\/\/img.gamemonetize.com\/wjl8pwojsivpvx3ftdj335iybwuvaar2\/512x384.jpg","width":"800","height":"600"},{"id":"33200","title":"Donuts","description":"Donuts","instructions":"Donuts","url":"https:\/\/html5.gamemonetize.com\/werc38dqw8t5v1yi4hb8z6uxxwy3laoc\/","category":"Hypercasual","tags":"2D","thumb":"https:\/\/img.gamemonetize.com\/werc38dqw8t5v1yi4hb8z6uxxwy3laoc\/512x384.jpg","width":"800","height":"600"},{"id":"31528","title":"Fury Dash","description":"Fury Dash is a match-3 game in which you must touch groups of diamonds to make them explode. Chain explosions as fast as you can to activate fury mode and use your magical powers to earn lots of points. Be careful: If you touch a group that contains less than three diamonds, it won’t explode!","instructions":"Show your superiority through two game modes In the Time Trial mode you have two minutes to earn the biggest score In the Survival mode you must reach an ever-growing score How far can you go ","url":"https:\/\/html5.gamemonetize.com\/gksbldmjr5qnib5keoje0vd9gc98wcp0\/","category":"Bejeweled","tags":"Arcade, Color, Match 3, Matching","thumb":"https:\/\/img.gamemonetize.com\/gksbldmjr5qnib5keoje0vd9gc98wcp0\/512x384.jpg","width":"600","height":"800"},{"id":"31791","title":"Candy Eyes Match","description":"Candy Eyes Match is a match3 Puzzle Game! Swipe to match 3 or more colorful eye candies to clear them from the board and complete your task. Combin 4 or more candies to create more powefull candies","instructions":"swipe to match","url":"https:\/\/html5.gamemonetize.com\/wd2tmiiemiwl2yfrwjinycvsdsrv5y9v\/","category":"Puzzle","tags":"Candy, Match 3, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/wd2tmiiemiwl2yfrwjinycvsdsrv5y9v\/512x384.jpg","width":"720","height":"1280"},{"id":"30933","title":"Gem Shoot","description":"Link any 3 gems together. \"Gem Shoot\" is special type of match 3 game. Unlike others match 3 game, you cannot more the gem. There is a gem on the bottom, you can select one of the path the shoot out the gem. Any 3 or more gem linked together the gems will be destroyed. More than 3 gems link together, it will form a new type special gem. \"Gem Shoot\" is combination game of match 3 and bubble shoot. It will provide you an other type of experience.","instructions":"Mouse and Keyboard","url":"https:\/\/html5.gamemonetize.com\/qtn4hjwedn71me0xbltqpg0lqemsvnxl\/","category":"Puzzle","tags":"Arcade, Block, Board, Bomb, Bricks, Bubble, Casual, Logic, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/qtn4hjwedn71me0xbltqpg0lqemsvnxl\/512x384.jpg","width":"800","height":"600"},{"id":"30830","title":"Fruits Juice Crush","description":"Fruit Juice Crush is an amazing match3 puzzle game! Swipe to match 3 or more Fruit juices of the same color to clear them from the board and complete your mission. Explore tons of challenging levels and try to unlock them All. Good Luck! Game by vodogame.com","instructions":"swipe to match elements","url":"https:\/\/html5.gamemonetize.com\/30cf93dr50hzhm8tslo7412ttk0hg796\/","category":"Bejeweled","tags":"Bejeweled, Candy, Casual, Color, Fruits, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/30cf93dr50hzhm8tslo7412ttk0hg796\/512x384.jpg","width":"720","height":"1280"},{"id":"30467","title":"Jewelry Match 3 Kit","description":"Jewelry Match 3 Kit is complete game tamplate for your Match 3 games. Help the girl get the JEWEL for her hairpin. Remove all obstacles so that the JEWEL touches the dotted line. Swipe bubbles of the same color to WIN! Do additional tasks. Use EDITOR to create your unique level disign.","instructions":"Tap to Play ","url":"https:\/\/html5.gamemonetize.com\/b0dy4iv06o95b7l2uehj3u6muv5ngt9y\/","category":"Hypercasual","tags":"Match 3, Matching","thumb":"https:\/\/img.gamemonetize.com\/b0dy4iv06o95b7l2uehj3u6muv5ngt9y\/512x384.jpg","width":"800","height":"600"},{"id":"29986","title":"Juicy Fruits Match3","description":"Juicy Fruits Match3 is an amazing and satisfying puzzle game. Just Swipe and match 3 or more delicious fruits to pop them. Challenge yourself and complete all rounds. Match 4 identical fruits to create boosters. Let's go","instructions":"swipe to match friuts","url":"https:\/\/html5.gamemonetize.com\/k8mfcdv8f1q8mvc8rjgnis1f31ve810b\/","category":"Puzzle","tags":"Bejeweled, Best, Casual, Clicker, Hot, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/k8mfcdv8f1q8mvc8rjgnis1f31ve810b\/512x384.jpg","width":"720","height":"1280"},{"id":"30395","title":"Gift Candy Match","description":"Welcome to Gift Candy Match! Slide your finger to connect 3 or more Gift boxes of the same color to create Candies. Match more gift to kill the blue monsters to not let them eat your score. Challenge youself and get a high score","instructions":"slide your finger or hold mouse click","url":"https:\/\/html5.gamemonetize.com\/ici9dvaigpotyoh7e6kaush3lebcvcfp\/","category":"Puzzle","tags":"Candy, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ici9dvaigpotyoh7e6kaush3lebcvcfp\/512x384.jpg","width":"720","height":"1280"},{"id":"30453","title":"Sweet Candy Puzzles","description":"Welcome to the Sweet candy Puzzle! Slide your finger and match 3 or more colorful Butterflies to transform them to delicious candies and eliminate then. Explore tons of amazing and chellenging levels and try to complete them all. Enjoy","instructions":"Touch and slide your finger to match Butterflies","url":"https:\/\/html5.gamemonetize.com\/d1h4xz5cwzlfpgrry3m9hprlfrxwbe23\/","category":"Puzzle","tags":"Bejeweled, Clicker, Color, Hot, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/d1h4xz5cwzlfpgrry3m9hprlfrxwbe23\/512x384.jpg","width":"720","height":"1280"},{"id":"29860","title":"Jewels Blitz 2","description":"This intriguing puzzle adventure will catch your attention and satisfy your thirst for fun at once! Discover magical combos by transforming jewels into exploding gems. The gems will help you to pass different levels of the quest and walk you through your mystical path! Thrilling surprises and breathtaking mysteries are waiting for you in this magical world of puzzles!","instructions":"Move jewelry and match at least three identical colored jewelry and get highscore ","url":"https:\/\/html5.gamemonetize.com\/b5wtl7537msqtn0gxbn4ygc2e3ih1542\/","category":"Puzzle","tags":"Bejeweled, Boys, Fun, Girls, Highscore, Jewel, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/b5wtl7537msqtn0gxbn4ygc2e3ih1542\/512x384.jpg","width":"800","height":"600"},{"id":"29467","title":"Bubbles Number","description":"Welcome to this amazing bubble number Shooter. Your mission is to aim and shoot bubbles to prevent them from touching the bottom and Collect fruits while shooting bubbles Try to unlock all levels and enjoy this amazing puzzle game. Have fun","instructions":"aim and shoot","url":"https:\/\/html5.gamemonetize.com\/478pa7w1j9o60103w4uj24ossdg9dfs0\/","category":"Puzzle","tags":"Best, Bubble, Bubble Shooter, Clicker, Hot, Number","thumb":"https:\/\/img.gamemonetize.com\/478pa7w1j9o60103w4uj24ossdg9dfs0\/512x384.jpg","width":"720","height":"1250"},{"id":"29079","title":"Candy Bubble Spin","description":"Welcome to Candy Bubble Spin, a new kind of bubble shooter games. Aim and shoot rotating candies and bubble to clear them from the board. Explore tons of challenging levels and try to complete them all. have fun!","instructions":"aim and release to shoot bubbles","url":"https:\/\/html5.gamemonetize.com\/skudbm8fi1gs7vtfchshoh5y5o6fynrs\/","category":"Puzzle","tags":"Bejeweled, Bubble, Bubble Shooter, Candy, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/skudbm8fi1gs7vtfchshoh5y5o6fynrs\/512x384.jpg","width":"720","height":"1280"},{"id":"28928","title":"Blast Boxes","description":"Hello Welcome to Blast Boxes, a new puzzle match3 game. Tap on 2 or more similar boxes to remove them. Tap on 6 similar boxes to Create a bomb bonus that will remove all boxes of the same color. Good luck","instructions":"tap or click","url":"https:\/\/html5.gamemonetize.com\/8tw4ezfqptbr08ck1p9j9rosnfgkrdh8\/","category":"Puzzle","tags":"Block, Casual, Color, Match 3, Match-3, Match3, Matching, Tetris","thumb":"https:\/\/img.gamemonetize.com\/8tw4ezfqptbr08ck1p9j9rosnfgkrdh8\/512x384.jpg","width":"800","height":"600"},{"id":"28871","title":"Sweet Crush","description":"Sweet Crush is a match-3 game. Match-3 is a popular type of casual puzzle game. The objective of the game is to make combinations of candies of the same type to pop the candies and earn points. With various types of unique power-ups you can pop candies of the same type\/color, pop all the candies on the screen or even pop a \"candy bomb\", to clear a candy region and accumulate more points. Play with your friends and get the highest score possible!","instructions":"Desktop Mouse click Drag and Drop Mobile Touch Buttons on Screen","url":"https:\/\/html5.gamemonetize.com\/autqf4l4tk3fsx8qrrw3jia3tvkiwbz4\/","category":"Puzzle","tags":"Bejeweled, Candy, Game, Hypercasual, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/autqf4l4tk3fsx8qrrw3jia3tvkiwbz4\/512x384.jpg","width":"1280","height":"720"},{"id":"29025","title":"Harvest Farm Link","description":"Harvest Farm Link Slide your finger to link identical fruits and vegetables to clear them from the board. Link more elements to create powerful fruits and veggies. explore tons of amazing and challenging levels. Good luck","instructions":"slide finger to mouse click","url":"https:\/\/html5.gamemonetize.com\/f20sqmwqx7677kzesbf9uvnp7xc1r2s4\/","category":"Puzzle","tags":"Best, Casual, Friv, Fruit, Fruits, Hot, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/f20sqmwqx7677kzesbf9uvnp7xc1r2s4\/512x384.jpg","width":"800","height":"600"},{"id":"29033","title":"Candy Jewel Crush","description":"Cake Crunch is an amazing match3 puzzle game where you can swipe, match and crush delicious cakes. -How to Play : Swap and match 3 or more similar candies to create a line crush Reach high scores using fewer moves. Complete the missions and beat obstacles. Explore tons of challenging matching levels. -Features of Cake Crunch: Many unique and challenging levels. Smooth and clean graphics and sound effects. High quality soundtrack & game music. Easy to play but hard to master. Come and enjoy the amazing & addictive match 3 puzzle experience you could ever have. Share this cool match-3 game with family and friends and see who can complete all levels and missions! Good Luck & Have fun!!!","instructions":"swipe to match colorful candies","url":"https:\/\/html5.gamemonetize.com\/6g1gsmofkobu9r86vvpbm9i2qqr25uhx\/","category":"Puzzle","tags":"Bejeweled, Hypercasual, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/6g1gsmofkobu9r86vvpbm9i2qqr25uhx\/512x384.jpg","width":"720","height":"1280"},{"id":"28862","title":"Mushroom Match","description":"Mushroom Match is an amazing match3 puzzle game. your mission is to match 3 or more identical mushrooms to clear them from the board and complete your levels. Enjoy","instructions":"Swipe to match Mushrooms","url":"https:\/\/html5.gamemonetize.com\/jua8hl6ggdgjs3dsfh6bemiwuby9jfcr\/","category":"Puzzle","tags":"Bejeweled, Best, Brain, Casual, Color, Hot, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/jua8hl6ggdgjs3dsfh6bemiwuby9jfcr\/512x384.jpg","width":"720","height":"1270"},{"id":"28633","title":"Fruits Pop","description":"Welcome to a new Fruits bubble shooting game. Fruits Pop comes with a new game logic. Help the little pets trapped inside by shooting fruits. you need to shoot 2 or more identical fruit to clear them from the board. The game will help you sometimes with some magical bubbles. Explore some amazing and challenging levels. Let's pop all fruits","instructions":"Slide to aim and shoot","url":"https:\/\/html5.gamemonetize.com\/jrkzac7i18hbvjnub9dl0d7lgztbmyjz\/","category":"Bejeweled","tags":"Best, Bubble, Bubble Shooter, Casual, Clicker, Color, Fruit, Fruits, Hot, Hypercasual, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/jrkzac7i18hbvjnub9dl0d7lgztbmyjz\/512x384.jpg","width":"720","height":"1250"},{"id":"28228","title":"Farm Crush - Match3 Game","description":"Farm Crush - Match3 Game is a classic match3 puzzle game. Match 3 or more identical Fruits and remove all brown Tiles. Explore tons of crazy missions and try to unlock them all. Let's go","instructions":"Swipe to match fruits","url":"https:\/\/html5.gamemonetize.com\/i93cpu3dlrclzyqbl5lb0g4pgjaz2ig0\/","category":"Puzzle","tags":"Best, Casual, Clicker, Color, Hot, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/i93cpu3dlrclzyqbl5lb0g4pgjaz2ig0\/512x384.jpg","width":"720","height":"1280"},{"id":"28147","title":"Ben 10 Alien Match","description":"Ben 10 aliens fourarm diamondhead fireball and slapback matching game. Down the aliens falling from above to wherever you want by tapping right or left on the screen. You get points when you put at least 3 same in a row.","instructions":"Put the aliens wherever you want by tapping right or left on the screen","url":"https:\/\/html5.gamemonetize.com\/rjwm2qv55u8h8h5hjs34gipad685wikx\/","category":"Puzzle","tags":"Bejeweled, Ben 10, Boy, Game, Games, Match 3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/rjwm2qv55u8h8h5hjs34gipad685wikx\/512x384.jpg","width":"508","height":"903"},{"id":"27854","title":"Block Puzzle Match","description":"Welcome to Block Puzzle Match. This is a popular classic puzzle game with amazing features. All you have to do is to drag and drop colorful shape and try to form vertical or horizontal line to clear them from the board. Use your brain and always leave space for the biggest shapes to not get stuck. Let's have fun","instructions":"click or tap and drag","url":"https:\/\/html5.gamemonetize.com\/ciwelbiz0erbwihav34u9y1kofh5f2wl\/","category":"Puzzle","tags":"Arcade, Arkanoid, Best, Block, Brain, Casual, Color, Hot, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ciwelbiz0erbwihav34u9y1kofh5f2wl\/512x384.jpg","width":"720","height":"1280"},{"id":"27826","title":"Ancient Egypt - match 3 game","description":"Welcome to Ancient Egypt! Your mission is to swipe and match 3 or more identical objects to clear them from the board and complete your level. Explore challenging levels and try to complete them all. Good Luck. www.durmangames.com","instructions":"LBM or tap","url":"https:\/\/html5.gamemonetize.com\/fokb8w4v5qcjz6ceeupfgngxozk1f0gn\/","category":"Puzzle","tags":"Bejeweled, Candy, Jewel, Match 3, Match-3, Match3, Matching, Puzzle, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/fokb8w4v5qcjz6ceeupfgngxozk1f0gn\/512x384.jpg","width":"800","height":"600"},{"id":"27359","title":"Tik Tok DJ","description":"Four girlfriends want you to help choose their own unique look for each of them, after which the girls could take part in a tik-tok event.","instructions":"Click on the screen ","url":"https:\/\/html5.gamemonetize.com\/qf0n45tfrtkgasrnim0pt0yn9imm6kao\/","category":"Girls","tags":"Dating, Dora, Dress Up, Family, Fashion, Girl, Girls, HTML, HTML5","thumb":"https:\/\/img.gamemonetize.com\/qf0n45tfrtkgasrnim0pt0yn9imm6kao\/512x384.jpg","width":"800","height":"600"},{"id":"27690","title":"Marble Smash","description":"Welcome to marble Smash Just Tap 3 or more similar Marbles to smash them and complete your level Explore tons of challenging level and missions You can also play Time attack mode. Enjoy","instructions":"click or tap","url":"https:\/\/html5.gamemonetize.com\/2wlwrshdq0s14qpof6vcfs5eoh8nt0cn\/","category":"Puzzle","tags":"Best, Bubble, Color, Hot, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/2wlwrshdq0s14qpof6vcfs5eoh8nt0cn\/512x384.jpg","width":"800","height":"600"},{"id":"27301","title":"Mahjong connect : majong classic (Onet game)","description":"In MAHJONG CONNECT game, your goal is to find all matching pairs. It's a kind of matching game or connect game (\"linker\"), that is very fun to play, really challenging and very addictive. If you like cute mahonjong games and if you like puzzle games, you will love MAHJONG CONNECT, by far the best deluxe version of the onet type games.","instructions":"Mouse and keyboard ","url":"https:\/\/html5.gamemonetize.com\/nj3buicijh9sgub8ahcgu902uguvo9es\/","category":"Puzzle","tags":"Bejeweled, Game, Games, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/nj3buicijh9sgub8ahcgu902uguvo9es\/512x384.jpg","width":"800","height":"600"},{"id":"27442","title":"Magical Jewels","description":"This is Magical Jewels, match3 Casual game with various missions. All you have to do is match 3 or more similar jewels to crush them. in every levels you will have to collect Jewels listed in top left to complete the mission. have fun","instructions":"swipe to match jewels","url":"https:\/\/html5.gamemonetize.com\/7fb681w6m0n6ilh1b5xqrv8ajbhghex6\/","category":"Puzzle","tags":"Brain, Color, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/7fb681w6m0n6ilh1b5xqrv8ajbhghex6\/512x384.jpg","width":"800","height":"600"},{"id":"27440","title":"Matching Madness","description":"Welcome to Matching Madness! All of us should anjoy this match3 puzzle game! Your mission is to swipe and match 3 or more identical colorful creatures to clear them from the board and complete your level. Explore almost 100 chellenging levels and missions and try to complete them all. Let's do it","instructions":"swipe to match elements","url":"https:\/\/html5.gamemonetize.com\/p0l5razkdx2jpiaygvq4a0aeg6zitv0r\/","category":"Puzzle","tags":"Brain, Casual, Color, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/p0l5razkdx2jpiaygvq4a0aeg6zitv0r\/512x384.jpg","width":"800","height":"600"},{"id":"27006","title":"Christmas Crush","description":"It's Christmas Time Welcome to Christmas Crush Match3 Game with Amazing Christmas Jewels. Swipe and match 3 or more colorful Christmas elements and watch the magic Explore Tons of amazing challenging levels and missions. Enjoy Rocket and bomb Power-ups and more surprising boosters. Merry Christmas","instructions":"swipe to match elements","url":"https:\/\/html5.gamemonetize.com\/0nskoxltlkchmyugpykpfc26zq5gdynz\/","category":"Puzzle","tags":"Bejeweled, Best, Brain, Candy, Casual, Christmas, Hot, Hypercasual, Jewel, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/0nskoxltlkchmyugpykpfc26zq5gdynz\/512x384.jpg","width":"800","height":"600"},{"id":"27023","title":"Magic Match","description":"You get Boom and Line removal booster to speed up your challenge. You will get these items if you match 5 or more blocks. Tap or click any block with same color, 2 blocks at minimum. Can you complete all levels ?","instructions":"Use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/a1w0rw42h7oqu3zjsqra85hjrw9dkcdv\/","category":"Puzzle","tags":"Bejeweled, Candy, Match 3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/a1w0rw42h7oqu3zjsqra85hjrw9dkcdv\/512x384.jpg","width":"800","height":"600"},{"id":"26991","title":"Pet Pop","description":"Do you love cute match 3 games? This game is just right one for you! Cute Pet Match game features various cute items in colorful graphics and many game styles. Swipe and match 3 or more similar pets to clear them from the board. Explore some challenging missions and obstacles and try to complete them all You can get special game boosters to make the game even more addicting and easy to play! Enjoy!","instructions":"swipe your finger or hold mouse click and slide","url":"https:\/\/html5.gamemonetize.com\/uqaadn0no83mna2re4c5th3d4y90aruq\/","category":"Puzzle","tags":"Animal, Best, Casual, Color, Hot, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/uqaadn0no83mna2re4c5th3d4y90aruq\/512x384.jpg","width":"800","height":"600"},{"id":"26682","title":"Color Mixed Up","description":"Color Mixed Up an educational game to play on! Opps all the word got mixed up! all the words got messy, so make the blocks move and arrange them to create and solve the puzzle to find the five hidden words which are hiding to find out.","instructions":"Use your mouse to play ","url":"https:\/\/html5.gamemonetize.com\/j4oe0f6cq2qg2knihsrs0lh8mym3naf9\/","category":"Puzzle","tags":"Bejeweled, Block, Educational, Family, Puzzle, Word","thumb":"https:\/\/img.gamemonetize.com\/j4oe0f6cq2qg2knihsrs0lh8mym3naf9\/512x384.jpg","width":"768","height":"1024"},{"id":"26498","title":"Words Geems","description":"The objective of Words Geems is to make as many 3 - 8 letter words as you can before the 3 minute clock runs out. Using the gems in your words will increase your word score. Pink gems will 2x your score, Blue gems will 3x your score and Purple gems will 5x your score. Pausing the game more than 3 times in one round will reset the game. Words Geems is very fun for the whole family! Product feature bullets • Great for all family • Never get the same puzzle twice • Nice graphics • Local scoreboard • Awesome puzzle logic game","instructions":"Use your mouse to play ","url":"https:\/\/html5.gamemonetize.com\/pvgp5noxuh7xmbqhdhvkdni9mh5ipxsj\/","category":"Puzzle","tags":"Block, Family, Letters, Logic, Logical, Puzzle, Word","thumb":"https:\/\/img.gamemonetize.com\/pvgp5noxuh7xmbqhdhvkdni9mh5ipxsj\/512x384.jpg","width":"1024","height":"600"},{"id":"26797","title":"Christmas Match Three","description":"Happy New Year to all match3 game lovers and welcome to a new match3 puzzle game. Swipe and Match 3 or more similar christmas elements to complete your level to let Santa deliver Gifts. Explore tons of challenging levels and try to unlock them all. Merry Christmas","instructions":"swipe to match","url":"https:\/\/html5.gamemonetize.com\/v7tv066mplqx6xpen1cocrniwqnpgq1s\/","category":"Puzzle","tags":"Arcade, Bejeweled, Best, Casual, Christmas, Hot, Match 3, Match-3, Match3, Matching, Puzzle, Snow","thumb":"https:\/\/img.gamemonetize.com\/v7tv066mplqx6xpen1cocrniwqnpgq1s\/512x384.jpg","width":"720","height":"1280"},{"id":"26112","title":"Candy Bonanza 5 in Row","description":"Click the candy you want to move, then click the place that you want it to go. but if other candies were on the moving route, you cannot pass through. Your mission is to move candies to align the same color of candies for 5 or more in a horizontal, vertical or diagonal line to crush. Get a high score and visite hyhygames.com for more games","instructions":"click on candy then click on the place you want it to go ","url":"https:\/\/html5.gamemonetize.com\/ddc0mpt6pn54qibvvncg9ttncf5b284f\/","category":"Bejeweled","tags":"Best, Candy, Clicker, Hot, Match 3, Match-3","thumb":"https:\/\/img.gamemonetize.com\/ddc0mpt6pn54qibvvncg9ttncf5b284f\/512x384.jpg","width":"800","height":"600"},{"id":"21032","title":"Fashion Glam Princess","description":"If you like dress up games, you’ll LOVE this one. Fashion Glam Princess offers you some cool Dress up clothes Tap to open the boxes and try to make the princess beautiful","instructions":"tap to play","url":"https:\/\/html5.gamemonetize.com\/xexq3xdd43yiwsqc3ok74tp86ij23555\/","category":"Girls","tags":"Dress Up, Frozen, Girl, Girls, HTML, HTML5, Princess","thumb":"https:\/\/img.gamemonetize.com\/xexq3xdd43yiwsqc3ok74tp86ij23555\/512x384.jpg","width":"800","height":"600"},{"id":"25194","title":"Alchemist Lab - Jewel Crush","description":"Welcome to the world of Alchemy Match3 Lab Make a simple match for 3 Jewel elements to clar them and Match 4 or 5 chips to generate bonuses. Match bonus with gem to activate it, then Match bonuses with each other to generate philosopher's stone. Explore more than 100 challenging levels. Have fun","instructions":"swipe to match colorful gems","url":"https:\/\/html5.gamemonetize.com\/152k8bm16yx6mjq1tq6w1l7vmrh8vz17\/","category":"Puzzle","tags":"Best, Candy, Color, Hot, Match 3, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/152k8bm16yx6mjq1tq6w1l7vmrh8vz17\/512x384.jpg","width":"800","height":"600"},{"id":"22873","title":"Candy Dalgona","description":"Welcome to Dalgona Candy - Dalgona Game. This is a game about the squid hiding in dalgona sweets honeycomb. Cut the squid out of the candy and have fun. It is not so easy challenge. You need to be careful to keep the squid shape cookies. Dalgona Candy - Dalgona Game is a new popular game where leave the shape in the middle dalgona candy. You have many levels in the game where you can cut out different shapes dalgona candy - hearts, squid, flowers, animals and different images. Cut honeycomb squid and other images from dalgona candies is a soothing 3D game. Take part in this candy challenge and cut all the images from dalgona. The squid is waiting to be cut from the dalgona candy cookie. Dalgona Candy - Dalgona Game to everyone who loves sweets and 3D games with candy challenge. Carve out different shapes from the honeycomb cookie and enjoy the result of the squid. Dalgona candy honeycomb is a new favorite sweet with hearts, squid and other images in the game. We are waiting for you in the Dalgona Candy - Dalgona Game.","instructions":"Swip to match Candy ","url":"https:\/\/html5.gamemonetize.com\/nd6h5obzi5nd95l82heg70xd7wfzp1h7\/","category":"Puzzle","tags":"Candy, Game, Halloween, Match 3, Maze, New, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/nd6h5obzi5nd95l82heg70xd7wfzp1h7\/512x384.jpg","width":"800","height":"600"},{"id":"23869","title":"Pipe Lines : Hexa","description":"Pipe Lines : Hexa is a Connect Line puzzle game that’ll keep your mind entertained for hours! Let your brain juices flow in this simple yet challenging game.","instructions":" Hundreds of unique levels to play Daily puzzle challenges and rewards Ranking - Amaze your friends with your high score Awesome rotate mode Beautiful graphics and animations with a catchy soundtrack Stay tuned for regular updates ","url":"https:\/\/html5.gamemonetize.com\/9fwn1ewe5w6zp9ta2vsai9kxef3jkhbm\/","category":"Puzzle","tags":"Bejeweled, Pipe, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/9fwn1ewe5w6zp9ta2vsai9kxef3jkhbm\/512x384.jpg","width":"800","height":"600"},{"id":"23911","title":"Princess Birthday Bash Salon","description":"Little girl's birthday is coming up and she's celebrating with a huge gathering with all her friends! Get her ready for the big party by opening up your beauty salon! Choose from a huge range of makeups, hairstyles and dress up in the perfect costume! She'll have the best b'day ever with your help.","instructions":"- Use interactive controls to play - Get your girl ready - Do her makeup fix her hair and dress up ","url":"https:\/\/html5.gamemonetize.com\/f86x8c7z6ei49cqn8b0lz6hgys5yedx4\/","category":"Girls","tags":"Dress Up, Girl, Girls, Princess","thumb":"https:\/\/img.gamemonetize.com\/f86x8c7z6ei49cqn8b0lz6hgys5yedx4\/512x384.jpg","width":"800","height":"600"},{"id":"23481","title":"Learn Numbers 123 Kids Free Game - Count & Tracing","description":"Need numbers learning app for kids with easy to learn basic number and counting or baby counting games for kids with number writing practice? Try our number games for toddlers 1234 learning for kids! Here learn to write numbers for toddlers and counting for kids in a playful manner. Number learning app for kids is a free Preschool Games for kids to Learn Numbers, Tracing & Counting for Toddlers","instructions":"","url":"https:\/\/html5.gamemonetize.com\/j243f4af9btt7h1ll28t6bigoqkjrw21\/","category":"Clicker","tags":"Educational, Game, Games, HTML5","thumb":"https:\/\/img.gamemonetize.com\/j243f4af9btt7h1ll28t6bigoqkjrw21\/512x384.jpg","width":"800","height":"600"},{"id":"23392","title":"Drop Stack Ball - Fall Helix Blast Crash 3D","description":"The most addictive stack fall game with optimised performance for all devices! Helix Stack Ball is a super fun and addictive one touch casual game. Press and hold on the screen and let the ball go down without touching the obstacles! Hold as long as possible to make combo and break the black blocks. Let the ball fall down from the helix stacks. Stack Ball is a 3d arcade game where players smash, bump and bounce through revolving helix platforms to reach the end.","instructions":"How to Play - Just hold your finger to increase the rate of ball fall - Don t break or touch the black stacks - When Tappimg Action Continuously Happen The Stack Ball Change Into The Fire Ball ","url":"https:\/\/html5.gamemonetize.com\/68tpfi7cbhp53xg5mbq8wvk72xl5ly77\/","category":"Boys","tags":"Arcade, Game, Games, Hello Kitty, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/68tpfi7cbhp53xg5mbq8wvk72xl5ly77\/512x384.jpg","width":"800","height":"600"},{"id":"23429","title":"Bejeweled Classic","description":"\"Bejeweled may be the most incredibly addictive action-think game ever created.\" - Games Magazine Combine gems in this cult title and explore 6 stunning game modes: compete in a frantic race against the clock in Lightning mode, get the best hands to win in Poker mode, and more! Create special power gems like Fire Gems, Star Gems, Hyper Cubes or Supernova Gems. Collect beautiful Bejeweled badges and achievements, climb the Game Center leaderboards, and enjoy stunning graphics optimized for the Retina display! What are you waiting for? Dive into this legendary title and rediscover the fascinating world of Bejeweled!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/qwl0zt1wyh78bxjhhax2hn30sv69ssy0\/","category":"Bejeweled","tags":"Bejeweled, Classic, Clicker, Game, Games","thumb":"https:\/\/img.gamemonetize.com\/qwl0zt1wyh78bxjhhax2hn30sv69ssy0\/512x384.jpg","width":"800","height":"600"},{"id":"22896","title":"Collect the number: 8000!","description":"Collect the number: 8000 (8K) connecting numbers and numbers together, each step can be the last! It is very easy to lose, because the field is constantly filled with new numbers and figures. Become No.-1, compete with friends and players of this site. Go ahead!","instructions":"Mouse and finger control ","url":"https:\/\/html5.gamemonetize.com\/gisdkpeeu13aa07a542yv1nl9asdg4yb\/","category":"Puzzle","tags":"Casual, Hypercasual, Logic, Logical, Match-3, Match3","thumb":"https:\/\/img.gamemonetize.com\/gisdkpeeu13aa07a542yv1nl9asdg4yb\/512x384.jpg","width":"800","height":"600"},{"id":"22902","title":"Zumba Ocean","description":"Zumba Ocean with over 59 levels is an online Boy and Girl game. Zumba Ocean plays like all the Zuma series of arcade puzzle games with bottles and diamonds models. With the same match 3 play rules, you are required to destroy all jewels in the chain and get the marked scores at each level. Glad you will complete all targets and win three stars at all levels! You can also find more games at superkidgames.com, pick up one and have fun!","instructions":"Match 3 or more same-coloured gems to eliminate them Destroy all gems in the chain before it hits the end ","url":"https:\/\/html5.gamemonetize.com\/ixcce3ic7s20gybem1au09ject2k5rpa\/","category":"Bejeweled","tags":"Ball, Bejeweled, Boy, Bubble, Bubble Shooter, Clicker, Fun, Girl, HTML5, Jewel, Match 3, Zuma","thumb":"https:\/\/img.gamemonetize.com\/ixcce3ic7s20gybem1au09ject2k5rpa\/512x384.jpg","width":"800","height":"600"},{"id":"22384","title":"Pop It vs Spinner","description":"Try to remove all the popits in those 3 levels by matching at least 2 of the same tiles at once. Use the spinner mode when no matches are left to generate new ones and clean the whole level.","instructions":"Use the mouse or the finger to remove matching pairs ","url":"https:\/\/html5.gamemonetize.com\/1zo3s9fobccgwh9jmtbu2qi6jdi7scuu\/","category":"Puzzle","tags":"1 Player, 2D, Bejeweled, Best, Collecting, Color, Logic, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/1zo3s9fobccgwh9jmtbu2qi6jdi7scuu\/512x384.jpg","width":"990","height":"660"},{"id":"21947","title":"TikTok Baby Girl","description":"TikTok Baby Girl is an amazing Dress-up Girls Game. Choose Girl by Girl from the level menu and make them all beautiful. Features of this game : • Awesome dress up and make up simulation • Three pretty characters to dress up – Emma Nadia and Mia • Different missions to complete • Various fantastic outfits, looks and accessories • Beautiful graphics and design • Become the real Tiktok star Are you addicted to makeover games and dress up games?","instructions":"tap or click","url":"https:\/\/html5.gamemonetize.com\/6bfc4alvjj9nbefr8u0a89vnpkxr14cn\/","category":"Girls","tags":"Bejeweled, Click, Clicker, Dress Up, Fashion, Girl, Girls","thumb":"https:\/\/img.gamemonetize.com\/6bfc4alvjj9nbefr8u0a89vnpkxr14cn\/512x384.jpg","width":"800","height":"600"},{"id":"22051","title":"Alien Mahjong","description":"Try to remove all the tiles in those 3 levels by matching at least 2 of the same tiles at once. Use the bomb mode when no matches are left to generate new ones and clean the whole level.","instructions":" Use the mouse or the finger to remove matching pairs","url":"https:\/\/html5.gamemonetize.com\/9s2qzyqh6ut9bvteiz3xoi3im5vtlxu6\/","category":"Puzzle","tags":"1 Player, Alien, Animal, Arcade, Best, Block, Collecting, Mahjong, Puzzle, Rocket, Space","thumb":"https:\/\/img.gamemonetize.com\/9s2qzyqh6ut9bvteiz3xoi3im5vtlxu6\/512x384.jpg","width":"990","height":"660"},{"id":"21575","title":"Bubble Space","description":"The bubble shooter game that is very easy to play. Once you start playing you wont stop! The goal of the game is to beat all enemies, and help a captive spaceship. Special Items: [Heart] Your health is restored. [Helmet] Stamina is increased. [Gun] Attack force is increased. [Pair of Bubbles] The capacity of spare bubbles is increased.","instructions":"Use the mouse to aim your bubble shooter and click the left mouse button to shoot a bubble If you hit 2 or more bubbles of the same color as the one you shoot they will pop ","url":"https:\/\/html5.gamemonetize.com\/7fc2lv5qo1flwvtnzgscuyd2speep0mu\/","category":"Puzzle","tags":"Battle, Bejeweled, Bubble, Bubble Shooter, Casual, Color, Match 3, Match-3, Match3, Puzzle, Space, Spaceship","thumb":"https:\/\/img.gamemonetize.com\/7fc2lv5qo1flwvtnzgscuyd2speep0mu\/512x384.jpg","width":"640","height":"528"},{"id":"21620","title":"Jewels Connect","description":"A fun and addictive matching game to train your eyes and brain. You need to find all the pairs of jewels (by tapping them) within a certain amount of time. Features: - 3 difficulties (corresponding to the board sizes): Easy, Medium, Hard - Showing hints option - Shuffle option - Language support: English and Russian PLAY NOW!","instructions":"Tap on each pair of colorful jewels which can be connected by maximum 3 line segments without touching the other jewels ","url":"https:\/\/html5.gamemonetize.com\/viyhs5mmwjgw4h99vekd5zvcxnbzwwrp\/","category":"Puzzle","tags":"Arcade, Bejeweled, Best, Brain, Candy, Casual, Fun, Jewel, Match 3, Matching, Mobile, Puzzle, Relaxation","thumb":"https:\/\/img.gamemonetize.com\/viyhs5mmwjgw4h99vekd5zvcxnbzwwrp\/512x384.jpg","width":"800","height":"450"},{"id":"21368","title":"Princesses First Days Of College ","description":"Today the girls have a holiday - the first day of school. You need to impress others, because they are greeted by their clothes. You have to help the girls choose dazzling outfits, one for the first day of school and one for the party after. Upon completion, you will be able to compare all the girls' outfits and choose the most beautiful one.","instructions":"You need to impress others because they are greeted by their clothes You have to help the girls choose dazzling outfits ","url":"https:\/\/html5.gamemonetize.com\/62phn3nrzyvxmuesw09xfqnr2bptodl4\/","category":"Girls","tags":"Bejeweled, Celebrity, Cool, Cute, Decoration, Disney, Dora, Dress Up, Educational, Elsa, Family, Girl, Girls, Hair, House, HTML, HTML5, Jewel, Kiss, School, Summer","thumb":"https:\/\/img.gamemonetize.com\/62phn3nrzyvxmuesw09xfqnr2bptodl4\/512x384.jpg","width":"800","height":"600"},{"id":"19684","title":"Harvest Farm","description":"Harvest Farm is An amazing match3 connect puzzle game Just match similar jewels or fruits or unlock the next level","instructions":"swipe to connect","url":"https:\/\/html5.gamemonetize.com\/sapsvri2rdswm6c50iuudl94g62c7vcz\/","category":"Puzzle","tags":"HTML5, Mahjong, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/sapsvri2rdswm6c50iuudl94g62c7vcz\/512x384.jpg","width":"800","height":"600"},{"id":"18803","title":"Bubble Boat","description":"The bubble shooter game that is very easy to play. Once you start playing you wont stop! The goal of the game is to drop all enemies on the screen into the sea.","instructions":"Use the mouse to aim your bubble shooter and click the left mouse button to shoot a bubble If you hit 2 or more bubbles of the same color as the one you shoot they will pop ","url":"https:\/\/html5.gamemonetize.com\/woyre81lnexkwhztd7bmlwnb3cgawd6t\/","category":"Puzzle","tags":"Bejeweled, Boat, Bubble, Bubble Shooter, Casual, Color, Match 3, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/woyre81lnexkwhztd7bmlwnb3cgawd6t\/512x384.jpg","width":"640","height":"544"},{"id":"20541","title":"8K - 3 match game","description":"Connect numbers and numbers together, but do every step wisely, otherwise your efforts will sink into oblivion and become a real ruler over numbers!","instructions":"Click on the number and pull your finger to the side to connect the other numbers ","url":"https:\/\/html5.gamemonetize.com\/ylq1b86i4vmbuvpwmofs8ob82pw13lq1\/","category":"Puzzle","tags":"Bubble, Funny, Match 3, Match-3, Relaxation","thumb":"https:\/\/img.gamemonetize.com\/ylq1b86i4vmbuvpwmofs8ob82pw13lq1\/512x384.jpg","width":"720","height":"1280"},{"id":"19501","title":"Bikini Dress Up","description":"Kathy is drowning in the swimming pool. Can anyone help her? At this moment, lifeguard Alan jumped in to the pool and took her out of the water & saved Kathy from the danger. When Kathy woke up, she is totally attracted to this handsome lifeguard - Alan. But how to confess her love to Alan. Do you want to help her?","instructions":"Simple gameplay with efficient and easy to learn controls ","url":"https:\/\/html5.gamemonetize.com\/c2h6mofjq9hs4yl4grnrei3gruet0lpc\/","category":"Girls","tags":"Baby, Baby Hazel, Barbie, Boy, Celebrity, Decorate, Design, Dress Up, Fashion, Girl, Girls, Hair, Love, Makeover, Princess","thumb":"https:\/\/img.gamemonetize.com\/c2h6mofjq9hs4yl4grnrei3gruet0lpc\/512x384.jpg","width":"460","height":"600"},{"id":"19500","title":"Swimming Pool Dress Up","description":"Everyone loves to enjoy a summer vacation. Spend your summer at the beach with Sweet Baby Girl and her friends in a seaside resort. Hello! Get ready for some awesome adventure with this game. Spend happy family time in your summer holidays this time with our new adventure game.","instructions":"Simple gameplay with efficient and easy to learn controls ","url":"https:\/\/html5.gamemonetize.com\/gu2xu3s8otdtup2kklnlragt6zt72zai\/","category":"Girls","tags":"Baby, Baby Hazel, Celebrity, Decoration, Design, Dress Up, Fashion, Girl, Girls, Hair, Makeover, PacMan, Princess","thumb":"https:\/\/img.gamemonetize.com\/gu2xu3s8otdtup2kklnlragt6zt72zai\/512x384.jpg","width":"460","height":"600"},{"id":"19472","title":"Red Carpet Royal Dress Up","description":"Be the fashion designer for contestants of a world beauty contest! Choose from 12 models of different races, then rummage through a huge wardrobe of trendy, glamorous clothes, accessories and hairstyles to pick those that fit the most - to put together a fancy outfit for each supermodel. Everything is free! No in-app purchases or locks.","instructions":"Simple gameplay with efficient and easy to learn controls ","url":"https:\/\/html5.gamemonetize.com\/f5socbuajf98oh14y1lgmchfor1caonp\/","category":"Girls","tags":"Baby, Bejeweled, Celebrity, Decorate, Decoration, Design, Dress Up, Fashion, Girl, Girls, Hair, Makeover, Princess, Red","thumb":"https:\/\/img.gamemonetize.com\/f5socbuajf98oh14y1lgmchfor1caonp\/512x384.jpg","width":"460","height":"600"},{"id":"19622","title":"Minecraft Match Three","description":"Match three in the world of Minecraft Help steve to dig a mine","instructions":"Tap and swipe or mouse","url":"https:\/\/html5.gamemonetize.com\/r2vuaogsohwmgh339kks37l46onvg2f7\/","category":"Puzzle","tags":"1 Player, Bejeweled, Bounce, Casual, Logic, Match 3, Match-3, Match3, Matching, Minecraft, Pixel, Puzzle, Relaxation, Turn Based","thumb":"https:\/\/img.gamemonetize.com\/r2vuaogsohwmgh339kks37l46onvg2f7\/512x384.jpg","width":"800","height":"600"},{"id":"19380","title":"Cubes Blast Saga","description":"Play the new and exciting puzzle game and blast the cubes to rescue the little creatures. Match 2 or more cubes of the same color to clear levels and solve the challenging puzzles. If you like color puzzle games, this addicting match 2 board game is your perfect choice! Try to pass all levels. have fun","instructions":"tap to blast cubes","url":"https:\/\/html5.gamemonetize.com\/tnmizrtcq99ub29prt5fft79gfs8vo8o\/","category":"Puzzle","tags":"Bejeweled, Block, Candy, Casual, Hypercasual, Jewel, Match 3, Match-3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/tnmizrtcq99ub29prt5fft79gfs8vo8o\/512x384.jpg","width":"800","height":"600"},{"id":"18755","title":"Candy Fruit Crush","description":"Play Candy Fruit Crush Match3 Puzzle Game and enjoy tons of challenging levels & amazing Gifts. Just Swipe, Match Fruits of the same type to clair them to pass the mission. Try to Match 4 or 5 Fruits to get a booster bonus & match 2 bonuses to create the special fruit bag. Try to unpack all the Fun Gifts! Are you ready to Crush some delicious fruits?? Let's have fun","instructions":"Swipe Match Fruits of the same type to clair them","url":"https:\/\/html5.gamemonetize.com\/1uab3vbq425vqlg1ars8qgy8v24el77m\/","category":"Puzzle","tags":"Bejeweled, Brain, Bubble, Candy, Casual, Color, Fruit, Fruits, HTML5, Hypercasual, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/1uab3vbq425vqlg1ars8qgy8v24el77m\/512x384.jpg","width":"800","height":"600"},{"id":"18684","title":"Candy Shuffle Match-3","description":"Welcome to Candy Shuffle March3 Puzzle Game. Challenge yourself to Tons of DELICIOUS PUZZLES in a spellbinding magical MATCH 3 GAME! Swipe, Match 3 or more candies of the same type & Collect them to pass your mission. Use power-ups to help yourself with hard levels. Have Fun and share it with a match3 puzzle Lover","instructions":"swipe to match candies","url":"https:\/\/html5.gamemonetize.com\/b7j6efxqew47djofhkag395vb1ijn3ny\/","category":"Puzzle","tags":"Bejeweled, Brain, Bubble, Candy, Casual, HTML5, Hypercasual, Jewel, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/b7j6efxqew47djofhkag395vb1ijn3ny\/512x384.jpg","width":"800","height":"600"},{"id":"18896","title":"Spiderman Jigsaw Puzzle Planet","description":"Zazgames is a place where you can infinitely play assembling online jigsaw puzzles.let's see how fast can you solve this Spiderman Jigsaw Puzzle Planet","instructions":"Drag and drop ","url":"https:\/\/html5.gamemonetize.com\/iq85c53tj5dmzp4430gtymd8vkdgjl61\/","category":"Clicker","tags":"1 Player, 2 Player, Craft, Jigsaw, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/iq85c53tj5dmzp4430gtymd8vkdgjl61\/512x384.jpg","width":"800","height":"600"},{"id":"18109","title":"Pixel Bounce Ball","description":"The adventure of Pixel Bounce Ball red roller ball","instructions":"Simple gameplay with efficient and easy to learn controls ","url":"https:\/\/html5.gamemonetize.com\/2pdfv7bkgy2r1rjizrshzbwrwq7xk1vn\/","category":"Hypercasual","tags":"2D, 8 Ball Pool, Ball, Game, Online","thumb":"https:\/\/img.gamemonetize.com\/2pdfv7bkgy2r1rjizrshzbwrwq7xk1vn\/512x384.jpg","width":"124","height":"220"},{"id":"18878","title":"Biomutant Online Jigsaw Puzzle planet","description":"Zazgames is a place where you can infinitely play assembling online jigsaw puzzles.let's see how fast can you solve this Biomutant Online Jigsaw Puzzle planet.","instructions":"drag and drop ","url":"https:\/\/html5.gamemonetize.com\/hej9cggib9v6omrysfwr1oie3f8fehdv\/","category":"Puzzle","tags":"1 Player, Brain, Jigsaw, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/hej9cggib9v6omrysfwr1oie3f8fehdv\/512x384.jpg","width":"800","height":"600"},{"id":"18258","title":"Pets JigSaw","description":"Pets Jigsaw puzzle are a favorite pastime of many. Theres a large selection of free, beautiful, high-quality HD pictures out there, making it easy to play, relax and enjoy your favorite challenge for the mind.","instructions":"Slove JigSaw and complet all levels ","url":"https:\/\/html5.gamemonetize.com\/6scw0ojrqja29p157qvwqvquw24gdwfj\/","category":"Puzzle","tags":"Brain, Jigsaw, Mind, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/6scw0ojrqja29p157qvwqvquw24gdwfj\/512x384.jpg","width":"800","height":"600"},{"id":"17974","title":"Jewel royale","description":"Get ready to enter a magical jewel kingdom and become mezmerized in this unique action puzzle game.","instructions":"Tap To Play","url":"https:\/\/html5.gamemonetize.com\/fqo0mwmaqc9juymdrfps3u296wqgy59e\/","category":"Puzzle","tags":"Bejeweled, Games, HTML, HTML5, Puzzle, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/fqo0mwmaqc9juymdrfps3u296wqgy59e\/512x384.jpg","width":"800","height":"600"},{"id":"17997","title":"Happy Balls","description":"Happy Ball is a fun puzzle about Love balls, fresh and unique game that’s all about 2 love balls each other and you need to help the man ball to find his girlfriend It's time to use your brain and find a way to bump the balls!","instructions":"How to play Draw lines or shapes and try to bump the two balls dots together Restart the game anytime if you are stuck in love drawing ","url":"https:\/\/html5.gamemonetize.com\/fmimglq88labzhaaitebkhece65i9b6p\/","category":"Puzzle","tags":"Ball, HTML5, Mobile","thumb":"https:\/\/img.gamemonetize.com\/fmimglq88labzhaaitebkhece65i9b6p\/512x384.jpg","width":"800","height":"600"},{"id":"17462","title":"Ice Cream Candy","description":"The ocean is full of cute candies and other garden creatures! In this classic Match 3 casual game, 60 challenging levels with different goals are waiting for you! Match at least 3 candy of the same color to remove them from the field. Make combinations of 4 or more fish to create powerful tiles which explode areas on the board. Try to clear all levels with 3 stars and earn as many points as you can!","instructions":"Match at least 3 candy of the same color to remove them from the field ","url":"https:\/\/html5.gamemonetize.com\/anod4rlklq3v3c0qe4d61ywudis62a1d\/","category":"Puzzle","tags":"Bejeweled, Candy, Fruit, Fruits, Hypercasual, Jewel, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/anod4rlklq3v3c0qe4d61ywudis62a1d\/512x384.jpg","width":"800","height":"600"},{"id":"17895","title":"Math Merge","description":"Drag the numbers in the grid to merge them. There are the following categories of pieces: Roman numbers, polygons, fractions, Mayan numbers and cardinal numbers. You can solve mathematical challenges and get game pieces or coins.","instructions":"Touchscreen Mouse Drag and drop the pieces in the grid ","url":"https:\/\/html5.gamemonetize.com\/mxbb8kumaxp7cayy6n21cj6ok82n945w\/","category":"Puzzle","tags":"2D, Hypercasual, Math, Number, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/mxbb8kumaxp7cayy6n21cj6ok82n945w\/512x384.jpg","width":"1080","height":"1920"},{"id":"17797","title":"Professor Bubble Online","description":"Professor Bubble needs your help! In his excitement over his new bubble machine, he has flooded his own laboratory with bubbles. You’ve been equipped with a bubble shooter to help clear the mess, but there is something you need to know. These bubbles will only pop if they are clustered into groups of three or more. So lineup every shot perfectly, and pay attention to the colors!","instructions":"Use Mouse Or keyboard To Play","url":"https:\/\/html5.gamemonetize.com\/br4oehlmvw2iaptrqwktwdg9yztdspq4\/","category":"Bejeweled","tags":"Arcade, Bejeweled, Bubble, Bubble Shooter, Game, Match 3, Match-3, Match3, Matching, Online","thumb":"https:\/\/img.gamemonetize.com\/br4oehlmvw2iaptrqwktwdg9yztdspq4\/512x384.jpg","width":"720","height":"1280"},{"id":"18028","title":"CAR RUNNER","description":"Try to drive as far as possible before crashing in this fun online racing game. Keep racing as you try to get a high score in Street Racing: Car runner.","instructions":"Use mouse or finger to drive ","url":"https:\/\/html5.gamemonetize.com\/bb8cvvd4ww2636ks042uqy1u87jzimju\/","category":"Racing","tags":"Car, Cars, Race, Racing, running","thumb":"https:\/\/img.gamemonetize.com\/bb8cvvd4ww2636ks042uqy1u87jzimju\/512x384.jpg","width":"800","height":"600"},{"id":"13426","title":"Nezuko Tanjiro Candy Bubble Shooter Rescue","description":"Get ready to play I new free game Nezuko Tanjiro Candy Bubble Shooter Rescue and beat all levels and discover all puzzle solution with Tanjiro and Nezuko. Such a fun challenging game in all its turns. It is a free game puzzle where you challenge yourself to beat the score and stay sharp Play and finish every level with Tanjiro to rescue the trapped baby Nezuko! Can you score 3 stars on every level? it's hard to master! You will spend hours of fun watching different levels and puzzle Shoot and match candy bubbles of the same colours and burst them saving the amazing Nezuko. Match and Shoot bubbles same colours to pop and drop your candy to rescue the trapped baby Nezuko. Every level has varied difficulties. help Tanjiro to pick up the adorable Kamado Nezuko trapped on the island while playing candy bubble shooter rescue. WithTanjiro you will have to match 3 candy bubbles and popping all the candy bubbles with different colours To free trapped baby Nezuko. ★ Easy to play ★ Beautiful 2D graphic design and effects ★ There are more than 140 levels with different difficulty levels ★ Difficult to get 3 stars to score on every level! Can you score 3 stars on every level? Have fun and crush, blast and burst the puzzle pieces. Improve your skills with the free match 3 Nezuko Tanjiro Candy Bubble Shooter Rescue Nezuko. It is a free bubble shooter Get ready for the challenge and master the game","instructions":"","url":"https:\/\/html5.gamemonetize.com\/5uq82eiz4bi1u4u0dwl15ljtsg1nkfgp\/","category":"Puzzle","tags":"1 Player, 2D, Bubble, Bubble Shooter, Match 3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/5uq82eiz4bi1u4u0dwl15ljtsg1nkfgp\/512x384.jpg","width":"600","height":"950"},{"id":"17729","title":"Hot Dog Maker Fast-food - jeu de cuisine","description":"Kids get ready to enjoy the madness of real food in the most amazing street food games. Enter the fast food restaurant kitchen filled with hot sausages for a delicious hot dog. Start your own interesting street food store and get a set of fun cooking games.","instructions":"Exciting levels of spicy hot dog makers give you an extra dose of sausage fun Level mode and control mode of street cooking games are ready to surprise you One by one complete levels of chef cooking games and learn hot dog maker skills Then enjoy all t","url":"https:\/\/html5.gamemonetize.com\/wac81fzayb89sgudciz1k98o2b4hsgep\/","category":"Cooking","tags":"Food, Hot, HTML5","thumb":"https:\/\/img.gamemonetize.com\/wac81fzayb89sgudciz1k98o2b4hsgep\/512x384.jpg","width":"800","height":"600"},{"id":"17726","title":"Lollipops Candy Blast Mania - Match 3 Puzzle Game","description":"Candy Blast Mania is a brand new puzzle game which is designed for players who just want to play and have fun, without being distracted by others. Match 3 or more candies of the same color and complete missions at each level of this adventure. Challenging but fun at every turn! If you like sweets and puzzles and have a soft spot of pigs, this cute, fun, loving matching puzzle game is for you! Tap, pop, and eat your way through the adventure with your new best friend Lucky.","instructions":"touch candy and match 3 or more candy","url":"https:\/\/html5.gamemonetize.com\/ezhci1zet2wv9hdh5u94lbnqzfvd9jan\/","category":"Puzzle","tags":"Adult, Boy, Candy, Casual, Click, Color, Girl, HTML5, Hypercasual, Kid, Logic, Match 3, Match-3, Match3, Matching, Puzzle, WebGL","thumb":"https:\/\/img.gamemonetize.com\/ezhci1zet2wv9hdh5u94lbnqzfvd9jan\/512x384.jpg","width":"800","height":"600"},{"id":"17531","title":"Jewels Legend","description":"Jewels Legend (from LinkDesks Inc.) is an exciting and addictive match-3 adventure game filled with crisp, colorful jewelry effects! This jewel game has well-designed puzzles for you to play anytime, anywhere! Become the Jewel Star and unlock all the castles in this Jewel Saga game.","instructions":"Match 3 or more identical jewels in a single move to make a match and watch as it magically disappear Drag click or tap a jewel to move it vertically or horizontally in the direction to complete a match To earn the most points fill up the color meter","url":"https:\/\/html5.gamemonetize.com\/yxs38xpu1xx3x50smruyi1amuo67afw9\/","category":"Hypercasual","tags":"Casual, Hypercasual, Jewel, Match 3, Matching","thumb":"https:\/\/img.gamemonetize.com\/yxs38xpu1xx3x50smruyi1amuo67afw9\/512x384.jpg","width":"800","height":"600"},{"id":"18018","title":"Amazing Dominoes","description":"Play 5 classic game modes (Muggins, Draw, Block, Sewastpol and Bergen) Beautiful and relaxing gameplay with six themes and stones. Customize your game exacly how you want. ⭐Download Amazing Dominoes for free today and enjoy a hours of playing.⭐ ★ 5 classic dominoes modes in one game ★100% free ★2, 3 or 4 players mode. ★Fun and entertaining gameplay ★Six beautiful themes and stone graphics ★Online ranking system ★In-game statistics ★ Contact us ★ Email : support@amazinghedgehog.com Facebook : https:\/\/www.facebook.com\/AmazingHedgehogStudio","instructions":" The game begins by drawing single domino stone The player with the highest number of pips on it makes the first move If there are two players in the game each player starts with seven stones If there are more competitors everyone starts the game w","url":"https:\/\/html5.gamemonetize.com\/o79s9z62pqfcfgohypuf6uimzdrdcx01\/","category":"Puzzle","tags":"1 Player, 2D, Brain, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/o79s9z62pqfcfgohypuf6uimzdrdcx01\/512x384.jpg","width":"960","height":"540"},{"id":"17524","title":"Bubble Shooter Burst","description":"Bubble Shoot Burst are based on the classic Match 3 formula, so your goal is to match at least three candy bubbles of the same color to burst them and remove them from the field. Can you earn all three stars? It’s a real Puzzle Bubble experience. Bubble Pop at its best.","instructions":"Use touch device or mouse to play this game ","url":"https:\/\/html5.gamemonetize.com\/ux1xzc2iz2exazkz61gv9rmvhb6fgq5b\/","category":"Shooting","tags":"Bubble, Bubble Shooter, H5, HTML, HTML5, Match 3, Match-3, Match3, Mobile, Punch, Puzzle, Shoot, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/ux1xzc2iz2exazkz61gv9rmvhb6fgq5b\/512x384.jpg","width":"800","height":"600"},{"id":"17294","title":"shopping games for girls","description":"my Boutique Fashion Shop Game: Shopping Fever TOP QUALITY GAME FOR FASHION LEADERS! MANAGE AND DECORATE YOUR OWN FASHION STORE! SERVE CUSTOMERS AND BECOME A PRO IN THIS FANTASTIC BOUTIQUE SIMULATION GAME!","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/95ptba6hx3yi6zios6vurfkzw5gfa4mk\/","category":"Girls","tags":"3D, 3D Games, Arcade, Best, Casual, Games, Girls, Hot, HTML5, Hypercasual, Kids, Mobile, Online, Shopping, Simulation, Simulator","thumb":"https:\/\/img.gamemonetize.com\/95ptba6hx3yi6zios6vurfkzw5gfa4mk\/512x384.jpg","width":"600","height":"960"},{"id":"16500","title":"Fashion Stylist - Dress Up online Games for Girls","description":"A FASHION GAME FOR YOU","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/mx1rxrjvd7lm7qy95b5tr6re10uwbg3x\/","category":"Girls","tags":"3D, Arcade, Cartoon, Casual, Dress Up, Fashion, Frozen, Fun, Games, Girl, Girls, Hypercasual, Kids, Makeover, Online, Princess","thumb":"https:\/\/img.gamemonetize.com\/mx1rxrjvd7lm7qy95b5tr6re10uwbg3x\/512x384.jpg","width":"600","height":"960"},{"id":"17594","title":"Fruit Mania Match3","description":"Let's Crush Some Fruits in Fruit Mania Match3 puzzle Game. Try to unlock all levels & pass all missions. Swipe, Match & Crush Delicious Fruits to pass the level. Have fun","instructions":"slide your finger to match fruits","url":"https:\/\/html5.gamemonetize.com\/9chfcrwau1gicrc6ax260qis9j2kd2km\/","category":"Puzzle","tags":"Bubble, Candy, Casual, Fruit, Fruits, HTML5, Hypercasual, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/9chfcrwau1gicrc6ax260qis9j2kd2km\/512x384.jpg","width":"800","height":"600"},{"id":"17523","title":"Bubble World","description":"Bubble World returns with a modern taste including a new adventure mode. Try to make a complete tour of the island (beach, forest, factory, warehouse, …) by completing each of the 40 levels of the game. Bubble World alternates continuously between 2 game modes (Straight-up and Ball mode) and adds new facial mimics, for our biggest pleasure.","instructions":"Use touch device or mouse to play this game ","url":"https:\/\/html5.gamemonetize.com\/bcd1drtrcm7ex3yqie1zfuchoi329j2l\/","category":"Shooting","tags":"Bubble, Bubble Shooter, H5, HTML, HTML5, Match 3, Match-3, Match3, Matching, Mobile, Punch, Puzzle, Shoot, Shooter","thumb":"https:\/\/img.gamemonetize.com\/bcd1drtrcm7ex3yqie1zfuchoi329j2l\/512x384.jpg","width":"800","height":"600"},{"id":"17348","title":"Fruit Party","description":"Welcome to Fruit Party, The best match3 puzzle game. Swipe & crush fruits with the same color, match and collect juicy fruits . Open the game and discover more challenging missions. Have fun","instructions":"swipe to crush fruits","url":"https:\/\/html5.gamemonetize.com\/q44gwsdhfya9ojcdckc912bame38dkf4\/","category":"Puzzle","tags":"Bejeweled, Bubble, Candy, Casual, Fruit, Fruits, HTML5, Hypercasual, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/q44gwsdhfya9ojcdckc912bame38dkf4\/512x384.jpg","width":"800","height":"600"},{"id":"17021","title":"Fever Tap","description":"Shoot bubbles and match colors to pop and drop your way to help the robot find the UFO and back to home! You’ll be addicted to \"Bubble Star\" from the first hit!","instructions":"Drop large bunches of bubbles to score sweet bonuses ","url":"https:\/\/html5.gamemonetize.com\/w764rw9k7g46dprfhhenezri0tgiiokf\/","category":"Puzzle","tags":"Bejeweled, Match 3, Match-3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/w764rw9k7g46dprfhhenezri0tgiiokf\/512x384.jpg","width":"631","height":"947"},{"id":"15082","title":"HotJewels","description":"Jewels Planet is completely FREE and you don't need the Internet! Challenge yourself by playing over 700 levels and discover a new mode with each new world! Play this jewelry game anywhere and anytime with no limits. Become a jewelry legend player in this jewelry saga game! So what are you waiting for? Swap gems and start the jewelry quest NOW!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/mkl1j20j0nspvoeh437n21uibscpkbz7\/","category":"Puzzle","tags":"2D, Baby, Bubble, Bubble Shooter, Puzzle, Shooting","thumb":"https:\/\/img.gamemonetize.com\/mkl1j20j0nspvoeh437n21uibscpkbz7\/512x384.jpg","width":"800","height":"600"},{"id":"17026","title":"Bubble star","description":"Shoot bubbles and match colors to pop and drop your way to help the robot find the UFO and back to home! You’ll be addicted to \"Bubble Star\" from the first hit!","instructions":"Tap to play ","url":"https:\/\/html5.gamemonetize.com\/jn1wjy2inzgycp2c0s7flyo3e18j0ysk\/","category":"Shooting","tags":".io, 1 Player, Adventure, Bubble, Bubble Shooter, Hypercasual, Match 3, Match-3, Match3, Play, Puzzle, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/jn1wjy2inzgycp2c0s7flyo3e18j0ysk\/512x384.jpg","width":"800","height":"600"},{"id":"17271","title":"Jelly Fruits","description":"This game is a very addictive and best match-three fruits casual game! Connect three or more same fruits splash to score points & Archive the target points to level up. Eliminate the more fruits line quickly can get extra scores. Play Jelly Fruits and Have Fun!!!","instructions":"slide your finger to connect fruits","url":"https:\/\/html5.gamemonetize.com\/qito6tlr8w74iw2t5q43x5dumpfrvrzl\/","category":"Puzzle","tags":"Arcade, Candy, Casual, Fruits, HTML5, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/qito6tlr8w74iw2t5q43x5dumpfrvrzl\/512x384.jpg","width":"800","height":"600"},{"id":"15089","title":"CandyMatch","description":"Candy - Match Three Game is the best classic match 3 candy puzzle game,with HD graphic and hard challenge! Candy - Match Three Game is an addictive,excited and amazing Candy fever classic match 3 with many colorful candy. Let' try unlock all our levels and become winner.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/ho00jhhbjw3igx3i95hjqalfytyp5mxn\/","category":"Puzzle","tags":"HTML5, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ho00jhhbjw3igx3i95hjqalfytyp5mxn\/512x384.jpg","width":"800","height":"600"},{"id":"16464","title":"Fruit Swipe Match It","description":"Swipe your finger over more matching fruits to clear them.Minimum two similar fruits require to swiped.Fruit Swipe is for game lovers although it is not like fruit slice.It's simple and easy to play .If you swipe more same fruit chain ,you get more score.You are not suppose to swipe two color fruits.","instructions":"Tap to play ","url":"https:\/\/html5.gamemonetize.com\/s8kky35iaqamnj06u2lbth0ay2kj0nds\/","category":"Puzzle","tags":"Bubble Shooter, HTML, HTML5, Match 3, Match-3, Matching","thumb":"https:\/\/img.gamemonetize.com\/s8kky35iaqamnj06u2lbth0ay2kj0nds\/512x384.jpg","width":"800","height":"600"},{"id":"16875","title":"Candy Bonbon","description":"Candy Bonbon is puzzle match3 game. Tap to Crush 3 or more similar Candies and complete your mission. Collect boosters and use them to complete your level. Explore tons of amazing challenging levels. Have fun","instructions":"tap to crush candies","url":"https:\/\/html5.gamemonetize.com\/72zd2l22gt8du68vh8oj5xfoug5e6jee\/","category":"Bejeweled","tags":"Bejeweled, Candy, Casual, Hypercasual, Jewel, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/72zd2l22gt8du68vh8oj5xfoug5e6jee\/512x384.jpg","width":"800","height":"600"},{"id":"16873","title":"Tasty Jewels","description":"Tasty Jewel is a fun match3 puzzle Game. Swipe to match similar jewel candies to pop them and complete the level. is you get stuck, you can use boosters for help Explore tons of challenging levels and enjoy match jewels and candies. Have fun","instructions":"swipe to match jewels","url":"https:\/\/html5.gamemonetize.com\/y8h7gnt1m41esvjeyjrz0n7tt0ud96j8\/","category":"Hypercasual","tags":"Arcade, Bejeweled, Bubble, Candy, Jewel, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/y8h7gnt1m41esvjeyjrz0n7tt0ud96j8\/512x384.jpg","width":"800","height":"600"},{"id":"16447","title":"Fairy Tale Princess Makeover","description":"Have you ever dreamed to have your own Fairy Princess? Do you want to design style for a beautiful Fairy Princess? Join this salon especially for Fairy Princess! your mission is to help Fairy Princess to do the Fairy makeup Give your Fairy Princess a Fairy spa and dress her with amazing clothes! Play this game and see how many new features and activities we added to this product for you free, In this Fairy Princess Makeup Game Free you can experience the Fairy treatment. So, play and enjoy as a spa manager in this Fairy makeup salon spa game and share with your friends.Have your dream to be a Fairy Princess..? complete it with the latest Fairy Princess makeup and the most adorable dress up. Play a beautiful Fairy in this wonderfully magnificent design game.","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/a1ppiahyo0lvei1kmc95lycpsr8hykm9\/","category":"Girls","tags":".io Games, 3D, Arcade, Cartoon, Casual, Dress Up, Fashion, Frozen, Fun, Girls, Hypercasual, Kids, Makeover, Online, Princess","thumb":"https:\/\/img.gamemonetize.com\/a1ppiahyo0lvei1kmc95lycpsr8hykm9\/512x384.jpg","width":"600","height":"960"},{"id":"16692","title":"Jewel Block Puzzle - Free Addictive Games","description":"Jewel Block Puzzle - Free Addictive Games is a simple but very addictive puzzle game in which you will operate with colorful crystal blocks. Figures from them will appear at the bottom of the screen, and you should take them and transfer them to the playing field, setting them in cells. In this case, you must make solid lines of shapes that intersect the field vertically or horizontally. The pieces appear in threes and you have to put everything out, only then a new batch will appear. The removed rows will turn into points, they are counted at the top of the screen in the game Jewel Block Puzzle-Free Addictive Games. Become a real master of laying colored blocks! A game for fans of logic games. A puzzle that stands out from a large number of games of this genre with a beautiful design and bright colors. In addition, this game is very similar to the world-famous game Tetris, released on almost all operating systems. Of course, fans of Tetris will be able to detect the differences with the naked eye, but this does not mean that it will be boring and monotonous. The main difference between Puzzle Blocks and Tetris is that there are already blocks on the field that need to be destroyed and they are not on the lowest line, but can be located in the center of the field with cells or any other part of the field. Features? - 100% free game play. - Offline mode, no wifi required! - Easy to play, suitable for all ages!","instructions":"How to play - Drag the blocks of gems onto the field - Remove blocks by creating full lines vertically or horizontally - The blocks can t rotate which makes the game more difficult - No time limits or color combinations Just fill the space w","url":"https:\/\/html5.gamemonetize.com\/eag7l1be6ypfudnva02h4io0nj6853oj\/","category":"Puzzle","tags":"Bejeweled, Block, Jewel, Logic, Logical, Puzzle, Tetris","thumb":"https:\/\/img.gamemonetize.com\/eag7l1be6ypfudnva02h4io0nj6853oj\/512x384.jpg","width":"1080","height":"1920"},{"id":"15096","title":"Fashion Celebrity & Dress Up Game","description":"Tina got an invitation to the celebrity party, which is a chance to make a stunning appearance and get her name on the top It Girls list!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/s51ensd4ef5stzqwl01jjxvll12vxuxp\/","category":"Girls","tags":"Dress Up, Fashion, Girls, HTML5","thumb":"https:\/\/img.gamemonetize.com\/s51ensd4ef5stzqwl01jjxvll12vxuxp\/512x384.jpg","width":"800","height":"600"},{"id":"15930","title":"Fruit Crush Kingdom","description":"Fruit Crush Kingdom is an addictive Match3 puzzle game. This is The place where you can enjoy tons of challenging levels. Swap, Match then Crush those fruits to pass the mission. Have fun!","instructions":"Swipe fruits with finger or mouse","url":"https:\/\/html5.gamemonetize.com\/elvouzxgx70exx3z505h1vx9b5esrmp6\/","category":"Puzzle","tags":"Arcade, Bejeweled, Brain, Cake, Candy, Casual, Fruit, Fruits, HTML5, Hypercasual, Jewel, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/elvouzxgx70exx3z505h1vx9b5esrmp6\/512x384.jpg","width":"800","height":"600"},{"id":"15141","title":"Nails.Master.Effect","description":"Polish, decorate, clip, buff your nails and much more in this amazing glow-in-the-dark mani dress up game! This isn’t your little sister’s fairy princess french manicure dress up game! Filled with amazingly cool glow in the dark nail art, you can create awesome glowing nails like a real nail stylist in a spa.","instructions":"Polish decorate clip buff your nails and much more in this amazing glow-in-the-dark mani dress up game This isn t your little sister s fairy princess french manicure dress up game Filled with amazingly cool glow in the dark nail art you can create a","url":"https:\/\/html5.gamemonetize.com\/q3uwm81ombzvv8as3j8ubp0o6a5p4mfv\/","category":"Puzzle","tags":"Action, Baby, Baby Hazel, Barbie","thumb":"https:\/\/img.gamemonetize.com\/q3uwm81ombzvv8as3j8ubp0o6a5p4mfv\/512x384.jpg","width":"800","height":"600"},{"id":"15810","title":"Fairytail.Princess","description":"The queen gave birth to a princess that had hair with special healing powers. We call her the long hair princess. The evil witch stole the princess because her hair could keep her from ageing and kept the princess imprisoned in a secret garden for many years. One day, an unknown man accidently stumbled into this garden with severe injuries.","instructions":"The queen gave birth to a princess that had hair with special healing powers We call her the long hair princess The evil witch stole the princess because her hair could keep her from ageing and kept the princess imprisoned in a secret garden for many ye","url":"https:\/\/html5.gamemonetize.com\/3d6o6np4k8z0asyanq6knya246r4jugn\/","category":"Girls","tags":"Girl, Girls, Princess, Witch","thumb":"https:\/\/img.gamemonetize.com\/3d6o6np4k8z0asyanq6knya246r4jugn\/512x384.jpg","width":"800","height":"600"},{"id":"15152","title":"Sand.Draw","description":"Draw On Sand in that you can write a note or message to someone on your screens as well as suitable for all because they could develop their sketch skill using sand art on sand. Draw on Sand or Sketch Drawing is a best photography app to make it simple to used and draw a sketch on like a sand on beach","instructions":"Draw On Sand in that you can write a note or message to someone on your screens as well as suitable for all because they could develop their sketch skill using sand art on sand Draw on Sand or Sketch Drawing is a best photography app to make it simpl","url":"https:\/\/html5.gamemonetize.com\/u39grqhd0u2u599vesihb9lhiqhm0z8u\/","category":"Bejeweled","tags":"Action, Adventure, Baby","thumb":"https:\/\/img.gamemonetize.com\/u39grqhd0u2u599vesihb9lhiqhm0z8u\/512x384.jpg","width":"800","height":"600"},{"id":"15142","title":"Papa Cherry Saga","description":"Do you want to play a sweet little game? Then Papa Cherry Saga is the right one for a real sweet tooth. The main character - chef Papa Cherry will always help you to win a level. Taste the sweetness of the new fascinating match-3 game! Switch and match cookies in this tasty puzzle adventure to progress to the next level for that sweet winning feeling. Solve puzzles with quick thinking and smart moves, and be rewarded with delicious cascades and tasty combos! Plan your moves by matching 3 or more cookies in a row. Match four or more cookies to create power-ups. Use boosters if you are stuck. Can’t win the level? Use five extra moves at the end of the game! Blast through the chocolate blocks and marshmallows to collect cookies across dozens of levels, guaranteed to have you craving more!","instructions":"Use mouse to swap cookies and match three in a row ","url":"https:\/\/html5.gamemonetize.com\/1tj7nxrptpkidz6b491m83qh7n78iv7k\/","category":"Puzzle","tags":"Bejeweled, Candy, Match 3, Match-3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/1tj7nxrptpkidz6b491m83qh7n78iv7k\/512x384.jpg","width":"800","height":"600"},{"id":"15677","title":"Blocks Puzzle 2","description":"Blocks puzzle is an addictive classic game The goal is to drop blocks in order to create and destroy full lines on the screen both vertically and horizontally. Don't forget to keep the blocks from filling the screen in this addictive puzzle game. Every level has a new challenge. Can you pass all levels?","instructions":"Drag and drop blocks","url":"https:\/\/html5.gamemonetize.com\/g69v8vg0fthf3p8t7ntt57ljqu53wlyc\/","category":"Puzzle","tags":"Arcade, Block, Bricks, Casual, HTML5, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/g69v8vg0fthf3p8t7ntt57ljqu53wlyc\/512x384.jpg","width":"800","height":"600"},{"id":"14838","title":"Tie Dyeing 3D","description":"Here we go WIth Best Family Satisfaction Game , Make Your Colors Shirts pants With Make Tie Dying Perfectly With Different colors Have Fun T- Shirts Pants Many More . The BEST Way To Tie and Dye That You HAVEN’T Tried like Master 3D No need to mix up your dyes for the ultra-cool ice tie-dye technique! Let the ice do the work to produce one-of-a-kind watercolor tie-dye effects. Tie-Dye Techniques in Your Summer FIND IT FAST Ultra Bright Tie and Dye! Stuff to Tie Dying Method Extra Large Tie-Dye Kits 8-Color Tie-Dye Kits 5-Color Tie-Dye Kits 3-Color Tie-Dye Kits Two-Minute Tie - Dye Theme Kits Activity Kits 1-Color Tie-Dye Kits Tie-Dye Refill Packs How to Play Tie Dyeing! Master 3D Game : Just Dip Cloths In Colors make it Perfect Just Me. Tie Dyeing Everything.","instructions":"Here we go WIth Best Family Satisfaction Game Make Your Colors Shirts pants With Make Tie Dying Perfectly With Different colors Have Fun T- Shirts Pants Many More The BEST Way To Tie and Dye That You HAVEN T Tried like Master 3D No need to mix ","url":"https:\/\/html5.gamemonetize.com\/40n9v467fiewtl8mgi9hhigovtke4vw8\/","category":"Bejeweled","tags":"Brain, Collecting, Collection, Color, Coloring, Design, Dress Up, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/40n9v467fiewtl8mgi9hhigovtke4vw8\/512x384.jpg","width":"960","height":"600"},{"id":"13907","title":"Shopping Mall For Rich Girls Supermarket Cashier","description":"Crazy shopping lovers! A new store has opened in the city and they are offering the most exclusive trendy designer clothes, cosmetic kits, shoes, fashion jewelry and bags. Go out with your rich bff (best friend forever) at shopping time to buy the most expensive and popular brand clothes, shoes, makeover accessories and jewelry fashionista products. Live a wonderfully quiet life and enjoy your time with multi-daughter friends. Shop till you are tired! Go from shop to shop in this supermarket game simulator to see full style superstores, dress up in designer boutiques with personal stylish friends. Get a princess makeover, dress up in the best clothes and look like a celeb in the city's biggest shopping mall. Dress and change like a ramp model and walk the cat the way you are in a fashion competition. Show your VIP status and live a good life with unlimited money shopping. Shopping malls for rich girls have a huge crowd at the store to buy all the goods on Black Friday at a 50% sale discount. Take advantage of 50% of Black Friday offer and shop in this shopping game for girls. Shopping Mall is a supermarket shopping and cashier simulator game for rich girls. Little boys and girls join the best cash registers, supermarket managers and shopping games to experience the virtual reality of real-life mall shopping. Play a role as a supermarket manager and as a pro treasurer to experience the fun frenzy with crazy store customers. Sell ​​elegantly designed and fashionable clothing in 50 game levels of entertainment and adventure games for girls. For girls you can buy a variety of dresses from boutique stores including pants, shirts, tops, skirts and wedding dresses. Shoes include sandals and heels. Purchase stylish jewelry in gold and diamonds. Many designed necklaces, rings and bracelets are also available. Buy classy designs and glass, hats, and classy design hats on sale on Black Friday. The shopping mall game also has a cosmetic kit factory store where you can buy all makeup kit products from popular factories. Makeover accessories include nail polish, lipstick, face spa mask and eye shades. Finally, pretend to be the cashier at the cash register counter and manage the money. Scan shopping items, put them in shopping bags and collect cash money. Manage money in a cashier machine. This Cahier game is as much fun as any grocery, cafe and fast food shop game. Now download this shopping mall for rich girls games and enjoy the mania. Features - 50 levels of shopping, cash registers and time management fun. - The shoe store includes all types of shoes such as high heels and sandals. - Clothes shopping from a wide range of prom party wear, jeans, wedding dresses and designer shirts. - jewelry accessories Includes trendy style necklaces, rings and bracelets. - Cosmetic stores have a wide range of cosmetic makeover accessories such as nail polish and lipstick. - Learn bill payments, cash management and time management at the cash counter. - High quality amazing graphics and exciting game play.","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/eimvyfp8j2f92g5wo78eau998o6ufd6u\/","category":"Bejeweled","tags":"3D Games, Arena, Baby, Baby Hazel, Best, Boys, Fun, Games, Girls, Hot, Kids, New, Shopping","thumb":"https:\/\/img.gamemonetize.com\/eimvyfp8j2f92g5wo78eau998o6ufd6u\/512x384.jpg","width":"960","height":"600"},{"id":"13904","title":"Supermarket: Shopping Games for Kids","description":"Kids supermarket is funny games for kids with educational elements. Mommy makes a list of the goods that you need to buy in the supermarket. Daddy, Hippo and her brother have taken a trolley and gone to the supermarket to find all products that Mommy has added to the shopping list. At the top of the screen there a list of goods you must find. Help Hippo to find all the products which are in the list. Look attentive at the shop shelves and when you see a product from the list, just put it to the trolley. Do not forget to look for the Daddy and little brother, they always try to throw in the basket something extra.","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/52apelyub6si97fd27j9d1uqkot0cz8i\/","category":"Bejeweled","tags":".io Games, Fashion, Fish, Girl, Girls, Kids, Shopping","thumb":"https:\/\/img.gamemonetize.com\/52apelyub6si97fd27j9d1uqkot0cz8i\/512x384.jpg","width":"960","height":"600"},{"id":"13699","title":"Fairy Tale Princess Wich","description":"You can’t miss this dramatic princes and unicorn game! How can an evil witch dress up and become a noble queen and win the king’s heart? What’s her dark secrets in this free games for girls? Let’s reveal noble queen’s secrets in our free unicorn games! Unicorn Princess 1- Queen Secrets for Girls is one of the newest dress up and makeup games for girls. Take your princesses to the royal princess salon for perfect makeover and dressing! Now enter princess world full of stunning makeup products and super girly dresses in our free unicorn games.","instructions":"You can t miss this dramatic princes and unicorn game How can an evil witch dress up and become a noble queen and win the king s heart What s her dark secrets in this free games for girls Let s reveal noble queen s secrets in our free unicorn games Un","url":"https:\/\/html5.gamemonetize.com\/ublcdd41h4phfr4xuiz81rk6mzbrt3ho\/","category":"Girls","tags":"Girls, Kids, Magic, Princess, Witch, Wizard","thumb":"https:\/\/img.gamemonetize.com\/ublcdd41h4phfr4xuiz81rk6mzbrt3ho\/512x384.jpg","width":"600","height":"960"},{"id":"13845","title":"Candy Pop","description":"Welcome to the most addictive match three game all you have to do is to match candies with the same color to win the level. Challenge youself and unlock all levels Enjoy Candy Pop game!","instructions":"match candies with the same color ","url":"https:\/\/html5.gamemonetize.com\/7fljr749dy34byoc9e4uqi6pp8gn68td\/","category":"Puzzle","tags":"HTML5, Hypercasual, Match 3, Match-3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/7fljr749dy34byoc9e4uqi6pp8gn68td\/512x384.jpg","width":"800","height":"600"},{"id":"14487","title":"Fruit Swipe Mania","description":"Welcome to the magical Fruit Swipe Mania, an addictive match3 game. Swap and match 3 identical Fruits to crush them. Make special candy rocket by matching 4 similar fruits in a row and you get the magical cake when you match 5 fruits in a row. Try to unlock every level to discover some new challenges. Have fun","instructions":"Swipe Match crush fruits","url":"https:\/\/html5.gamemonetize.com\/pskuyfvphso3ntkghm47r73x24krof1d\/","category":"Puzzle","tags":"Arcade, Bejeweled, Hypercasual, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/pskuyfvphso3ntkghm47r73x24krof1d\/512x384.jpg","width":"800","height":"600"},{"id":"13343","title":"Doctor Games","description":"Doctor Games For Girls - Hospital ER is educational game you can be a doctor and treat Girls in a children's hospital. You can make them healthy again and put a smile back on their faces. with this Girls games you make little Girls expert hospital emergency doctor. ER Surgeon lets start with basic health checkup, monitor blood pressure, respiratory system, health and fitness in hospital Girls doctor games. Hospital doctor games is full of crucial patients suffering from different injuries, heart diseases that require crazy surgeon to be available. Children are coming to the clinic, injured or suffering from various diseases, and they need your help to get better. Turn your Girls into a professional star doctor, operate your own clinic and hospital, cure different kinds of patients with various diseases along with your assistant nurse! Unlock them and progress for more treatments like, killing bacterias, tummy cure, bones treatment, dentist treatment and much more. Cure your way through the quirkiest and funniest diseases in Doctor Games For Girls - Hospital ER","instructions":"move with mouse","url":"https:\/\/html5.gamemonetize.com\/95473f728gpbk8wmnar150fusg66sha2\/","category":"Clicker","tags":"Boys, Doctor, Girls","thumb":"https:\/\/img.gamemonetize.com\/95473f728gpbk8wmnar150fusg66sha2\/512x384.jpg","width":"800","height":"600"},{"id":"12959","title":"Super Block ","description":"You need to match 3 or more object by exchanging two pieces or by clicking on a group of 3 or more. Playing blocks super match 3 game free online no advertising in game and support all smartphones or tablets, such as iPhone, iPad, Samsung and other Apple and android system.","instructions":"Use mouse or touch pad to play this game","url":"https:\/\/html5.gamemonetize.com\/vqnrol5vh1jmrh436j3r63owr0ke365z\/","category":"Puzzle","tags":"Block, Candy, Color, Coloring, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/vqnrol5vh1jmrh436j3r63owr0ke365z\/512x384.jpg","width":"800","height":"600"},{"id":"12845","title":"Wonderland Match 3","description":"Candy Wonderland - the match 3 games free is a fun casual puzzle games with lots of crazy yummy candy and lots of blast fun.","instructions":"just click and move the same candy to match ","url":"https:\/\/html5.gamemonetize.com\/1sajkczp26cqughrxpzh0xdj1ckh1932\/","category":"Hypercasual","tags":"2D, Candy, Casual, Funny, Hypercasual","thumb":"https:\/\/img.gamemonetize.com\/1sajkczp26cqughrxpzh0xdj1ckh1932\/512x384.jpg","width":"800","height":"600"},{"id":"12773","title":"Lollipops match","description":"Lolipop MAtch is a connect match game on html5, connecting the candy to match the same candy color","instructions":"touch candy and match 3 or more candy ","url":"https:\/\/html5.gamemonetize.com\/04xezk1lffyjnqddte58e1naknhquerv\/","category":"Hypercasual","tags":"2D, Candy, Casual, Click, Color, HTML5, Hypercasual","thumb":"https:\/\/img.gamemonetize.com\/04xezk1lffyjnqddte58e1naknhquerv\/512x384.jpg","width":"800","height":"600"},{"id":"12734","title":"Fashion competiton : Dress Up Models Game","description":"Fashion competiton : Dress Up Models Game begins! Are you a fashion stylist and stylist lover or are you always looking to personnelise your own fasion model sweet girl? It's time to find out! Go to Fashion competiton : Dress Up Models Game to make up, comb and dress the girls and test everything you know about trendy clothes. Choose from three beautiful fashion girls, combine lot of different outfits, create your own unique brand fashion style and win the title of the beauty princess of all time . Do you accept the fashionista challenge? The best of spa, princess cloths, dress upand makeup games are available in \"Fashion competiton : Dress Up Models Game\" ! Be the fashion designer for the participants of a world beauty contest! browse through a vast wardrobe of trendy and glamorous clothes, accessories and hairstyles to choose the ones that suit you best to create a stylish outfit for each model. Everything is free! No purchase or lockout of the app. First the SPA DAY! Bring your model to the beauty salon and start with her change of look by giving her a beauty treatment. A true fashionista knows that the beauty of the face is essential. Use various beauty products, apply cleansing creams, skin masks or face masks, pluck your eyebrows and remove all blemishes from your face. Fans of beauty salon games for girls looking to play spa games for girls will enjoy our beauty salon! Second the MAKEUP Do you like makeup games for girls? Brilliant! This part of Princess Fashion dress up change in game is going to love you because this kind of beauty and fashion games is better than any other makeup tutorial. Practice as much as you want ow to put make up in your model and have the best real virtual experiece, and you will see how much learning to put on makeup has taken. never been so easy. third the FASHIONABLE PEINDADOS Open the collection of the most beautiful women's haircuts and choose one of the trendy hairstyles that will best reflect your mood. Hairdressing games are the best games for girls and a girl stylist should know how to make all the hairstyles in Princess Fashion dress up a real \"It Girl\". Do you like braids, glued hair, soft waves, straight or curly hair? Try out all the haircuts and choose the one that will go best with the look of your model girls. Last the Fashion clothes It's time to show that you are the stylist who deserves to win the Dress up challenge! This is the last stop for our beauty salon. After the hairstyles and makeup, it's time to dress the girls up! What's your favorite fashion style? Modern, elegant, gothic clothes or do you prefer casual and retro fashion? Can you guess the Dress up fashion trends? Pair modern clothes to dress the girls with prettier outfits that will win the fashion dress up copetition. You don't need a styling dress up course. With one click, you can combine lot of and differents items of clothing and accessories , All y your ownn choice ! Will you win the fashion princess dress up contest? Well you will see if you download the \"Princess Fashion dress up\" now. Play the best fashion games to dress up girls and do hairstyles and makeup, because free virtual fashion and makeover games are some of the games that girls can dress up and make up and combine more fun than you can not find. Have more FUN in this Fashion competiton : Dress Up Models Game Get More FUN Dash through this fashion world game and dress up more models Enjoy amazing fashion boutique dress up game for girls Best Salon fashion competition dress up Game for Girls!","instructions":"First the SPA DAY Bring your model to the beauty salon and start with her change of look by giving her a beauty treatment A true fashionista knows that the beauty of the face is essential Use various beauty products apply cleansing creams skin mask","url":"https:\/\/html5.gamemonetize.com\/huozh9s31gyzhoeemfyuywd2f6o6ghqx\/","category":"Girls","tags":".io Games, 2D, Baby, Barbie, Battle, Bejeweled, Classic, Design, Dress Up, Elsa, Fashion, Frozen, Game, Games, Girl, Girls, Hello Kitty, Hot, Jewel, Nails, Princess, Simulation","thumb":"https:\/\/img.gamemonetize.com\/huozh9s31gyzhoeemfyuywd2f6o6ghqx\/512x384.jpg","width":"800","height":"600"},{"id":"11371","title":" pixel Art Breaker","description":"Pixel Breaker is a block breaking game, where these blocks form pixel art","instructions":"touch or mouse","url":"https:\/\/html5.gamemonetize.com\/5boegrmvup4jk43szpto0vhfvdzvmrks\/","category":"Puzzle","tags":"1 Player, 2D, Arkanoid, Bejeweled","thumb":"https:\/\/img.gamemonetize.com\/5boegrmvup4jk43szpto0vhfvdzvmrks\/512x384.jpg","width":"720","height":"1280"},{"id":"12318","title":"Bear Boom","description":"The BEST FREE MATCH 3 GAME! Match cute jellies to achieve goal! If you are in the mood for an amazingly delicious jelly puzzle, Bear Boom is the exact right sweet course for you. Link and collect jelly in this extremely yummy adventure! - Select 3 or more adjacent same jelly - Select 7 or more jelly to create strong and explosive special jelly - Accomplish level targets within limited moves - Create power-ups strategically to achieve level targets","instructions":"Use Touch or Mouse click","url":"https:\/\/html5.gamemonetize.com\/krl0tsxuqskqijitov0q6eh3y5cafg4z\/","category":"Puzzle","tags":"Animal, Bejeweled, Best, Fun, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/krl0tsxuqskqijitov0q6eh3y5cafg4z\/512x384.jpg","width":"600","height":"900"},{"id":"11744","title":"Fruit Farm Crush","description":"Yes! it's time to Crush and Fruits and Veggies. Play and enjoy Fruits Farm Crush Match 3 game and join the fantastic adventure in the Fruits Land! Swipe, Match, pop and collect Fruits & Veggies. Break all Frozen blocks to complete your mission. Bring Down Milk bottles to the bottom & Play against Time. Lovely Fruits and powerful boosts! No complicated rules! Easy to play but hard to master. Cool animation effects and tons of levels. You’ll be addicted to Fruits Farm Crush from the first hit! Have fun!","instructions":"Swipe Match pop and collect Fruits Veggies ","url":"https:\/\/html5.gamemonetize.com\/nptfszf0k5ytqixllw2upru8s5wpofmb\/","category":"Puzzle","tags":"Arcade, Brain, Farm, Fruit, Fruits, Hypercasual, Kids, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/nptfszf0k5ytqixllw2upru8s5wpofmb\/512x384.jpg","width":"800","height":"600"},{"id":"12087","title":"Candy Blast Mania - Match 3 Puzzle Game","description":"Candy Blast Mania is a brand new puzzle game designed for players who just want to play and have fun without being distracted by others. Match 3 or more candies of the same color and complete missions on each level of this adventure. Challenging but fun every turn! If you love sweets and puzzles and have a thing for pigs, this fun and fun puzzle game is for you! Touch, jump and go on an adventure with your new best friend Lucky. Fortunately, the little pink pig is a foodie and loves candy. His mother told him that if he wanted to eat more candy, he had to constantly challenge himself. Level up and feed Lucky delicious candies and you'll be the best in no time! OwHow to play","instructions":"Candice a besoin de ton aide pour collecter des bonbons dans le monde entier Une simple touche clate tous les bonbons de la m me couleur - si tu en clates suffisamment tu pourras m me fabriquer des bombes bonbons","url":"https:\/\/html5.gamemonetize.com\/7qr3rumr0bwfw5eqgifvuq8965ypc6nj\/","category":"Puzzle","tags":"Adventure, Candy, Jewel","thumb":"https:\/\/img.gamemonetize.com\/7qr3rumr0bwfw5eqgifvuq8965ypc6nj\/512x384.jpg","width":"800","height":"600"},{"id":"11661","title":"Winter Bubble Game","description":"Winter Bubble Game is a classic bubble game but it is very amazing in certain game levels you will see the bubbles in a row will keep falling , this game is very simple and Amazing , Once you start playing it you will not be able to stop playing because you will find endless bubble fun adventure on each level.","instructions":"use your mouse on the screen to play","url":"https:\/\/html5.gamemonetize.com\/ixsrbszyek8vfsu81ymncxtxk2py64ho\/","category":"Puzzle","tags":"1 Player, 3D, Bubble, Christmas, Funny, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ixsrbszyek8vfsu81ymncxtxk2py64ho\/512x384.jpg","width":"600","height":"960"},{"id":"9965","title":"Fruit Tales","description":"Play Fruit Tales, match all the fruits and use powerups in this challenging match 3 adventure. play as the boy or girl and complete all 120 levels.","instructions":"Touch or use your mouse to swap 2 fruits Make combinations of 3 or more ","url":"https:\/\/html5.gamemonetize.com\/5e24yjpua9ak8vah4hq773g2gvuz5hya\/","category":"Puzzle","tags":"Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/5e24yjpua9ak8vah4hq773g2gvuz5hya\/512x384.jpg","width":"450","height":"800"},{"id":"11040","title":"Farm Merge Pop","description":"Welcome to the most amazing Fruits Merging Game Your mission is to Merge 3 or More Fruits to complete your level. Use Rockets or Bombs to clear more fruits. Challenge yourself and other players and Try to complete all missions. Enjoy this Brain Match3 game","instructions":"Slide your finger on screen to match fruits","url":"https:\/\/html5.gamemonetize.com\/0epfv0d4tp194hv3c6h5j68yvzluen2e\/","category":"Puzzle","tags":"Arcade, Brain, Casual, Fruit, Fruits, Match 3, Match-3, Match3, Matching, Punch","thumb":"https:\/\/img.gamemonetize.com\/0epfv0d4tp194hv3c6h5j68yvzluen2e\/512x384.jpg","width":"800","height":"600"},{"id":"10825","title":"Candy Swap","description":"Here is the new innovative candy match-3 game! Swap candies to make sweet lines of 3 or more to create candy blasts! Match 3 of the same colored candies to earn points. If you match 4 candies, they become a special candy! Use the power of special candies for special advantages. Clear stage missions with a given number of moves. A variety of missions and obstacles provide exciting new challenges.","instructions":"Match 4 candies to get a special candy ","url":"https:\/\/html5.gamemonetize.com\/beaue5kxwe83gzqht0wa7gbabto48o3j\/","category":"Puzzle","tags":"Arcade, Bejeweled, Board, Candy, Jewel, King, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/beaue5kxwe83gzqht0wa7gbabto48o3j\/512x384.jpg","width":"800","height":"600"},{"id":"10726","title":"Blocks Puzzle Jewel 2","description":"Blocks Puzzle Jewel 2 is an amazing game. make full lines vertically or horizontally to clear the blocks and to get a high score. drag and drop blocks into the grid. have fun playing Blocks Puzzle Jewel.","instructions":"Mouse Drag and Drop","url":"https:\/\/html5.gamemonetize.com\/v7wnrnwnvpdhkl5ndz2qvldz11ceklxg\/","category":"Puzzle","tags":"Block, Hypercasual, Jewel, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/v7wnrnwnvpdhkl5ndz2qvldz11ceklxg\/512x384.jpg","width":"800","height":"600"},{"id":"10728","title":"Bubble Wipeout","description":"Shoot down as many bubbles as you can – aim, match, shoot and burst the same colored bubbles. Keep in eye on the clock timer.","instructions":"Use touch device or mouse to play this game ","url":"https:\/\/html5.gamemonetize.com\/97eg0shq23fjk8lr6beyjcbebu65xej6\/","category":"Shooting","tags":"Bubble, Bubble Shooter, HTML5, Matching, Mobile, Planet, Punch, Puzzle, Shooter","thumb":"https:\/\/img.gamemonetize.com\/97eg0shq23fjk8lr6beyjcbebu65xej6\/512x384.jpg","width":"600","height":"800"},{"id":"10588","title":"Fruit Bubble Shooters","description":"This is a brand new and super addictive fruit bubble shoot game, once the start, there is no way to stop. Aim and match fruit bubbles where you want to shoot them. Match 3 or more identical fruit bubbles. Use less shots to complete a level and try to earn full stars on every level.","instructions":"Aim and shoot fruits","url":"https:\/\/html5.gamemonetize.com\/vjd01r3ld488ehd901cu5nolivu1uxgq\/","category":"Puzzle","tags":"2D, Brain, Bubble, Bubble Shooter, Casual, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/vjd01r3ld488ehd901cu5nolivu1uxgq\/512x384.jpg","width":"800","height":"600"},{"id":"10587","title":"Fruit Fever","description":"Swipe and match 3 or more adjacent fruit candies to complete missions and clear levels. Create powerful combos to get awesome gifts and to explode all the fruits. Play with friends and compete for the highest score!","instructions":"Swipe to match or use the mouse on desktop","url":"https:\/\/html5.gamemonetize.com\/xua4sr8v1r9ww8y4vb3diwz8lnskdtab\/","category":"Puzzle","tags":"Candy, Casual, Fruit, Fruits, Jewel, Match 3, Match-3, Match3, Matching, Memory, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/xua4sr8v1r9ww8y4vb3diwz8lnskdtab\/512x384.jpg","width":"800","height":"600"},{"id":"10048","title":"Space Heroes Match","description":"A fun and addicting match-3 game. Match the same tiles to collect the powers for the corresponding hero, to fire at the enemy spaceships. Play as fast as possible before the countdown timer runs out, to win a high score. Features: - colorful tiles - nice animations and effects PLAY NOW!","instructions":"Tap and drag to match the tiles ","url":"https:\/\/html5.gamemonetize.com\/2l6bemyentqp7b7sabujofb8n9g5lcho\/","category":"Bejeweled","tags":"Best, Fun, HTML, Match 3, Match-3, Match3, Matching, Mobile, Shoot, Shooting, Superhero","thumb":"https:\/\/img.gamemonetize.com\/2l6bemyentqp7b7sabujofb8n9g5lcho\/512x384.jpg","width":"360","height":"480"},{"id":"10330","title":"Cookie Blast","description":"Cookie Blast, classic match 3 candy puzzle game, with HD graphic and amazing effects! cookie blast is an addictive,excited and amazing Candy classic match 3 with many colorfun candies.Let' try unlock all our levels and become winner","instructions":"swipe match 3 or more similar cookies","url":"https:\/\/html5.gamemonetize.com\/ka2ofpxc686h0lviuhvfbjd5der597hu\/","category":"Puzzle","tags":"Candy, Casual, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ka2ofpxc686h0lviuhvfbjd5der597hu\/512x384.jpg","width":"800","height":"600"},{"id":"10147","title":"Village Of Monsters","description":"Swap blocks in order to make a group of 3 or more identical candies adjacent horizontally or vertically. Keep matching till you unlock and clear all the tiles. Use power-ups to speed up the process. There is 36 interesting levels in this game.","instructions":"Use mouse or touch pad to play this game ","url":"https:\/\/html5.gamemonetize.com\/g9zsgwm29wgrlk7pzayldcrrj3symlt3\/","category":"Puzzle","tags":"Arcade, Collecting, Fun, Girls, HTML, HTML5, Match 3, Match-3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/g9zsgwm29wgrlk7pzayldcrrj3symlt3\/512x384.jpg","width":"800","height":"450"},{"id":"9357","title":"Mushroom Pop","description":"Game offers you quite a few levels to be solved. You can do so by popping mushrooms. There are different types of them and each has different and unique behaviour when tapped. Think ahead and tap with caution.","instructions":"Tap different mushrooms for corresponding action Goal of the game is simple Clear all the mushrooms from the board in as few attempts as possible More attempts you take less stars you get for finishing the current level ","url":"https:\/\/html5.gamemonetize.com\/c191fq9np7qpi8cwbdz1v1q8721dphg2\/","category":"Hypercasual","tags":"Bubble, Game, HTML5, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/c191fq9np7qpi8cwbdz1v1q8721dphg2\/512x384.jpg","width":"800","height":"600"},{"id":"9573","title":"Farm Heroes Match","description":"A fun and addicting match-3 game. Match the same tiles to collect the powers for the corresponding hero, to fire at the harmful insects. Play as fast as possible before the countdown timer runs out, to win a high score. Features: - colorful tiles - nice animations and effects PLAY NOW!","instructions":"Tap and drag to match the tiles ","url":"https:\/\/html5.gamemonetize.com\/vsuoa6kpja9vechi04tqm4uvg8ot39dy\/","category":"Bejeweled","tags":"Best, Farm, Fun, HTML, Match 3, Match-3, Match3, Matching, Mobile, Shooting","thumb":"https:\/\/img.gamemonetize.com\/vsuoa6kpja9vechi04tqm4uvg8ot39dy\/512x384.jpg","width":"360","height":"480"},{"id":"9360","title":"Fish Connect Deluxe","description":"Connect similar fish blocks using touch or mouse. Make a group of 3 or more, horizontally, vertically or diagonally adjacent fish to make their block aqua. Make all the blocks aqua to complete the level. Complete all 24 levels to win this game.","instructions":"Use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/nuj83ytgnffgixwu6ivm1vrxryibodsc\/","category":"Puzzle","tags":"Fish, Girls, HTML5, Match 3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/nuj83ytgnffgixwu6ivm1vrxryibodsc\/512x384.jpg","width":"800","height":"450"},{"id":"8990","title":"Xmas Bubble Army","description":"It is a magnificent variation of Bubble Shooter game with exclusive design, power-ups and unlimited game play. This game has auto save. You can start from where you left the game.","instructions":"Click or touch where you want to shoot the bubble Remove bubbles to create a cluster of 3 or more bubbles of the same color The game ends if you let any bubble get past the line at the bottom of the screen Use coins you earn in the game to purchase the","url":"https:\/\/html5.gamemonetize.com\/yv9zfkbcvfbac48ue69ems3z03fps4rq\/","category":"Girls","tags":"Bubble, Bubble Shooter, Christmas, Girls, HTML5, Match 3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/yv9zfkbcvfbac48ue69ems3z03fps4rq\/512x384.jpg","width":"360","height":"640"},{"id":"8744","title":"Xmas Match Deluxe ","description":"Swap adjacent gifts in order to make a horizontal or vertical row of 3 identical gifts. To complete a level you need to collect required number of gifts in limited turns. Collect more than 5 gifts to get a spell (power-up) which will show up on the right side of the screen. Cast spells by dragging and dropping it on the target. The \"hint\" and \"double\" spells are cast by clicking on them. Click next to know about spells.","instructions":"Use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/3o0kfb206ee8sjh1q14uu8cc2eiywur0\/","category":"Bejeweled","tags":"Christmas, Girls, HTML5, Match-3, Match3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/3o0kfb206ee8sjh1q14uu8cc2eiywur0\/512x384.jpg","width":"800","height":"450"},{"id":"8746","title":"Frozen Bubble HD","description":"Frozen Bubble is a famous classic game, originally designed for Linux and ported to many platforms. Now you can play it online in your browser without installation in HD quality!","instructions":"Aim by mouse and click to shoot or just touch your screen to shoot ","url":"https:\/\/html5.gamemonetize.com\/2oz0kwnjn3umjt8mirkpcbpjlq2xqpjt\/","category":"Hypercasual","tags":"Bubble, Bubble Shooter, Hypercasual","thumb":"https:\/\/img.gamemonetize.com\/2oz0kwnjn3umjt8mirkpcbpjlq2xqpjt\/512x384.jpg","width":"800","height":"600"},{"id":"8303","title":"Mahjong Quest","description":"Start off your Mahjong journey in this classic oriental solitaire puzzle game! The rules are simple, you just remove matching pieces from the board until you fulfil the goal. If you are fast enough, you will receive medals and tools to help you!","instructions":" Goal Match pairs of identical tiles to remove them from the board until it s entirely cleared or until you find all special tiles You can only match tiles which are free on at least one side Match as fast as you can to earn awards and medals to unl","url":"https:\/\/html5.gamemonetize.com\/zitg3wtlcjfmk8lr3cry3adqhztoe3dd\/","category":"Puzzle","tags":"Board, HTML5, Mahjong, Match 3, Puzzle, Solitaire","thumb":"https:\/\/img.gamemonetize.com\/zitg3wtlcjfmk8lr3cry3adqhztoe3dd\/512x384.jpg","width":"800","height":"600"},{"id":"8540","title":"Xmas MnM","description":"In this game you need to eliminate all the blocks shown in the board. To do this, slide the blocks towards another identical block make a linear group of 3 similar blocks. Take as less time as possible to get more score.","instructions":"Use mouse or touch screen to play this game ","url":"https:\/\/html5.gamemonetize.com\/oorqkq8lh1uc7o4e5036jzfuei4phlp6\/","category":"Puzzle","tags":"Board, Christmas, HTML5, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/oorqkq8lh1uc7o4e5036jzfuei4phlp6\/512x384.jpg","width":"800","height":"450"},{"id":"8526","title":"Christmas Quest","description":"Christmas Quest is an unique match 3 game. Move the items to the blank spaces in order to create a horizontal or vertical row of 3 identical items. Use as less moves as possible for more score. To move just tap the item and then tap the location you want it to move. If there is any open path between the item and its destination, it would travel to the new place. Apart from making set of 3 identical items, you will get extra time bonus, if you complete the game early.","instructions":" To move just tap the item and then tap the location you want it to move ","url":"https:\/\/html5.gamemonetize.com\/ckg5v1rljvxe5hoizde3xp819myzh8iu\/","category":"Puzzle","tags":"Christmas, Girls, HTML5, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ckg5v1rljvxe5hoizde3xp819myzh8iu\/512x384.jpg","width":"800","height":"450"},{"id":"8521","title":"Christmas Block Collapse","description":"Touch or click to collect similar items that are horizontally or vertically connected to each other. You have to collect all the items from the board. If you collect a group of 2 or more you will get score. If you collect more than 7 items in a single turn you will get a random power-up (Bomb or Arrow or Magnet). If you collect only 1 item in a turn, 200 points will be deducted from your score. Use the information in the Projection box to see how much each collection is worth. Reach or pass each level's Target amount and clear all the items in the board to go on to the next level. That's okay, if you don't reach the target amount as you can always retry the level.","instructions":"Touch or click to collect similar items that are horizontally or vertically connected to each other ","url":"https:\/\/html5.gamemonetize.com\/iv0cl7ne6sd244flk83qa4dlb389n0l6\/","category":"Bejeweled","tags":"Arcade, Bejeweled, Christmas, Collecting, HTML5, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/iv0cl7ne6sd244flk83qa4dlb389n0l6\/512x384.jpg","width":"800","height":"450"},{"id":"8399","title":"Momo Pop","description":"Momo Pop is a match-3 game with cute characters with 100 fun yet challenging stages.","instructions":"Swipe to move piece","url":"https:\/\/html5.gamemonetize.com\/cqfw5c93fqef9pkp55e30darvb4i9l6m\/","category":"Puzzle","tags":"1 Player, 2D, Animal, Arcade, Bejeweled, Boy, Boys, Casual, Cute, Game, Games, Girl, Girls, HTML5, Hypercasual, Kid, Kids, Match 3, Match-3, Match3, Matching, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/cqfw5c93fqef9pkp55e30darvb4i9l6m\/512x384.jpg","width":"1080","height":"1620"},{"id":"8333","title":"Flower Shooter","description":"It is a magnificent variation of Bubble Shooter game with exclusive design, power-ups and unlimited game play. This game has auto save. You can start from where you left the game.","instructions":"Click or touch where you want to shoot the flower Remove flowers to create a cluster of 3 or more flowers of the same color ","url":"https:\/\/html5.gamemonetize.com\/ivi9o2pwigay73qpi92g5snzf604gglz\/","category":"Girls","tags":"Bubble, Bubble Shooter, Girls, HTML5, Match-3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/ivi9o2pwigay73qpi92g5snzf604gglz\/512x384.jpg","width":"360","height":"640"},{"id":"7543","title":"Jewels Mine","description":"Jewels Mine is a fun match 3 game. Swap and match 3 or more gems of the same type and make points and special power ups. Earn points and compete with your friends and with all other players around the world in the global leaderboards! 92+ levels.","instructions":" Mouse on PC Touch on Smartphone and Tablet ","url":"https:\/\/html5.gamemonetize.com\/szvg8ff68grltoybxgozhfwl1vtq2vqv\/","category":"Puzzle","tags":"1 Player, 2D, Android, Arcade, Bejeweled, Boy, Boys, Brain, Candy, Casual, Fun, Funny, Game, Games, Girl, Girls, Highscore, HTML, HTML5, Hypercasual, Jewel, Kid, Kids, Match 3, Match-3, Match3, Matching, Mine, Miner, Mobile, Online, Play, Puzzle, Skill, Skills","thumb":"https:\/\/img.gamemonetize.com\/szvg8ff68grltoybxgozhfwl1vtq2vqv\/512x384.jpg","width":"640","height":"830"},{"id":"5884","title":"The Sea Rush","description":"Use your imagination and discover what the ocean holds. Rescue all the fishes that are scattered in the levels and see all of their beautifull colors.","instructions":"Match 3 blocks or more to destroy the blocks and clear them from the game screen Use power ups to clear more blocks or collect 3 rainbow blocks to make a random power up that you can use Manage to collect 3 fishes in their bubles and you win the level ","url":"https:\/\/html5.gamemonetize.com\/p9vorzl2eiw1reh6heiqo2f556f14k2u\/","category":"Bejeweled","tags":"Block, Fish, HTML5","thumb":"https:\/\/img.gamemonetize.com\/p9vorzl2eiw1reh6heiqo2f556f14k2u\/512x384.jpg","width":"600","height":"800"},{"id":"7226","title":"Jewel Dash","description":"Try this unique and fun match 3 puzzle game. Progress throughout the game and unlock different power ups. Complete various challenges to unlock skins for your gems.","instructions":"Find and tap groups of 3 or more gems of the same colour to clear them from the field Earn score to progress through the mine Clearing larger groups earns you more score Reach power ups to unlock them for usage ","url":"https:\/\/html5.gamemonetize.com\/2ayu91ql4r4mmrqzl6ems41cpdlx6gx8\/","category":"Puzzle","tags":"HTML5, Jewel, Match 3, Match-3, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/2ayu91ql4r4mmrqzl6ems41cpdlx6gx8\/512x384.jpg","width":"600","height":"800"},{"id":"7147","title":"Angry Vegetables","description":"Start by pressing a vegetable and then move the pointer on the similar vegetables which are adjacent to the previous. Make a chain of 3 or more to remove them. If you make a chain of 7, you will get 2x power vegetable and If you make a chain of 10, you will get 1 minute bonus. Try to get maximum score in this time bound game.","instructions":"Use mouse or touch pad to play this game ","url":"https:\/\/html5.gamemonetize.com\/4ba6v6083k4welnmansambpwdkal5ul9\/","category":"Puzzle","tags":"Collecting, Farm, Halloween, HTML5, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/4ba6v6083k4welnmansambpwdkal5ul9\/512x384.jpg","width":"800","height":"450"},{"id":"6954","title":"Money Match 3","description":"Slide treasure blocks horizontally to make a vertical row of 3 or more similar blocks. Swipe or drag a row right or left to make matches. Try and see how many matches you can make before time runs out.","instructions":"Use touchscreen swap or mouse to slide the blocks ","url":"https:\/\/html5.gamemonetize.com\/400wcjbpzriday4wucpq2zflu5a2d22i\/","category":"Puzzle","tags":"Bejeweled, Collecting, HTML5, Match 3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/400wcjbpzriday4wucpq2zflu5a2d22i\/512x384.jpg","width":"800","height":"450"},{"id":"6920","title":"Bubble Shooter Africa","description":"Enjoy this bubble shooter game with African theme and power ups. Aim and release the items in order to combine it with other similar items. Use power-ups to overcome the challenges.","instructions":"Use mouse or touch pad to shoot the bubble ","url":"https:\/\/html5.gamemonetize.com\/03wcuo5adbi6ibhnyx2n4pygluio82o9\/","category":"Puzzle","tags":"Bubble, Bubble Shooter, Collecting, HTML5, Match-3, Matching, Mobile, Puzzle, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/03wcuo5adbi6ibhnyx2n4pygluio82o9\/512x384.jpg","width":"800","height":"450"},{"id":"6739","title":"Foody Triple Mahjong","description":"A triple mahjong game with ocean theme. You can eliminate only three of same tiles. Those tiles can be selected which have at least 2 adjacent sides open.","instructions":"Use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/cb8k6j0ezewli6bnxrwu3bjnbcrfxyg9\/","category":"Clicker","tags":"Board, Food, HTML5, Mahjong, Match-3, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/cb8k6j0ezewli6bnxrwu3bjnbcrfxyg9\/512x384.jpg","width":"800","height":"450"},{"id":"6704","title":"Candy Blocks Collapse ","description":"Click on 2 or more than 2 candy blocks to eliminate them. To complete a level you need to eliminate all the blocks on the board. Be wise while eliminating blocks because each block need at least one identical neighbor!","instructions":" Instructions Use mouse or touch to select the blocks ","url":"https:\/\/html5.gamemonetize.com\/tlxqs71cfbqshxqq1g2hfzwt5g2qtyqn\/","category":"Girls","tags":"Block, Candy, Clicker, Collecting, Girls, HTML5, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/tlxqs71cfbqshxqq1g2hfzwt5g2qtyqn\/512x384.jpg","width":"800","height":"450"},{"id":"6611","title":"Planets Match 3","description":"Swap blocks in order to make a group of 3 or more identical planets adjacent horizontally or vertically. Keep matching till you match the required number of planets. Each level includes different planets which you need to match.","instructions":"Use mouse or touch pad to play this game ","url":"https:\/\/html5.gamemonetize.com\/0cpenqml9w1t1f98kx3k3agowpqbekdf\/","category":"Bejeweled","tags":"Bejeweled, HTML5, Match-3, Mobile, Planet, Puzzle, Space","thumb":"https:\/\/img.gamemonetize.com\/0cpenqml9w1t1f98kx3k3agowpqbekdf\/512x384.jpg","width":"800","height":"450"},{"id":"6610","title":"Superheroes Connect Deluxe","description":"Connect similar Super Heroes using touch pad or mouse. Make a group of 3 or more, horizontally, vertically or diagonally adjacent heroes to make their block's color bright. Make all the blocks bright to complete the level. Complete all 24 levels to win this game.","instructions":"Use touch pad or mouse to play this game ","url":"https:\/\/html5.gamemonetize.com\/wqisa732xjc55ah851rcu1mzq6aztuaq\/","category":"Puzzle","tags":"Arcade, Bejeweled, HTML5, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/wqisa732xjc55ah851rcu1mzq6aztuaq\/512x384.jpg","width":"800","height":"450"},{"id":"6530","title":"Super Jewel Collapse","description":"It is a challenging block collapse game. In each level you will get a unique challenge. You have to complete the challenge in allowed number of turns. If you do in less turns, you will got good bonus points. Complete 45 levels to win this game.","instructions":"Touch or click the Image which is different from others ","url":"https:\/\/html5.gamemonetize.com\/ioz9d45yekpf9jp0qlvd54f67c4slxs4\/","category":"Girls","tags":"Bejeweled, Collecting, Girls, HTML5, Jewel, Match-3, Match3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/ioz9d45yekpf9jp0qlvd54f67c4slxs4\/512x384.jpg","width":"800","height":"450"},{"id":"6500","title":"Candi Cruz Saga","description":"Candi Cruz Saga Collect 3 of the same sweets to build the stage and then go to the next level. Candi Cruz Saga This Game contains 3 worlds with 99 levels in each of them. Try to unlock All. Game to match 3 sweets in horizontal or vertical lines candycruz style easy to play, with 297 different levels.","instructions":"click or touch","url":"https:\/\/html5.gamemonetize.com\/xjpszy13sxtc9wgaa398o5vv43l19o16\/","category":"Hypercasual","tags":"Bejeweled, Candy, Match 3, Match-3, Match3","thumb":"https:\/\/img.gamemonetize.com\/xjpszy13sxtc9wgaa398o5vv43l19o16\/512x384.jpg","width":"480","height":"800"},{"id":"6422","title":"Kids Math","description":"Solve the problems and love math!","instructions":"Mouse","url":"https:\/\/html5.gamemonetize.com\/24blpbh70pv2ku7815m7g2furwh4hj4k\/","category":"Puzzle","tags":"Kids, Math","thumb":"https:\/\/img.gamemonetize.com\/24blpbh70pv2ku7815m7g2furwh4hj4k\/512x384.jpg","width":"800","height":"600"},{"id":"6433","title":"Bubble Shooter Egypt","description":"Collect all the antiques from the Bubbles. The antiques will be collected when the bubble shot by you, combines with a group of 3 or more than 3 bubbles of same type. You must complete a level within allowed time. You will get better score if you complete the level early.","instructions":"Use mouse or touch pad to shoot the bubble ","url":"https:\/\/html5.gamemonetize.com\/54m5059woy9airt0469xzuow7sbnmaps\/","category":"Bejeweled","tags":"Bejeweled, Bubble, Bubble Shooter, Girls, HTML5, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/54m5059woy9airt0469xzuow7sbnmaps\/512x384.jpg","width":"800","height":"450"},{"id":"6285","title":"Fruits Blocks Collapse","description":"Collect all the fruit slices by clicking or touching them in groups. If you collect a group of 2 or more you will get score. If you collect more than 7 slices in a single turn you will get a power-up (Bomb or Arrow or Magic Slice). If you tap a single slice, 200 points will be deducted from your score. Use the information in the Projection box to see how much each collection is worth. Reach or pass each level's Target amount and clear all the slices in the board to go on to the next level.","instructions":"Use mouse or touch pad to play this game ","url":"https:\/\/html5.gamemonetize.com\/wc8x3t3ijk5k6cthbew5h9lxgh4tr7un\/","category":"Puzzle","tags":"Block, Collecting, Fruits, HTML5, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/wc8x3t3ijk5k6cthbew5h9lxgh4tr7un\/512x384.jpg","width":"800","height":"450"},{"id":"6240","title":"Gems Shooter","description":"This is a special bubble shooter game in which you will find a rotating wheel of GEMS. To complete the game you need to collect all the GEMS on the wheel. Shoot the GEM towards the wheel to make the group of at least three GEMS of the same color. Your points are reducing with the time, So finish the game early to save more points.","instructions":"Use mouse or touch input to play this game","url":"https:\/\/html5.gamemonetize.com\/a771u4s5iqpa8wp5f8d0n3aa2zgrfarp\/","category":"Shooting","tags":"Bejeweled, Bubble, Bubble Shooter, Girls, HTML5, Jewel, Mobile, Puzzle, Shooter","thumb":"https:\/\/img.gamemonetize.com\/a771u4s5iqpa8wp5f8d0n3aa2zgrfarp\/512x384.jpg","width":"800","height":"450"},{"id":"6166","title":"Aquatic Triple Mahjong","description":"A triple mahjong game with ocean theme. You can eliminate only three of same tiles. Those tiles can be selected which have at least 2 adjacent sides open.","instructions":"Use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/vw9o1sp2nnoc6v3m0ah96v5ccx60dp08\/","category":"Puzzle","tags":"Clicker, Fish, Girls, HTML5, Mahjong, Match 3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/vw9o1sp2nnoc6v3m0ah96v5ccx60dp08\/512x384.jpg","width":"800","height":"450"},{"id":"5427","title":"Match Fruits","description":"Match Fruits is a fun match 3 game with 72 stages (and counting). Swap and match 3 or more fruits of the same type and make points and special fruits before time runs out. Earn points and compete with your friends and with all other players around the world in the global leaderboards.","instructions":" Mouse on PC Touch on Smartphone and Tablet ","url":"https:\/\/html5.gamemonetize.com\/0kahkmrj3w9118t2rzxedkjtlk6ckedk\/","category":"Puzzle","tags":"2D, Android, Arcade, Bejeweled, Best, Board, Boy, Boys, Casual, Fruit, Fruits, Fun, Funny, Game, Games, Girl, Girls, H5, Highscore, HTML, HTML5, Hypercasual, Kid, Kids, King, Match 3, Match-3, Match3, Matching, Mobile, New, Online, Play, Puzzle, Skill, Skills, Slicing","thumb":"https:\/\/img.gamemonetize.com\/0kahkmrj3w9118t2rzxedkjtlk6ckedk\/512x384.jpg","width":"640","height":"830"},{"id":"5879","title":"Bubble Shooter Fruits Candies","description":"Bubble Shooter Fruits Candies is a Classical bubble shooter game with many new items and power ups. Aim and release the Fruit Candy in order to combine it with other similar Candies. Use power-ups to overcome the challenges.","instructions":"Use mouse or touch pad to play this game ","url":"https:\/\/html5.gamemonetize.com\/giam8wn6d6vrzalo6l9hmxuuhl9q59qm\/","category":"Girls","tags":"Arcade, Bubble, Bubble Shooter, Candy, Fruits, Girls, HTML5, Mobile, Puzzle, Shooter","thumb":"https:\/\/img.gamemonetize.com\/giam8wn6d6vrzalo6l9hmxuuhl9q59qm\/512x384.jpg","width":"800","height":"450"},{"id":"5865","title":"Bubble Shooter Colored Planets","description":"Play the classic FREE bubble pop game! Shoot, match 3 colors and clear levels! Fun and relaxing game! Aim and shoot to drop all bubbles! Bubble Shooter is a widely loved genre in all countries!","instructions":"Tap on the screen or use mouse to aim shoot match 3 colors and clear levels ","url":"https:\/\/html5.gamemonetize.com\/jfhgxes29xb6j99osalp36dlu4n2yo2h\/","category":"Shooting","tags":"Bubble, Bubble Shooter, Casual, Match 3, Match-3, Matching, Mobile, Planet, Space","thumb":"https:\/\/img.gamemonetize.com\/jfhgxes29xb6j99osalp36dlu4n2yo2h\/512x384.jpg","width":"300","height":"500"},{"id":"5840","title":"Star Lines","description":"Move the Stars to the blank spaces in order to create a horizontal or vertical row of 5 identical items. To move just tap the item and then tap the location you want it to move. If there is any open path between the item and its destination, it would travel to the new place. Each time when you move a star and if no match happens, 3 new stars will be added to the board. Don't let the board crowded or it may fill all the places and your spell will be ended.","instructions":"Use mouse or touch-screen to play this game ","url":"https:\/\/html5.gamemonetize.com\/xqlcu624y6qnnt6h2zg47bh6gu9j8qk6\/","category":"Puzzle","tags":"Bejeweled, Casual, Fun, Girls, HTML5, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/xqlcu624y6qnnt6h2zg47bh6gu9j8qk6\/512x384.jpg","width":"800","height":"450"},{"id":"5775","title":"Sliding Hearts Match 3","description":"Slide a row of hearts horizontally to make a horizontal or vertical row of 3 or more similar hearts. Swipe or drag a row right or left to make matches. Try and see how many matches you can make before time runs out.","instructions":"Use mouse or touch screen to play this game ","url":"https:\/\/html5.gamemonetize.com\/hyi9bxrno3do9nj1r6p9ph3ah1om8fnq\/","category":"Girls","tags":"Collecting, Fun, Girls, HTML5, Love, Match-3, Match3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/hyi9bxrno3do9nj1r6p9ph3ah1om8fnq\/512x384.jpg","width":"800","height":"450"},{"id":"5751","title":"Candy Love Rush","description":"Candy Love Rush is a connect match game on html5, connecting the candy to match the same candy color","instructions":"touch screen and connect 3 or more candy","url":"https:\/\/html5.gamemonetize.com\/e781dp98r6e9baacvzpewiuvvupq3erh\/","category":"Hypercasual","tags":"Bejeweled, Candy, Casual, HTML5, Hypercasual, Match3, Matching","thumb":"https:\/\/img.gamemonetize.com\/e781dp98r6e9baacvzpewiuvvupq3erh\/512x384.jpg","width":"496","height":"800"},{"id":"5748","title":"Sweet Candy Rush ","description":"Sweet Candy Rush is a connect match game on html5, connecting the candy to match the same candy color","instructions":"click or touch to connect 3 or more same candy","url":"https:\/\/html5.gamemonetize.com\/jyd1boze7rkn6l0uwb9e2uknxcunlqn5\/","category":"Hypercasual","tags":"Bejeweled, Candy, Casual, Collection, HTML5, Hypercasual, Match 3","thumb":"https:\/\/img.gamemonetize.com\/jyd1boze7rkn6l0uwb9e2uknxcunlqn5\/512x384.jpg","width":"496","height":"800"},{"id":"5743","title":"Lolipop Candy Rush","description":"Lolipop Candy Rush is a connect match game on html5, connecting the candy to match the same candy color","instructions":"touch candy and match 3 or more candy","url":"https:\/\/html5.gamemonetize.com\/efn48wyl82euyldykv67lustg83u74qm\/","category":"Hypercasual","tags":"2D, Bejeweled, Candy, Casual, Click, Color, HTML5, Hypercasual, Match 3","thumb":"https:\/\/img.gamemonetize.com\/efn48wyl82euyldykv67lustg83u74qm\/512x384.jpg","width":"496","height":"800"},{"id":"5732","title":"Cake Rush Saga","description":"Cake Rush Saga is puzzle Match game with colorful and beautiful graphics, collect three or more of the same cake","instructions":"click or touch and match 3 or more cake","url":"https:\/\/html5.gamemonetize.com\/lsaqq1lipt7kj15sizza5k4j39ibz4ck\/","category":"Hypercasual","tags":"1 Player, 2D, Cake, Candy, Casual, Hypercasual, Match 3, Matching","thumb":"https:\/\/img.gamemonetize.com\/lsaqq1lipt7kj15sizza5k4j39ibz4ck\/512x384.jpg","width":"1920","height":"1080"},{"id":"5555","title":"Candy And Monsters","description":"An addicted simulation\/physics game, simple to control, nice design, fun and relax-able. PLAY NOW!","instructions":"Tap to destroy the candies to take the monsters back to the ground ","url":"https:\/\/html5.gamemonetize.com\/w064b8tx2gh9jg63t96ni03y07ahirkf\/","category":"Puzzle","tags":"Arcade, Best, Brain, Games, HTML5, Mobile, Physics, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/w064b8tx2gh9jg63t96ni03y07ahirkf\/512x384.jpg","width":"800","height":"450"},{"id":"5594","title":"Big Farm Match 3","description":"Use left, right and down keys to move the blocks. Use up key to rotate the blocks. Alternatively you can tap or click buttons to do the same. Your target is to fit the blocks to make a row of blocks","instructions":"Use touch buttons or mouse or keyboard to play this game ","url":"https:\/\/html5.gamemonetize.com\/natri7ls15nrob8fupuml306oun91cip\/","category":"Bejeweled","tags":"Collecting, Farm, HTML5, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/natri7ls15nrob8fupuml306oun91cip\/512x384.jpg","width":"800","height":"450"},{"id":"5590","title":"Blocky Tetriz","description":"Use left, right and down keys to move the blocks. Use up key to rotate the blocks. Alternatively you can tap or click buttons to do the same. Your target is to fit the blocks to make a row of blocks","instructions":"Use touch buttons or mouse or keyboard to play this game ","url":"https:\/\/html5.gamemonetize.com\/6raswfncyibhtr0iqen7rhe3wdmtuht1\/","category":"Puzzle","tags":"Block, Board, Candy, HTML5, Mobile, Puzzle, Tetris","thumb":"https:\/\/img.gamemonetize.com\/6raswfncyibhtr0iqen7rhe3wdmtuht1\/512x384.jpg","width":"360","height":"640"},{"id":"5399","title":"Bubble Shooter Candies","description":"It is a classical bubble shooter game with 36 challenging levels. In each level you will find a different challenge. To complete a level you must eliminate all the CANDIES from the screen. The CANDIES will be eliminated when the Candy shot by you combines with a group of 3 or more than 3 Candies of same type. You must complete a level within allowed time. You will get better score if you complete the level early.","instructions":"Use pointing device or touch screen to play this game ","url":"https:\/\/html5.gamemonetize.com\/y3roy6krania1gm0lezahh36rm51wk1u\/","category":"Clicker","tags":"Bubble, Bubble Shooter, Candy, Clicker, Girls, HTML5, Mobile, Point And Click, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/y3roy6krania1gm0lezahh36rm51wk1u\/512x384.jpg","width":"800","height":"450"},{"id":"5395","title":"Falling Flowers","description":"Falling Flowers is a unique match 3 type game where you get to place the falling flowers to help make matches. Keep making matches to eliminate flowers and keep them from reaching the Terminus line at top. Power-ups are available, but you'll need to use these wisely to play longer and get a higher score.","instructions":"Instructions available in the game This game plays on PC s as well as mobile devices ","url":"https:\/\/html5.gamemonetize.com\/psw2foaxlft9gxm0z0g9me9detmgtotj\/","category":"Puzzle","tags":"Casual, Fun, HTML5, Match-3, Match3, Matching, Mobile, Puzzle, Skill","thumb":"https:\/\/img.gamemonetize.com\/psw2foaxlft9gxm0z0g9me9detmgtotj\/512x384.jpg","width":"360","height":"640"},{"id":"5007","title":"Heart Gems Connect","description":"Connect similar GEMS blocks using touch or mouse. Make a group of 3 or more, horizontally, vertically or diagonally adjacent GEM to make their block aqua. Make all the blocks aqua to complete the level. Complete all 24 levels to win this game.","instructions":"Use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/l8snhkvmlu1vf39ttm77egjiom960k8m\/","category":"Girls","tags":"Casual, Clicker, Fun, Girls, HTML5, Match-3, Match3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/l8snhkvmlu1vf39ttm77egjiom960k8m\/512x384.jpg","width":"800","height":"450"},{"id":"4733","title":"Gems Blocks Collapse","description":"Collapse the blocks by tapping groups of horizontally or vertically connected same-color blocks. On each collapse you will obtain a score. The bigger the group you collapse, the higher a score you will get. You can eliminate any single block until you have bombs in your inventory.","instructions":"Use mouse or touch ","url":"https:\/\/html5.gamemonetize.com\/d9d5m6kezaq56axykqfp2ljw0js08wnl\/","category":"Puzzle","tags":"Block, Casual, Clicker, Collecting, Funny, Girls, HTML5, Match3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/d9d5m6kezaq56axykqfp2ljw0js08wnl\/512x384.jpg","width":"800","height":"450"},{"id":"4703","title":"Bubble Shooter Candy Popper","description":"It is a classical bubble shooter game; pop the candy hidden among the bubbles. There will be 48 challenging levels. In each level you will find a different challenge with 'different type of bubbles and power ups'. To complete a level you must pop all the candy pieces appearing among the bubbles. Shoot the bubble on the board to make groups of 3 or more bubbles of the same color. You must complete a level within allowed time. You will get better score if you complete the level early.","instructions":"Use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/uuzuw3iti1f7engskkcq2zmbh9i4kx2f\/","category":"Girls","tags":"Bubble, Bubble Shooter, Candy, Girls, HTML5, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/uuzuw3iti1f7engskkcq2zmbh9i4kx2f\/512x384.jpg","width":"800","height":"450"},{"id":"4708","title":"Vegetables Rush","description":"Vegetables Rush is puzzle Match game with colorful and beautiful graphics, collect three or more of the same fruits or vegetables.","instructions":"connect the vegetables 3 or more ","url":"https:\/\/html5.gamemonetize.com\/i10i99q1909mcnm6p2tdbr01u9goc0ou\/","category":"Bejeweled","tags":"1 Player, 2D, Arcade, Collection, Fruits, Match-3, Matching","thumb":"https:\/\/img.gamemonetize.com\/i10i99q1909mcnm6p2tdbr01u9goc0ou\/512x384.jpg","width":"496","height":"800"},{"id":"4709","title":"Jewels And Monster","description":"An addicted simulation\/physics game, simple to control, nice design, fun and relax-able. PLAY NOW!","instructions":"Tap to destroy the jewels to take the monster to the ground ","url":"https:\/\/html5.gamemonetize.com\/5onbxzclggd5msywig7ci5rbscnugopm\/","category":"Puzzle","tags":"Arcade, Best, Games, HTML5, Mobile, Physics, Simulation","thumb":"https:\/\/img.gamemonetize.com\/5onbxzclggd5msywig7ci5rbscnugopm\/512x384.jpg","width":"960","height":"540"},{"id":"4683","title":"Sea Travel Match 3","description":"Swap blocks in order to make a group of 3 or more identical items adjacent horizontally or vertically. Keep matching till you collect the required number of items. There is 36 interesting challenges in this game.","instructions":"Use mouse or touch pad to swap the blocks ","url":"https:\/\/html5.gamemonetize.com\/mxgysdmr1h22wmqxt1rvd99v5xvvswwe\/","category":"Puzzle","tags":"Casual, Clicker, Collecting, Fish, Fun, Girls, Match 3, Match-3, Matching, Mobile, Puzzle, Summer","thumb":"https:\/\/img.gamemonetize.com\/mxgysdmr1h22wmqxt1rvd99v5xvvswwe\/512x384.jpg","width":"800","height":"450"},{"id":"4090","title":"10x10 Farming","description":"Manage your small 10x10 field. Grow various crops and harvest it. Be smart when placing new seedings, so you never run out of space.","instructions":"Drag and drop shapes from bottom area into main field view ","url":"https:\/\/html5.gamemonetize.com\/y5dw55n0dzsbk6pi0wu4xpp0uggou61t\/","category":"Puzzle","tags":"Farm, Games, HTML5, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/y5dw55n0dzsbk6pi0wu4xpp0uggou61t\/512x384.jpg","width":"600","height":"800"},{"id":"4510","title":"Candy Sweet","description":"candy sweet is a connect match game on html5, connecting the candy to match the same candy color","instructions":"touch or click the candy","url":"https:\/\/html5.gamemonetize.com\/581zgluotxzwuqlzhbqlzh3s2lc3waz2\/","category":"Clicker","tags":"1 Player, 2D, Candy, Collecting, HTML5, Match 3, Matching","thumb":"https:\/\/img.gamemonetize.com\/581zgluotxzwuqlzhbqlzh3s2lc3waz2\/512x384.jpg","width":"496","height":"800"},{"id":"4449","title":"Tetriz Match 3","description":"Shuffle and shift the falling group of candies so that they can form a horizontal or a vertical or a diagonal line of similar candies anywhere in the board. Use left, right keys for shifting and up key for shuffling them. Don’t let the board filled till upper row.","instructions":"Use buttons with mouse or touch or keyboard Arrow keys to play this game ","url":"https:\/\/html5.gamemonetize.com\/2ntiweoqrr171kpqa6lm4wwyd8a48dka\/","category":"Girls","tags":"Candy, Casual, Collecting, Girls, HTML5, Match 3, Match-3, Mobile, Puzzle, Tetris","thumb":"https:\/\/img.gamemonetize.com\/2ntiweoqrr171kpqa6lm4wwyd8a48dka\/512x384.jpg","width":"360","height":"640"},{"id":"4439","title":"Triangle Energy","description":"Triangle Energy is a simple and fun puzzle game. Select three identical gems to make an energy chain for destroying them. On its way the energy chain will also destroy all the gems that have a common point. The gems that you must destroy are always shown at the bottom of the screen. When some gems are destroyed, new gems will be created. Time is against you though you must hurry and destroy the necessary gems as quickly as possible in order to advance to the next level. Once the time is run out, the game is over. The more gems you destroy, the more points you can get.","instructions":"Select three identical gems to make an energy chain for destroying them ","url":"https:\/\/html5.gamemonetize.com\/9irpsew7kmg8hzgaxqia0fttgv0rrx10\/","category":"Puzzle","tags":"Bejeweled, Board, Bubble, Casual, Click, Color, Draw, HTML5, Jewel, Kids, Play","thumb":"https:\/\/img.gamemonetize.com\/9irpsew7kmg8hzgaxqia0fttgv0rrx10\/512x384.jpg","width":"430","height":"600"},{"id":"4433","title":"1010 Fruits Farming","description":"Drop fruits blocks in the board to make one or more rows or columns of 10 fruits.","instructions":"Drag and drop the blocks to the board ","url":"https:\/\/html5.gamemonetize.com\/5a8lup0t3pni5vm3ex5augjavtspt13y\/","category":"Puzzle","tags":"Block, Casino, Clicker, Fruit, Girl, Girls, HTML5, Mobile, Puzzle, Tetris","thumb":"https:\/\/img.gamemonetize.com\/5a8lup0t3pni5vm3ex5augjavtspt13y\/512x384.jpg","width":"800","height":"450"},{"id":"4321","title":"Bubble Shooter Fruits Wheel","description":"This is a special bubble shooter game in which you will find a rotating wheel of fruits. To complete the game you need to collect all the fruits on the wheel. Shoot the fruits towards the wheel to make the group of at least three bubble of the same color. Your points are reducing with the time, So finish the game early to save more points.","instructions":"Use mouse or touch screen to play this game ","url":"https:\/\/html5.gamemonetize.com\/i7iete2kjjxhpbj3e0dq4uwmly6lpkd8\/","category":"Clicker","tags":"Bubble, Bubble Shooter, Clicker, Fruits, Girls, HTML5, Match3, Matching, Mobile, Point And Click, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/i7iete2kjjxhpbj3e0dq4uwmly6lpkd8\/512x384.jpg","width":"800","height":"450"},{"id":"4319","title":"Royal Gems Deluxe","description":"Shuffle and shift the falling group of gems so that they can form a horizontal or a vertical or a diagonal line of similar gems anywhere in the board. Use left, right keys for shifting and up key for shuffling them. Don’t let the board filled till upper row.","instructions":"Use buttons with mouse or touch or keyboard Arrow keys to play this game ","url":"https:\/\/html5.gamemonetize.com\/tpypj0tvkgjgrdboey8jd83ye9lyq2rk\/","category":"Girls","tags":"Collecting, Girls, HTML5, Match 3, Match-3, Matching, Mobile, Puzzle, Tetris","thumb":"https:\/\/img.gamemonetize.com\/tpypj0tvkgjgrdboey8jd83ye9lyq2rk\/512x384.jpg","width":"360","height":"640"},{"id":"4164","title":"Capsicum Match 3","description":"This is classic match 3 game with many new features. Keep matching until all the blocks turn to golden. Use different power-ups and their blend to achieve higher score.","instructions":"Swipe mouse or finger on to adjacent blocks in order to get a linear group of 3 or more similar blocks ","url":"https:\/\/html5.gamemonetize.com\/2vpkuth8pxkwas1720di3h34og1in6vq\/","category":"Girls","tags":"Casual, Clicker, Farm, Girls, HTML5, Match 3, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/2vpkuth8pxkwas1720di3h34og1in6vq\/512x384.jpg","width":"800","height":"450"},{"id":"4208","title":"Covid Crush","description":"Can your health system survive a pandemic? Flattening the curve is the key to helping health systems withstand the pressure of a pandemic.","instructions":"Align matching resources to score points Use your mouse or finger to drag the resources to make rows of at least three Remember the more resources match the bigger the score Use the COVID-19 icon as your wildcard It ","url":"https:\/\/html5.gamemonetize.com\/egs4dmrrff2njloz5id4pso73z4qk06z\/","category":"Puzzle","tags":"Bejeweled, Candy, Fun, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/egs4dmrrff2njloz5id4pso73z4qk06z\/512x384.jpg","width":"1680","height":"1050"},{"id":"4163","title":"Lof Tetriz","description":"Classic falling blocks tetris game where you need to complete a row by filling blocks in order to remove blocks.","instructions":"Use left right and down keys to move the blocks Use up key to rotate the blocks Alternatively you can tap or click buttons to do the same Your target is to fit the blocks to make a row of blocks ","url":"https:\/\/html5.gamemonetize.com\/yw8pbo8u5zugvdnsvw00231t47fam6rk\/","category":"Puzzle","tags":"Block, Casual, Fun, HTML5, Mobile, Tetris","thumb":"https:\/\/img.gamemonetize.com\/yw8pbo8u5zugvdnsvw00231t47fam6rk\/512x384.jpg","width":"360","height":"640"},{"id":"3975","title":"Frogs Matching","description":"Slide a row of candies horizontally or vertically to make a horizontal or vertical row of 3 or more similar frogs. Use mouse or finger tip to slide the rows. Try and see how many levels you can complete in this time bound game.","instructions":"Use mouse or finger tip to slide the block rows and columns ","url":"https:\/\/html5.gamemonetize.com\/kivdvwegg2uhkrd8b5shqtezds5v332n\/","category":"Girls","tags":"Clicker, Fun, Girls, HTML5, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/kivdvwegg2uhkrd8b5shqtezds5v332n\/512x384.jpg","width":"800","height":"450"},{"id":"4000","title":"Brix and Blox","description":"Match blocks with bricks in table. Gather points open new levels","instructions":"Control with Mouse ","url":"https:\/\/html5.gamemonetize.com\/zg22mjkqutz27hpc417heg50gtbd8sz8\/","category":"Puzzle","tags":"1 Player, 2D, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/zg22mjkqutz27hpc417heg50gtbd8sz8\/512x384.jpg","width":"1920","height":"1080"},{"id":"3973","title":"Bubble Shooter Golden Football","description":"Bubble Shooter Golden Football is a classical bubble shooter game in which you need to collect all the Golden Footballs by eliminating the other balls. Aim and release the ball in order to combine it with other similar balls. Shoot the ball on the bomb to eliminate all the neighboring balls.","instructions":"Use mouse or touch to control the game Shoot the ball towards the similar balls or towards the bombs ","url":"https:\/\/html5.gamemonetize.com\/l42fv2zc6gnau36kvgnz3yvrdo0b74kt\/","category":"Boys","tags":"Bubble, Bubble Shooter, Collecting, Football, HTML5, Mobile, Point And Click, Shooter, Sports","thumb":"https:\/\/img.gamemonetize.com\/l42fv2zc6gnau36kvgnz3yvrdo0b74kt\/512x384.jpg","width":"800","height":"480"},{"id":"3900","title":"Corona Crush Saga","description":"Corona Crash Saga, do you want to destroy these bad viruses that affect the whole world? To get the highest score and destroy the most viruses, you have to make the same viruses in a series of three or more pieces. Do not think too much, time is running out, be quick and delete viruses from the earth.","instructions":"Corona Crash Saga do you want to destroy these bad viruses that affect the whole world To get the highest score and destroy the most viruses you have to make the same viruses in a series of three or more pieces Do not think too much time is running o","url":"https:\/\/html5.gamemonetize.com\/g4b7wfy4cgmmn3a7r5jeuk6ifxmgyk1f\/","category":"Bejeweled","tags":"HTML5, Kids, Mobile","thumb":"https:\/\/img.gamemonetize.com\/g4b7wfy4cgmmn3a7r5jeuk6ifxmgyk1f\/512x384.jpg","width":"1920","height":"1080"},{"id":"3885","title":"Bubble Shooter Easter","description":"Bubble Shooter Easter is a Classical bubble shooter game with many new items and power ups. Aim and release the Egg in order to combine it with other similar Eggs. Use power-ups to overcome the challenges.","instructions":"Use mouse or touchscreen to play this game ","url":"https:\/\/html5.gamemonetize.com\/zpk81m887ez6j3ipaz7tk5uur953ro9r\/","category":"Clicker","tags":"Bubble, Bubble Shooter, Casual, Collecting, Easter, Girls, Mobile","thumb":"https:\/\/img.gamemonetize.com\/zpk81m887ez6j3ipaz7tk5uur953ro9r\/512x384.jpg","width":"800","height":"480"},{"id":"3840","title":"Easter Match 3","description":"Swap adjacent Easter eggs in order to make a horizontal or vertical row of 3 similar colored egg blocks. To complete a level you need to turn the all of the blocks on the board to bright.","instructions":"Use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/fn39tglqhhqniswk193liasvwttycvwr\/","category":"Puzzle","tags":"Easter, HTML5, Match 3, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/fn39tglqhhqniswk193liasvwttycvwr\/512x384.jpg","width":"800","height":"450"},{"id":"3686","title":"1010 Fish Blocks","description":"Pick and drop sets of fish blocks to complete vertical and horizontal rows. Once you do the complete row or rows will be removed. You're not limited by time only by empty space on the board so make your moves carefully. Simple to play as all you have to do is select one the sets of blocks and drag them to the board. Once you place all three sets you'll be given three more sets of blocks to place. Complete multiple rows at a time to get a higher score.","instructions":"Use mouse or touchscreen to play this game ","url":"https:\/\/html5.gamemonetize.com\/z3zu6qincxcinjw1nx3av0ev4a2otsqs\/","category":"Puzzle","tags":"Block, Fish, Girls, HTML5, Mobile, Puzzle, Skill, Tetris","thumb":"https:\/\/img.gamemonetize.com\/z3zu6qincxcinjw1nx3av0ev4a2otsqs\/512x384.jpg","width":"800","height":"450"},{"id":"3680","title":"Bubble Shooter Planets","description":"Bubble Shooter Planets is a Classical bubble shooter game with many new items and power ups. Aim and release the planet in order to combine it with other similar planets. Use power-ups to overcome the challenges.","instructions":"Use touch device or mouse to play this game ","url":"https:\/\/html5.gamemonetize.com\/durw2kq5f9y2lk7w8cyeyj9ciyui01wd\/","category":"Shooting","tags":"Bubble, Bubble Shooter, HTML5, Matching, Mobile, Planet, Shooter","thumb":"https:\/\/img.gamemonetize.com\/durw2kq5f9y2lk7w8cyeyj9ciyui01wd\/512x384.jpg","width":"800","height":"480"},{"id":"3614","title":"Angry Owls","description":"Click or touch groups of minimum 2 blocks of the same color to erase them. The more blocks you erase, the more points you get. Different power ups will appear at regular interval to boost your points.","instructions":"Click or touch groups of minimum 2 blocks of the same color to erase them The more blocks you erase the more points you get Different power ups will appear at regular interval to boost your points ","url":"https:\/\/html5.gamemonetize.com\/yp7n5bi97andi2pyz959nkmz3xo32h21\/","category":"Puzzle","tags":"Block, HTML5, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/yp7n5bi97andi2pyz959nkmz3xo32h21\/512x384.jpg","width":"800","height":"450"},{"id":"3611","title":"Eggle Shooter Mobile","description":"Eggle Shooter Mobile is a bubble shooter game with all of the classic features along with new power-ups. Keep the bubbles above the danger line to keep playing.","instructions":"Use touch or mouse to play this game To activate a power-up just touch or click it If you want to see what a power-up does just press the power-up and release your touch outside the power-up icon ","url":"https:\/\/html5.gamemonetize.com\/zicxr2evwsro5jbj13w32o0suxrlob5n\/","category":"Girls","tags":"Bubble, Bubble Shooter, Match-3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/zicxr2evwsro5jbj13w32o0suxrlob5n\/512x384.jpg","width":"360","height":"640"},{"id":"3607","title":"Vegetables Match 3","description":"Swap blocks in order to make a group of 3 or more identical flowers adjacent horizontally or vertically. Keep matching till you unlock and clear all the tiles. Use power-ups to speed up the process. There is 36 interesting levels in this game.","instructions":"Use mouse or touchscreen to play this game ","url":"https:\/\/html5.gamemonetize.com\/mtfw1bbjesdpnk0upr7904y42q4tdsc0\/","category":"Puzzle","tags":"Farm, HTML5, Match 3, Match-3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/mtfw1bbjesdpnk0upr7904y42q4tdsc0\/512x384.jpg","width":"800","height":"450"},{"id":"3597","title":"Onnect Pair Matching Puzzle","description":"Find the matching tiles, connect the pairs with up to three lines. Connect the images of chocolates and desserts.","instructions":"Select 2 similar tile to match them and solve the whole board ","url":"https:\/\/html5.gamemonetize.com\/aav13gjxd0nzjnagtau08qbxbml4tmj4\/","category":"Puzzle","tags":"Bejeweled, Color, Coloring, HTML5, Jewel, Jigsaw, Match 3, Matching","thumb":"https:\/\/img.gamemonetize.com\/aav13gjxd0nzjnagtau08qbxbml4tmj4\/512x384.jpg","width":"800","height":"600"},{"id":"3494","title":"Pirates the match 3","description":"Swap and match gems on your journey with pirates through unknown lands and seas in this addictive and exciting match-3 game. Dig treasures, open chests, fight enemies and fulfil other tasks you are given in each level. Combine gems to create mighty ones and then combine these new gems to create even more powerful ones!","instructions":"Swap gems to create rows and columns of at least three Make longer matches to forge mighty new gems Experiment with these new gems and find all possible match combinations ","url":"https:\/\/html5.gamemonetize.com\/r9rjm8hvdtc4o37xm41pzuolphj8r72i\/","category":"Bejeweled","tags":"Casual, HTML5, Jewel, Math, Pirate, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/r9rjm8hvdtc4o37xm41pzuolphj8r72i\/512x384.jpg","width":"600","height":"800"},{"id":"3580","title":"Sea Life Mahjong","description":"Classic Mahjong game with sea creatures and exciting levels. Eliminate identical tiles in pairs in order to collect all tiles.","instructions":"Use mouse or touch screen to play this game ","url":"https:\/\/html5.gamemonetize.com\/k5boxy4igmqpxna8rmjaxhm39k62g7i1\/","category":"Puzzle","tags":"Board, Fish, HTML5, Mahjong, Matching, Mobile, Puzzle, Skill","thumb":"https:\/\/img.gamemonetize.com\/k5boxy4igmqpxna8rmjaxhm39k62g7i1\/512x384.jpg","width":"800","height":"450"},{"id":"3498","title":"Castle Defense","description":"Defend your castle in a relentless battle against hordes of terrifying enemies! Play as a range of characters, including Severidric the wizard and Gendra the princess and stop orcs, trolls, bats and other scary creatures from invading your castle. Along the way collect coins that allow you to buy special power ups, such as magical staffs, fireballs and poison. You’ll need to use all the magical spells in your power to help you suceed in your quest to keep the evil forces away!","instructions":"Defend your castle in a relentless battle against hordes of terrifing enemies Cast your spells destroy the enemies and increase your magical powers The fate of the kingdom depends upon you and your powerful magic ","url":"https:\/\/html5.gamemonetize.com\/8ho6im78j2n2nk4g9dcg23pvxin8op4w\/","category":"Bejeweled","tags":"Action, Battle, Castle, Defense, Fire, Magic, Shooting, Tower Defense","thumb":"https:\/\/img.gamemonetize.com\/8ho6im78j2n2nk4g9dcg23pvxin8op4w\/512x384.jpg","width":"600","height":"800"},{"id":"3517","title":"Teddy Blocks","description":"Click on 2 or more than 2 blocks to eliminate them. To complete a level you need to eliminate all the blocks on the board. Be wise while eliminating blocks because each block need at least one identical neighbor!","instructions":"Use mouse or touch to select the blocks ","url":"https:\/\/html5.gamemonetize.com\/hvzw6w3ol80iy0tpps168sdoka4ng5yx\/","category":"Puzzle","tags":"Block, Girls, HTML5, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/hvzw6w3ol80iy0tpps168sdoka4ng5yx\/512x384.jpg","width":"800","height":"450"},{"id":"3448","title":"Tiny Fish Factory","description":"A Classic match 3 game.","instructions":"use mouse or touch to play this game ","url":"https:\/\/html5.gamemonetize.com\/93q0u03n5092xwah9v1wjsj8d1v06r6f\/","category":"Girls","tags":"Fish, HTML5, Match-3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/93q0u03n5092xwah9v1wjsj8d1v06r6f\/512x384.jpg","width":"800","height":"450"},{"id":"3446","title":"Bubble Shooter Gold Mining","description":"It is a classical bubble shooter game; mine the gold hidden among the bubbles. There will be 60 challenging levels. In each level you will find a different challenge with 'different type of bubbles and power ups'. To complete a level you must mine all the gold pieces appearing among the bubbles. Shoot the bubble on the board to make groups of 3 or more bubbles of the same color. You must complete a level within allowed time. You will get better score if you complete the level early.","instructions":"Use mouse or touchscreen to play this game","url":"https:\/\/html5.gamemonetize.com\/7cxe8rz947ebn1oh0gytpr0muufvrn0z\/","category":"Puzzle","tags":"Bubble, Bubble Shooter, Collecting, Gold, HTML5, Mobile, Shooter","thumb":"https:\/\/img.gamemonetize.com\/7cxe8rz947ebn1oh0gytpr0muufvrn0z\/512x384.jpg","width":"800","height":"480"},{"id":"3449","title":"Treasure Rush","description":"Move the Gems to the blank spaces in order to create a horizontal or vertical row of 5 identical items. To move just tap the item and then tap the location you want it to move. If there is any open path between the item and its destination, it would travel to the new place. Each time when you move a gem and if no match happens, 3 new gems will be added to the board. Don't let the board crowded or it may fill all the places and your spell will be ended.","instructions":"Tap the gem and then the blank tile to move the gem ","url":"https:\/\/html5.gamemonetize.com\/g2je4gidhf20xmbfoof904fu3aq9quy6\/","category":"Puzzle","tags":"Arcade, Block, Board, Collecting, HTML5, Jewel, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/g2je4gidhf20xmbfoof904fu3aq9quy6\/512x384.jpg","width":"800","height":"450"},{"id":"3397","title":"1010 No Danger","description":"'1010 No Danger’ is a unique puzzle game in which you need to eliminate all the blocks with danger sign on it from the board. In order to remove them, you need to fill the row or the column which is containing the danger block. For filling the row or column, pick and drop the available block sets from the left panel.","instructions":"Use mouse or touchscreen to drag and drop block groups ","url":"https:\/\/html5.gamemonetize.com\/3n76ixe5s4xde1je97s2ylxv1ze81e74\/","category":"Puzzle","tags":"Block, HTML5, Jewel, Mobile, Puzzle, Tetris","thumb":"https:\/\/img.gamemonetize.com\/3n76ixe5s4xde1je97s2ylxv1ze81e74\/512x384.jpg","width":"800","height":"450"},{"id":"3396","title":"Stars Chain Matching","description":"Connect similar star blocks using touchscreen or mouse. Make a group of 3 or more, horizontally, vertically or diagonally adjacent stars to make their block's color blue. Make all the blocks' blue to complete the level. Complete all 24 levels to win this game.","instructions":"Use mouse or touchscreen to play this game ","url":"https:\/\/html5.gamemonetize.com\/by26mt3l2aytl30zf04fhf7wawwmzcub\/","category":"Girls","tags":"Collecting, HTML5, Match 3, Matching, Mobile, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/by26mt3l2aytl30zf04fhf7wawwmzcub\/512x384.jpg","width":"800","height":"450"},{"id":"3276","title":"Bubble Shooter Infinite","description":"Bubble Shooter Infinite is a bubble shooter game with all of the classic features along with new power-ups. Keep the bubbles above the danger line to keep playing.","instructions":"Use touch or mouse to play this game To activate a power-up just touch or click it If you want to see what a power-up does just press the power-up and release your touch outside the power-up icon ","url":"https:\/\/html5.gamemonetize.com\/hzj473dg5qtuqiew0dwbwtpyfy7mrg78\/","category":"Clicker","tags":"Bubble, Bubble Shooter, HTML5, Mobile, Shooter","thumb":"https:\/\/img.gamemonetize.com\/hzj473dg5qtuqiew0dwbwtpyfy7mrg78\/512x384.jpg","width":"800","height":"480"},{"id":"3102","title":"Jewel Duel","description":"Not even the oldest ones remember, when their beautiful country, Kartucia, was taken over by two fiery wizards by means of black magic. It is a really long time that Kartucia is immersed in the darkness and every-day suffering inflicted by the servants of the fiery wizards. Legend has it that a hero will come and restore peace in the country. Time is getting short, however! The fiery wizards are about to open the abyss of horror, bringing thousands of demons. Everything would be really lost then. Everybody believes that you are the hero. Do not disappoint them!","instructions":"Click or tap to play the game ","url":"https:\/\/html5.gamemonetize.com\/5l40ue9r6034efr7vvx6rsh7f3xgn8qt\/","category":"Hypercasual","tags":"Game, Games, HTML, HTML5, Magic, Puzzle, Superhero","thumb":"https:\/\/img.gamemonetize.com\/5l40ue9r6034efr7vvx6rsh7f3xgn8qt\/512x384.jpg","width":"800","height":"600"},{"id":"3100","title":"Jewel Aquarium","description":"This ocean is full of rare fish and other sea creatures! Match and combine them to craft exploding ones! It can help you crush through blocks standing in your way. The classic turn-based match-3 arcade with lots of challenging levels and modes awaits you!","instructions":"Swap and match the fish to form a chain of 3 or more of the same color You will be rewarded with explosive power-ups if you match 4 or more ","url":"https:\/\/html5.gamemonetize.com\/utu7niv6jo7j2qqtv1zzne4zx1hq5aa0\/","category":"Bejeweled","tags":"Arcade, Bomb, Fish, Jewel, Logic, Logical, Match 3, Match-3, Match3, Math, Turn","thumb":"https:\/\/img.gamemonetize.com\/utu7niv6jo7j2qqtv1zzne4zx1hq5aa0\/512x384.jpg","width":"600","height":"800"},{"id":"3020","title":"Fish Match Deluxe","description":"Truly Classic Match 3 with 36 Challenging levels and many other new things.","instructions":"Swap blocks in order to make a group of 3 or more identical fish adjacent horizontally or vertically ","url":"https:\/\/html5.gamemonetize.com\/u53biaifo0ebf1pjnmf9qe0gyi60ctq7\/","category":"Puzzle","tags":"Block, Fish, HTML5, Match 3, Match-3, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/u53biaifo0ebf1pjnmf9qe0gyi60ctq7\/512x384.jpg","width":"800","height":"450"},{"id":"2746","title":"Jewel Puzzle Blocks","description":"Do you love the style of the Tetris game? If yes, this game is dedicated to you. Try a new challenge! Play now!","instructions":"Tap or click drag and drop ","url":"https:\/\/html5.gamemonetize.com\/9mf0jytspunlrqh0wxg3ca88lhbff05o\/","category":"Puzzle","tags":"Arcade, Best, Brain, Casual, HTML5, Jewel, Mobile","thumb":"https:\/\/img.gamemonetize.com\/9mf0jytspunlrqh0wxg3ca88lhbff05o\/512x384.jpg","width":"540","height":"960"},{"id":"2426","title":"Treasure Ninja","description":"treasure ninja is puzzle match game","instructions":"click and drag the lines to match jewel","url":"https:\/\/html5.gamemonetize.com\/enbijv1y7m78yar1girmso0x3qj29gxn\/","category":"Hypercasual","tags":"1 Player, 2D, Bejeweled, Casual, Games, HTML5, Hypercasual, Matching, Ninja","thumb":"https:\/\/img.gamemonetize.com\/enbijv1y7m78yar1girmso0x3qj29gxn\/512x384.jpg","width":"496","height":"800"},{"id":"2384","title":"Jelly Friend","description":"Jelly Friend is a matching game, draw lines and match as much jelly","instructions":"click and connect jelly lines and match as much jelly","url":"https:\/\/html5.gamemonetize.com\/7cy59c90ntbr7asjlqi0cydt91omkptr\/","category":"Hypercasual","tags":"1 Player, 2D, Bejeweled, Casual, Collecting, Draw, endless, HTML5, Hypercasual, Jelly, Matching","thumb":"https:\/\/img.gamemonetize.com\/7cy59c90ntbr7asjlqi0cydt91omkptr\/512x384.jpg","width":"496","height":"800"},{"id":"1718","title":"Jewel Christmas","description":"It’s Xmas time and what better way to celebrate than with some explosive matching action! Match three gingerbread men, stockings, trees, candy canes, presents or baubles and watch them explode! With five festive game modes and more challenges along the way this game is a perfect gift for you this Xmas! Expect plenty of jewel busting, exploding match 3 heaven with this cracker of a game!","instructions":"Match any 3 decorations in a line to pop them Line up 4 or more of the same decorations and create Xmas Explosion decorations Match them or try to combine them to create even bigger blasts The more decorations you pop the more points you score ","url":"https:\/\/html5.gamemonetize.com\/is9rk8sdsodp2bvf0f54qn0jy5kahl9z\/","category":"Bejeweled","tags":"Action, Block, Christmas, Decoration, Jewel, Match 3, Match-3, Match3","thumb":"https:\/\/img.gamemonetize.com\/is9rk8sdsodp2bvf0f54qn0jy5kahl9z\/512x384.jpg","width":"600","height":"800"},{"id":"2361","title":"Jelly Sugar Rush","description":"Jelly Sugar Rush is connect match game with colorful and beautiful graphics, collect three or more of the same jelly.","instructions":"click or touch to connect jelly","url":"https:\/\/html5.gamemonetize.com\/favxallz45bkwh61slu34q16ghufjhgz\/","category":"Hypercasual","tags":"1 Player, Bejeweled, Casual, Collecting, Color, Fun, HTML5, Hypercasual, Jelly, Match-3, Match3","thumb":"https:\/\/img.gamemonetize.com\/favxallz45bkwh61slu34q16ghufjhgz\/512x384.jpg","width":"496","height":"800"},{"id":"2372","title":"Sweet Sugar Rush","description":"Sweet Sugar Rush is connect Match game with colorful and beautiful graphics","instructions":"connect and collect more of the same candy bean ","url":"https:\/\/html5.gamemonetize.com\/c4w1qs1es5wnizc5jxs7vim6irqouz16\/","category":"Hypercasual","tags":"2D, Candy, Casual, Color, endless, HTML5, Hypercasual, Match 3, Match-3, Matching","thumb":"https:\/\/img.gamemonetize.com\/c4w1qs1es5wnizc5jxs7vim6irqouz16\/512x384.jpg","width":"496","height":"800"},{"id":"2342","title":"Sea Treasure","description":"sea treasure is a match 3 game, drag and drop items and match them to 3 or more to get a score","instructions":"click and drop match 3 or more item","url":"https:\/\/html5.gamemonetize.com\/gi4w66pbj1dkutfpis3ag5cy85bhyi7e\/","category":"Hypercasual","tags":"1 Player, 2D, Bejeweled, Casual, Fun, Games, HTML5, Hypercasual, Match 3, Match-3, Matching","thumb":"https:\/\/img.gamemonetize.com\/gi4w66pbj1dkutfpis3ag5cy85bhyi7e\/512x384.jpg","width":"720","height":"1280"},{"id":"2235","title":"Candy Match 3","description":"Candy Match 3 is puzzle Match 3 game with colorful and beautiful graphics, collect three or more of the same Jewel.","instructions":"just click and move the same candy to match","url":"https:\/\/html5.gamemonetize.com\/mk5yfb6og0on2kqmirqx4672r61wpzac\/","category":"Hypercasual","tags":"1 Player, 2D, Candy, Casual, Fun, HTML5, Hypercasual, Match-3, Matching","thumb":"https:\/\/img.gamemonetize.com\/mk5yfb6og0on2kqmirqx4672r61wpzac\/512x384.jpg","width":"720","height":"1280"},{"id":"2136","title":"Candy Match Saga","description":"Candy Match Saga is a match 3 game like candy crush game","instructions":"match 3 or more candy to earn score","url":"https:\/\/html5.gamemonetize.com\/4i10763brhdq07kicyzgtp05rx2ci03m\/","category":"Bejeweled","tags":"2D, Bejeweled, Candy, Casual, Fun, HTML5, Hypercasual, Match 3, Match-3, Matching","thumb":"https:\/\/img.gamemonetize.com\/4i10763brhdq07kicyzgtp05rx2ci03m\/512x384.jpg","width":"1920","height":"1080"},{"id":"2071","title":"Bubble Match 3","description":"Bubble Match 3 is puzzle Match 3 game with colorful and beautiful graphics, collect three or more of the same Bubble.","instructions":"match three or more of the same Bubble ","url":"https:\/\/html5.gamemonetize.com\/l0d1ypcqp5pfznsu2f4ky8z74zanaqcv\/","category":"Hypercasual","tags":"2D, Bejeweled, Bubble, Casual, Fun, HTML5, Hypercasual, Match 3","thumb":"https:\/\/img.gamemonetize.com\/l0d1ypcqp5pfznsu2f4ky8z74zanaqcv\/512x384.jpg","width":"720","height":"1280"},{"id":"2057","title":"Magic Fashion World","description":"Different combinations are waiting for you in the magical world of fashion! There are five girls you can dress up. Have fun!","instructions":"Game Controls LEFT CLICK","url":"https:\/\/html5.gamemonetize.com\/gmigjp6xcm7n8munnd0orkby6n9b082h\/","category":"Girls","tags":"Dress Up, Fun, Funny, Game, Girl, Girls, HTML, HTML5, Makeover","thumb":"https:\/\/img.gamemonetize.com\/gmigjp6xcm7n8munnd0orkby6n9b082h\/512x384.jpg","width":"800","height":"600"},{"id":"1970","title":"Christmas Party Girls","description":"We're almost in the new year! We are excited for the new year! Three girls invited to Christmas party. Help the girls choose their clothes. Decorate your tree before choosing clothes. When you're ready for the party, click the camera button and immortalize this moment. Have fun!","instructions":"Game Controls LEFT CLICK","url":"https:\/\/html5.gamemonetize.com\/xo0mf135q89y3gx0g5zyairvf2oezz4x\/","category":"Girls","tags":"1 Player, Barbie, Christmas, Dress Up","thumb":"https:\/\/img.gamemonetize.com\/xo0mf135q89y3gx0g5zyairvf2oezz4x\/512x384.jpg","width":"800","height":"600"},{"id":"1788","title":"Jewel And Santa Claus","description":"Break the jewel-obstacles to help the Santa Claus back to his home. 30 levels to enjoy. Play now! Merry Christmas!","instructions":"Tap Click to break the jewel-obstacles ","url":"https:\/\/html5.gamemonetize.com\/sezgl4hottucvxgld398s7s9u3g6j9yb\/","category":"Bejeweled","tags":"Arcade, Best, Casual, Christmas, Holiday, HTML5, Jewel, Mobile, Physics, Simulation, Simulator","thumb":"https:\/\/img.gamemonetize.com\/sezgl4hottucvxgld398s7s9u3g6j9yb\/512x384.jpg","width":"960","height":"540"},{"id":"1296","title":"Mahjong Flowers","description":"Relax and improve your memory and ability at the same time with the worldwide favourite adaptation of the traditional chinese game Mahjong. Match the correct tiles until you clean the whole game field of the very last tile. Try it as fast as possible to gain a golden star that reflects your perception and skill.","instructions":"Match the same tiles that are free and clean the whole game field Tiles depicting seasons can be matched freely Tiles depicting flowers can be matched freely The faster you clean the gamefield the better score you get ","url":"https:\/\/html5.gamemonetize.com\/o2kdjmcc4q3fzrcjka8665qw6fq4olkc\/","category":"Puzzle","tags":"Game, Games, HTML, HTML5, Mahjong, Puzzle, Relaxation, Solitaire","thumb":"https:\/\/img.gamemonetize.com\/o2kdjmcc4q3fzrcjka8665qw6fq4olkc\/512x384.jpg","width":"800","height":"600"},{"id":"1291","title":"Jewel Pop","description":"Get ready to match and pop some colourful balloons! Crush through blocks and other obstacles standing in your way. The classic turn based match-3 arcade with lots of challenging levels awaits you!","instructions":"Aim Swap and match colourful balloons to form chains of 3 or more of the same colour You will be rewarded with explosive power-ups if you match 4 or more ","url":"https:\/\/html5.gamemonetize.com\/67u3mkrfs6fd5c3mjg2htccbzkkirltx\/","category":"Bejeweled","tags":"Arcade, Ballon, Bomb, Jewel, Logic, Logical, Match 3, Match-3, Match3, Turn","thumb":"https:\/\/img.gamemonetize.com\/67u3mkrfs6fd5c3mjg2htccbzkkirltx\/512x384.jpg","width":"600","height":"800"},{"id":"1292","title":"Jewel Magic Xmas","description":"Already in Christmas mood? The classic turn based triplet matching arcade with Christmas decorations awaits you! Match triplets while solving puzzles in lots of different challenging levels. Also you can spin the lucky wheel daily to get boosters to help you. Have a jolly time! Merry matching Christmas with jolly jewels!","instructions":"Aim Swap and match colourful Christmas decorations to form chains of 3 or more of the same colour You will be rewarded with explosive power-ups if you match 4 or more ","url":"https:\/\/html5.gamemonetize.com\/qab5o8hs56u4uytktnjzs991p42opqog\/","category":"Puzzle","tags":"Arcade, Bomb, Christmas, Cute, Game, Games, HTML, HTML5, Jewel, Logic, Logical, Math, Turn","thumb":"https:\/\/img.gamemonetize.com\/qab5o8hs56u4uytktnjzs991p42opqog\/512x384.jpg","width":"800","height":"600"},{"id":"985","title":"Woodventure","description":"Take a weekend trip through forest full of cute animals in this classic mahjong connect game. Mahjong connect games have simple rule: two tiles can be connected if path between them has maximum of two turns. Your target is to clear whole board. During game you can use three types of bonuses: - hint: will show you one of next possible match, - bomb: will blast random pair on board, - reshuffle: will reshuffle all tiles on board","instructions":"Click two tiles with the same pictures to match Path between them can have maximum of two turns ","url":"https:\/\/html5.gamemonetize.com\/dvy8mz7xrfrsxrc0ryzvqua2tggcb3eo\/","category":"Puzzle","tags":"1 Player, Board, HTML, HTML5, Mahjong","thumb":"https:\/\/img.gamemonetize.com\/dvy8mz7xrfrsxrc0ryzvqua2tggcb3eo\/512x384.jpg","width":"800","height":"600"},{"id":"986","title":"Flat Jewels Match 3","description":"Flat Jewels Match 3 is classic match 3 game in modern flat design. Enjoy well known game mechanics in this simple yet addictive version. Select either Levels mode or Time Attack gameplay mode. In Levels mode you will go through 150 levels fulfilling simple tasks. In Time Attack mode you will aim to reach highest possible score in limited time.","instructions":"Swap gems to create rows and columns of at least three ","url":"https:\/\/html5.gamemonetize.com\/c5i3l9vi08js7ioydz06fgjqkxfiad3m\/","category":"Puzzle","tags":"Casual, Jewel, Match 3, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/c5i3l9vi08js7ioydz06fgjqkxfiad3m\/512x384.jpg","width":"600","height":"800"},{"id":"1222","title":"Sea Treasure Match 3","description":"Sea Treasure Match 3 is an online game that you can play for free. In the game Sea Treasure Match 3 you do this, incidentally solving a puzzle. Create lines of three or more identical shells, sea stars and other elements to accomplish the task set on the level. Time is limited.","instructions":"Use mouse or tap to screen ","url":"https:\/\/html5.gamemonetize.com\/lv6xalk0mqrnnqff99f9sdxb1l8o9mkv\/","category":"Puzzle","tags":"Fun, HTML5, Kids, Match 3, Match-3, Match3, Skill","thumb":"https:\/\/img.gamemonetize.com\/lv6xalk0mqrnnqff99f9sdxb1l8o9mkv\/512x384.jpg","width":"450","height":"800"},{"id":"745","title":"Gummy Blocks Evolution","description":"Drop the cubes to create or destroy full lines on the screen, both vertical and horizontal. Get great power-up destroying 2 or more lines at the same time!","instructions":"Drag and drop pieces in the grid to clear rows or columns of blocks ","url":"https:\/\/html5.gamemonetize.com\/v687jtx9x8wbov754bhkwd14e3wehu6c\/","category":"Puzzle","tags":"Arcade, Color, Jelly, Matching","thumb":"https:\/\/img.gamemonetize.com\/v687jtx9x8wbov754bhkwd14e3wehu6c\/512x384.jpg","width":"1920","height":"1080"},{"id":"604","title":"Bird Chain","description":"Playing in the Jungle of colourful birds. Link and match the bird with the longest chain and highest score.","instructions":"Mouse - Left-click and drag Touch-screen - Tap and drag","url":"https:\/\/html5.gamemonetize.com\/bx7r1nfa23ywowvohskmley79igndd0o\/","category":"Puzzle","tags":"Bejeweled, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/bx7r1nfa23ywowvohskmley79igndd0o\/512x384.jpg","width":"640","height":"1020"},{"id":"603","title":"Cubic Planet","description":"An endless colourful puzzle. Match the colour and reach the highest score from the entire planet.","instructions":"Mouse - Left-click Touch-screen - Tap","url":"https:\/\/html5.gamemonetize.com\/oug2dzppqje97t76fx4po7kulsbdr4xf\/","category":"Puzzle","tags":"Bejeweled, endless, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/oug2dzppqje97t76fx4po7kulsbdr4xf\/512x384.jpg","width":"640","height":"1020"},{"id":"424","title":"Connect The Gems","description":"Connect pairs of matching gems by creating a path between them.","instructions":"Click Tap and drag to connect the gems ","url":"https:\/\/html5.gamemonetize.com\/b00ak3z6pkj9b6dxwkqvobacjb8do4v0\/","category":"Puzzle","tags":"Arcade, Best, Brain, Casual, Hypercasual, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/b00ak3z6pkj9b6dxwkqvobacjb8do4v0\/512x384.jpg","width":"540","height":"960"},{"id":"393","title":"Desert Rush","description":"Desert Rush is a typical arcade matching game. Your goal is to connect the dots. Three animals surviving their way out from their hunters. Master Chain reactions Bigger the chain stronger the attack. A chain comprising of 12+ gems will yield a surprise Ariel attack. Unique game fun to play, epic adventure. There are about 30+ unique levels for you to challenge yourself. Bosses change with every stage and difficulty becomes more fun after clearing each level.","instructions":"Connect Gems to win The Goal of the Game is to have the Hero reach the flag In order to move the horse forward you need to create a chain of 3 or more poisonous mushrooms but they also deplete your life Bigger the chain - stronger the attack A","url":"https:\/\/html5.gamemonetize.com\/zrrzl1932zgh5phfqaq33axx6tv3pi8p\/","category":"Bejeweled","tags":"Animal, Arcade, Bejeweled, Casual, HTML5, Hypercasual, Match 3, Matching","thumb":"https:\/\/img.gamemonetize.com\/zrrzl1932zgh5phfqaq33axx6tv3pi8p\/512x384.jpg","width":"1000","height":"625"},{"id":"170","title":"EG Smiles","description":"The goal is to crushes all the smiles.. except the red one! So simple! Touch or click as fast as you can. Ecaps Games with tons of games for all ages and bringing fun to player Play free online games Have fun!","instructions":"Mouse or Touch","url":"https:\/\/html5.gamemonetize.com\/odnzqiijmnu2ibmdnditjw1n8jg4s62g\/","category":"Bejeweled","tags":"Adventure, Arcade, Bejeweled, Match-3, Match3, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/odnzqiijmnu2ibmdnditjw1n8jg4s62g\/512x384.jpg","width":"800","height":"600"}]