[{"id":"66452","title":"College Basketball Games Today ","description":"College Basketball Games Today is the ultimate arcade-style college basketball game for fans who love fast-paced sports action! Play solo or challenge a friend in the exciting 2-player basketball mode. With fun cartoon graphics and characters inspired by legendary basketball players, this game offers a thrilling mix of dunks, 3-pointers, and buzzer-beaters. Perfect for quick matches or full tournaments, its the ideal basketball game for kids and adults alike. Whether playing a quick match or climbing the ranks, College Basketball Games Today brings classic basketball arcade gameplay with a modern twist. Get ready to hit the court,","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/red1ovg6fjny2ulquxvt4y3ah0xby91y\/","category":"Sports","tags":"Basketball","thumb":"https:\/\/img.gamemonetize.com\/red1ovg6fjny2ulquxvt4y3ah0xby91y\/512x384.jpg","width":"800","height":"600"},{"id":"63807","title":"Penalty Shooters","description":"Step onto the field and play football with your favorite cartoon stars in this action-packed, fun-filled game! Experience thrilling matches, show off your skills, and compete against other characters in exciting challenges. Whether you&rsquo;re scoring goals, making incredible passes, or defending your side, Football Stars offers endless entertainment for football fans of all ages. Join the fun and become a legend on the pitch!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ikh1qxnldwl6x7lc8xapp1src26tbdtj\/","category":"Sports","tags":"Cartoon, Football, Kids, Mobile, Soccer","thumb":"https:\/\/img.gamemonetize.com\/ikh1qxnldwl6x7lc8xapp1src26tbdtj\/512x384.jpg","width":"1280","height":"720"},{"id":"59707","title":"Bubblehead Ball","description":"Are you a guy who is a talented with skills and speed? If yes, lets score. Bubblehead Ball is a thrilling and fast-paced football game where you can challenge your opponents and show your abilities. One more thing, all of our characters in game are not in football world. 1. Easy to control. 2. Funny characters. 3. Fantastic art. 4. Easy UX UI to access. Lets play and find out who they are.","instructions":"Using AD to move left or right W to jump J and K for taking shot ","url":"https:\/\/html5.gamemonetize.com\/ysbytklgjo3e7env48fjrkw9g44409wb\/","category":"Soccer","tags":"1 Player, Sports","thumb":"https:\/\/img.gamemonetize.com\/ysbytklgjo3e7env48fjrkw9g44409wb\/512x384.jpg","width":"800","height":"600"},{"id":"63028","title":"Tank Soccer Battle 1 2 3 4 Player","description":"Are you ready for a tank battle with your friends? A tank battle with a soccer ball! Bring your friends and fight with tanks.Fill up your tanks&rsquo; ammunition and blow up all your friends&rsquo; tanks. While blowing up your friends&rsquo; tanks, don&rsquo;t forget to shoot the soccer ball. The player who gets the soccer ball to the goal wins. You need to score a goal to win. Team up with your friend in a 2vs2 game and work together to score a goal.","instructions":" Green Tank Use WASD to move and Q to fire Blue Tank Use Arrow Keys to move and P to fire Yellow Tank Use UHJK to move and M to fire Red Tank Use FCVB to move and N to fire","url":"https:\/\/html5.gamemonetize.com\/cb3avofz0w2mb5dfykhoq88540ae7f0a\/","category":"Soccer","tags":"2 Player, 2 Player Games, 2D, Action, Arcade, attack, Casual, Tank, Tanks","thumb":"https:\/\/img.gamemonetize.com\/cb3avofz0w2mb5dfykhoq88540ae7f0a\/512x384.jpg","width":"800","height":"600"},{"id":"54449","title":"Euro Freekick Frenzy","description":"Get ready to experience the ultimate thrill of free-kick frenzy in Euro Freekick Frenzy! Put your precision and timing to the test in this high-intensity penalty-kick based soccer game with a twist. In this adrenaline-fueled competition, scoring early goals is key as they hold higher value than goals scored later in the game. With precise control over your target using a combination of horizontal and vertical direction controls fixed by pressing SPACE, every kick requires skill and finesse. Can you master the art of the perfect free-kick and lead your team to victory?","instructions":"Press SPACE to aim ","url":"https:\/\/html5.gamemonetize.com\/xw0lx0mol959ec8vy6mj5mg06y8h2f20\/","category":"Soccer","tags":"Best Games, Football, Skills, Soccer","thumb":"https:\/\/img.gamemonetize.com\/xw0lx0mol959ec8vy6mj5mg06y8h2f20\/512x384.jpg","width":"800","height":"600"},{"id":"58521","title":"Whack e m All","description":"Hit as many moles as possible before time runs out. Get the Super Hammer Power-up to double your points! The game is usable both in Portrait and Landscape Mode, try it now! !","instructions":"Click your left mouse button or tap on the screen to hit moles which pop up","url":"https:\/\/html5.gamemonetize.com\/1gxq0m411o21q1dzqyl6fwvz1mgwxazk\/","category":"Soccer","tags":"Animal, Arcade, Crazy, Fun, Funny","thumb":"https:\/\/img.gamemonetize.com\/1gxq0m411o21q1dzqyl6fwvz1mgwxazk\/512x384.jpg","width":"800","height":"600"},{"id":"58192","title":"Bunny Goal","description":"Are you ready to kick, bounce, and score? Bunny Goal combines the thrill of soccer with the fast-paced fun of pinball, creating a unique game that&rsquo;s perfect for all ages! Join our adorable bunny character on a journey to become a soccer superstar. Each level is packed with vibrant environments, challenging obstacles, and dynamic pinball action that requires quick reflexes and sharp strategy. Whether you&rsquo;re looking for a quick fun game to pass the time or aiming to beat every level and set a high score, Bunny Goal has something for everyone. Are you ready to take on the pinball soccer challenge and lead the bunny to victory?","instructions":"Desktop Click hold and drag the mouse to aim the ball in the direction you want to shoot Release the mouse to launch the ball Mobile Simply tap and hold on the screen drag in the direction you want to aim and release to launch the ball ","url":"https:\/\/html5.gamemonetize.com\/mnqj10l3wzrla0pcc7jdw7lqo2wbwiq9\/","category":"Sports","tags":"Casual, Football, html5 games, NapTech Games, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/mnqj10l3wzrla0pcc7jdw7lqo2wbwiq9\/512x384.jpg","width":"1280","height":"720"},{"id":"57448","title":"Footy Frenzy","description":"Step onto the pitch with Footy Frenzy, the ultimate football gaming experience that brings the excitement of the beautiful game to your fingertips! Dive into fast-paced matches, strategize your plays, and score stunning goals. Whether youre playing solo, competing against friends, or taking on opponents from around the world, Footy Frenzy offers immersive gameplay, realistic graphics, and smooth controls that will keep you on the edge of your seat. Get ready to experience the frenzy of football like never before!","instructions":"Desktop Press the left button of the mouse to move up and down Mobile click the up and down button to move caharcter ","url":"https:\/\/html5.gamemonetize.com\/p90xlik2d70zhis3djsoifasq3ytfxjw\/","category":"Sports","tags":"Football, NapTech Games, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/p90xlik2d70zhis3djsoifasq3ytfxjw\/512x384.jpg","width":"1280","height":"720"},{"id":"56058","title":"FLOORLAND CREATOR","description":"The void is a game where you manage the cards of famous players, you can win prizes from the game, join now and play to win incredible rewards","instructions":"Analog mobile click button","url":"https:\/\/html5.gamemonetize.com\/suba12vwfb7y6adfy4dbtxmef0sekzl2\/","category":"Soccer","tags":".io, .io Games, 1 Player, 2D, Card, Football, Letters, Sport","thumb":"https:\/\/img.gamemonetize.com\/suba12vwfb7y6adfy4dbtxmef0sekzl2\/512x384.jpg","width":"1020","height":"1920"},{"id":"56048","title":"Goal Dot 3D","description":"Welcome to Goal Dot 3D Soccer Game! Aim and release to shoot the ball into the grid to fill the hole with 2 or more Green Dots horizontally or vertically. You play against another player and must complete the mission before your opponent to win and unlock the next level. Can you do it?","instructions":"Tap or mouse click to play ","url":"https:\/\/html5.gamemonetize.com\/ofunjjov725sve0gi4rdvdwfism6a8ul\/","category":"Sports","tags":"3D Games, Hypercasual, Soccer, unity games for your website, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/ofunjjov725sve0gi4rdvdwfism6a8ul\/512x384.jpg","width":"720","height":"1280"},{"id":"56002","title":"Ultimate Goal","description":"Ultimate Goal is an exciting and engaging table football game that brings the fun and thrill of foosball right to your fingertips. Navigate your team through various challenging levels, strategize your moves, and score goals to become the ultimate champion. With vibrant graphics, intuitive controls, and endless gameplay possibilities, Ultimate Goal is perfect for players of all ages.","instructions":"Start the Game Tap the play button to begin Control Your Team Use the on-screen controls to move your players up and down Score Goals Strategize your moves to score goals against your opponent Progress Through Levels Complete levels by scoring the ","url":"https:\/\/html5.gamemonetize.com\/zic3isd7x8bpydstdu7r0m6selizpe45\/","category":"Sports","tags":"1 Player, 2 Player, 2 Player Games, 2048, 3D Games, Adult, Android, battleship, Best Games, Classic","thumb":"https:\/\/img.gamemonetize.com\/zic3isd7x8bpydstdu7r0m6selizpe45\/512x384.jpg","width":"1280","height":"720"},{"id":"55980","title":"Goal Arena 3D","description":"Welcome to Goal Arena 3D Online Soccer Game! Swipe left and right to control your goalkeeper and prevent the ball from passing through the goalpost. You have 3 chances, so score goals against the 3 other opponents and guard your post very well to win.","instructions":"Tap or mouse click to play ","url":"https:\/\/html5.gamemonetize.com\/n6rox98hlgh30vr4xqr2tjqkrstmdgrf\/","category":"Soccer","tags":"3D, 3D Games, Football, Hypercasual, Soccer, Sport, Sports, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/n6rox98hlgh30vr4xqr2tjqkrstmdgrf\/512x384.jpg","width":"350","height":"600"},{"id":"55394","title":"Euro Champ 2024","description":"Awesome 3D Soccer actionthat will keep your going for a while. Can you go through all 4 elimination games and became the latest Euro Champ? You will score from free kicks and volleys as the ball is passed to you from the side","instructions":"Mouse to move position mouse lower around players legs to shoot higher On mobiles use touch controls to move and tap the boot ball on the right side to kick ","url":"https:\/\/html5.gamemonetize.com\/oid03ewux4ogtr5g48wqjh9x0k6j4uji\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/oid03ewux4ogtr5g48wqjh9x0k6j4uji\/512x384.jpg","width":"960","height":"540"},{"id":"54901","title":"Volley Master 2024","description":"Score amazing goals from volleys closer to the goal and all the way from beyond 50 meters and more. 3D soccer action.Fire off some rocket like kicks or set power to low to lob over the unsuspecting keeper who ventured to far out.","instructions":"Mouse to move player click to kick On mobiles left right control and tap to kick Use low power for lobs if keeper comes out or full power to smash it past him","url":"https:\/\/html5.gamemonetize.com\/67p1q8hxgfw75lvy8rx9beqhtk02lk8h\/","category":"Sports","tags":"Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/67p1q8hxgfw75lvy8rx9beqhtk02lk8h\/512x384.jpg","width":"960","height":"540"},{"id":"54745","title":"Flick n Goal","description":"Get ready for an electrifying soccer experience with Flick n Goal! Choose your team from a diverse roster of countries and dive into the action-packed world of international football. Strategically place your players, set your formation, and unleash your tactical prowess as you compete in thrilling matches. Whether youre a seasoned soccer aficionado or a casual gamer, Flick n Goal offers excitement for all levels of players. With intuitive controls and dynamic gameplay, every match is a pulse-pounding adventure from kickoff to final whistle.","instructions":"Mouse drag and release to hit ball and move players ","url":"https:\/\/html5.gamemonetize.com\/wn3blhqcrzynyt126r2iltb3zciimksm\/","category":"Soccer","tags":"Casual, Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/wn3blhqcrzynyt126r2iltb3zciimksm\/512x384.jpg","width":"800","height":"600"},{"id":"53825","title":"Pinball Football Champion","description":"Lace up and unleash your gridiron skills in Pinball Football Champion! This action-packed mobile game combines the classic thrills of pinball with the heart-pounding intensity of football. Flick the players to launch the ball, strategically maneuver it through bumpers and pins, and rack up points on the scoreboard. Can you master the field, score big, and become the Pinball Football Champion? Download now and see if you have the skills to dominate!","instructions":"Click to send football click to get it right into the goal ","url":"https:\/\/html5.gamemonetize.com\/fjyu89wcncn7ancvltwpyjul95lhgwft\/","category":"Soccer","tags":"1 Player, Best Games, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/fjyu89wcncn7ancvltwpyjul95lhgwft\/512x384.jpg","width":"720","height":"1280"},{"id":"54284","title":"Football King","description":"Football King offers a highly engaging gameplay experience where players can select their character and customize their teams flag, adding a personal touch to the competition. You can tackle the game solo in an exhilarating single-player tournament mode, where you&rsquo;ll challenge sophisticated AI teams that adapt to your gameplay style. Website dev <a href='https:\/\/unblocked-games.s3.amazonaws.com\/index.html'>https:\/\/unblocked-games.s3.amazonaws.com\/index.html<\/a>","instructions":"Arrow keys to move space to shoot B for power shot ","url":"https:\/\/html5.gamemonetize.com\/2ty9rfatt20f1974ewxkm0g3lk1ndtyt\/","category":"Sports","tags":"2D, Football, free html5 games for your website, FreezeNova, Online, onlinegames io, Sport","thumb":"https:\/\/img.gamemonetize.com\/2ty9rfatt20f1974ewxkm0g3lk1ndtyt\/512x384.jpg","width":"960","height":"540"},{"id":"51512","title":"Super Goalkeeper","description":"In the Super Goalkeeper game, choose your favorite team and win the matches by conceding fewer goals. The cup should be yours. Have a good time!","instructions":"You can play by moving the mouse left and right ","url":"https:\/\/html5.gamemonetize.com\/8mk45qg67ruaajuymy1g35wxa9czm8v6\/","category":"Sports","tags":"Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/8mk45qg67ruaajuymy1g35wxa9czm8v6\/512x384.jpg","width":"800","height":"600"},{"id":"53458","title":"CapsuleMatch","description":"CapsuleMatch is a fast-paced and addictive two-player game. Players control capsules on the left and right sides, attempting to score goals in their opponents net. In the two-player mode, each player controls their respective capsule and must react quickly to the gameplay. The objective of the game is to increase your score by scoring goals in the opponents net. The first player to reach 5 points wins the game. CapsuleMatch offers various superpowers to provide players with a fun and competitive experience. These powers can increase players speed, boost the balls speed, provide defensive shields, or enlarge the players size.","instructions":"Click on the Play button to initiate the game Tap on the left side or press the E key to control the left player Tap on the right side or press the O key to control the right player Your goal is to score by getting the ball into your opponents goal Th","url":"https:\/\/html5.gamemonetize.com\/0yzibjxa0j3w8rhdsrgxb17umd8r0dev\/","category":"Soccer","tags":"2 Player, Matching, Mobile","thumb":"https:\/\/img.gamemonetize.com\/0yzibjxa0j3w8rhdsrgxb17umd8r0dev\/512x384.jpg","width":"1920","height":"1080"},{"id":"52208","title":"Shaolin Soccer","description":"It is an engaging puzzle game where your objective is to descend safely. It appears straightforward at first glance but offers profound depth. Navigate through numerous levels, honing your intellect while enjoying the journey. Website Developer <a href='https:\/\/www.bestcrazygames.com\/home\/keyword\/stickman'>https:\/\/www.bestcrazygames.com\/home\/keyword\/stickman<\/a>","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/1re3k4h9vkknttyops13remtr23af95n\/","category":"Soccer","tags":"Android, Ball, Football, HTML5, iPad, iPhone, Mobile, Soccer","thumb":"https:\/\/img.gamemonetize.com\/1re3k4h9vkknttyops13remtr23af95n\/512x384.jpg","width":"800","height":"600"},{"id":"52181","title":"Asian Cup Soccer","description":"Asian Cup soccer\/football is here and here is your chance to participate with your favorite team. Go from the round of 16 to the finals and try to win that cup. If you can you can also win other trophies such as the golden boot","instructions":"Tap or click to set direction height and curve of your kicks When defending click on keeper gloves when they appear to jump in that direction","url":"https:\/\/html5.gamemonetize.com\/to276chdeobtg4yl7zdtc64utvglsqi8\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/to276chdeobtg4yl7zdtc64utvglsqi8\/512x384.jpg","width":"960","height":"540"},{"id":"51409","title":"Head Shot Super League","description":"You can play friendly match or league match in this game. Heading - Super League: Control the ball with your head, beat the opponent! Compete in leagues and become champions.","instructions":"You can play arrow and space button ","url":"https:\/\/html5.gamemonetize.com\/w56iu6sa21fl5h44st8q76x1yzrw5ekp\/","category":"Sports","tags":"Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/w56iu6sa21fl5h44st8q76x1yzrw5ekp\/512x384.jpg","width":"800","height":"600"},{"id":"50029","title":"Halloween Soccer","description":"What could be better than a fun challenging game where Halloween gets mixed with soccer and the most famous soccer players around. 10 fun levels with surprises and challenges. Have fun and earn trophies by completing challenges.","instructions":"Finger or mouse to swipe and shoot Finger or mouse to move player on pumpkin juggling levels","url":"https:\/\/html5.gamemonetize.com\/qtfxbvlvbo4joy3ljjiu5bp80km2ydem\/","category":"Sports","tags":"Halloween, Soccer","thumb":"https:\/\/img.gamemonetize.com\/qtfxbvlvbo4joy3ljjiu5bp80km2ydem\/512x384.jpg","width":"500","height":"800"},{"id":"49940","title":"Mini Soccer","description":"Mini Soccer is a fast-paced sports football game where you can challenge your friends or play with the CPU. Choose your favorite player and play against the CPU for the tournament or be the best of your friends in the versus mode. With players to choose from the best teams of the world, 3 game fields, and all the arcade fun in a single game.","instructions":"- When playing against the computer Right and left arrow keys right left move Up arrow key jump Z and X keys hit - When playing in the with a friend mode Player 1 Arrows move Z X hit the ball Player 2 WSAD move 1 2 hit the ball - O","url":"https:\/\/html5.gamemonetize.com\/or51fhgaqtlb2fldz8opctagkirnp0ys\/","category":"Sports","tags":"2 Player, 2 Player Games, 2D, Soccer","thumb":"https:\/\/img.gamemonetize.com\/or51fhgaqtlb2fldz8opctagkirnp0ys\/512x384.jpg","width":"1280","height":"720"},{"id":"49015","title":"1 On 1 Soccer","description":"1 on 1 Soccer is a simple soccer game that can be played with 1 or 2 players. Choose your country and play against a friend or the computer in a fast-paced match! Score as many goals as you can against your opponent before the time runs out!","instructions":"Player 1 arrow keys - Player 2 WASD","url":"https:\/\/html5.gamemonetize.com\/9mj80xfti37ayutvlybw5seqgllgs690\/","category":"Sports","tags":"1 Player, 2 Player, 2 Player Games, Football, Game, Games, HTML, HTML5, Online, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/9mj80xfti37ayutvlybw5seqgllgs690\/512x384.jpg","width":"800","height":"580"},{"id":"49638","title":"Soccer Hero","description":"A single player football game with multiple characters that can be developed and upgraded, using buttons to move and kick the ball.","instructions":"Press the button to control the characters movement and kicking method ","url":"https:\/\/html5.gamemonetize.com\/cl9ik2kgtk7kxt89jl9hr1dbzfxmv7k5\/","category":"Soccer","tags":"1 Player, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/cl9ik2kgtk7kxt89jl9hr1dbzfxmv7k5\/512x384.jpg","width":"1280","height":"720"},{"id":"48631","title":"Grimace Ball Jumpling","description":"Help Grimace to not let the ball fall! How many times you can juggle these two soccer balls? How to play: - Tap left side of screen to kick the left football - Tap right side of screen to kick the right football Warning: This game create dependence! :-)","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/2eeizpsva0s0kdpw0zf5trn08s98fsva\/","category":"Soccer","tags":"Arcade, Football, Grimace, Grimace Shake, HTML, HTML5, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/2eeizpsva0s0kdpw0zf5trn08s98fsva\/512x384.jpg","width":"600","height":"1024"},{"id":"46420","title":"Run and Shoot: GOAL!","description":"Run without hitting obstacles and opposing team players. collect as much blue power as you can and hit the ball harder. Then direct the ball and try to pass the goalkeeper. You can score your goal and move on to the next level! According to the power you collect, the height of the ball increases and the probability of the goalkeeper to save decreases. If you want, you can transfer between halftime and change your character. hitting sticks loses 1 power. hitting obstacles lose 10 power","instructions":"Player movement - Left arrow key for move left - Right arrow key for move right - Spacebar for Jump Ball movement - Left and Right arrow keys - If you can score a goal you pass the level ","url":"https:\/\/html5.gamemonetize.com\/sfgt6xl9hugkmihr98y1jzma6t7knvl9\/","category":"Soccer","tags":"1 Player, 3D, 3D Games, Action, Ball, endless, Football, Platform, run, running, Shoot, Soccer","thumb":"https:\/\/img.gamemonetize.com\/sfgt6xl9hugkmihr98y1jzma6t7knvl9\/512x384.jpg","width":"1520","height":"855"},{"id":"48370","title":"Skibidi Toilet Ball Juggling","description":"Help Skibidi Toilet to not let the ball fall! How many times you can juggle these two soccer balls? How to play: - Tap left side of screen to kick the left football - Tap right side of screen to kick the right football Warning: This game create dependence :)","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/4dtfkvch0u66bm4hum60gl4dibqulc19\/","category":"Soccer","tags":"Boy, HTML, Mobile, Skibidi, Skibidi Toilet, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/4dtfkvch0u66bm4hum60gl4dibqulc19\/512x384.jpg","width":"600","height":"1024"},{"id":"48310","title":"Skibidi Toilet Soccer","description":"Skibidi is a great goalkeeper in soccer training! Use your finger to slide goalkeeper to the kicked penalty. As a super goalkeeper you must protect your goal from as much incoming balls as you can. How to Play: - The computer will shoot soccers - Just swipe the screen to control Skibidi Enjoy your soccer game! Become a Skibidi Soccer Goalkeeper Superstar!","instructions":"Mouse click or touch the screen to play ","url":"https:\/\/html5.gamemonetize.com\/sy3abv7l2dkmrmt8ez8s30wsyrrnpodo\/","category":"Soccer","tags":"Arcade, Casual, HTML5, Mobile, Skibidi, Skibidi Toilet, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/sy3abv7l2dkmrmt8ez8s30wsyrrnpodo\/512x384.jpg","width":"768","height":"600"},{"id":"48192","title":"Heads Up Skibidi","description":"Heads Up Skibidi is a head-ball game where one player is the skibidi head and poo picker. The skibidi head wears a blindfold and tries to head the ball into the poo pickers mouth. The poo picker tries to dodge the ball and pick up as much poo as possible.","instructions":"Desktop Use the right click and Drag of the mouse to move objects right and left Mobile Drag the Left and Right screens to move objects ","url":"https:\/\/html5.gamemonetize.com\/06ab0i2mp4ks3ul4iipkhoul1viwah2m\/","category":"Soccer","tags":"1 Player, Arcade, Best Games, Classic, Fun, Game, Games, NapTech Games, Ski, Skibidi, Skibidi Toilet, Spongebob, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/06ab0i2mp4ks3ul4iipkhoul1viwah2m\/512x384.jpg","width":"720","height":"1280"},{"id":"48251","title":"Upin Ipin Sepak Bola","description":"Upin Ipin Sepak Bola Permainan bola sepak yang menyeronokkan. Mampukan anda menewaskan Upin di lapangan sepak bola? Ayoohh kita berseronok sambil bermain game sepak bola upin ipin ini","instructions":"keyboard","url":"https:\/\/html5.gamemonetize.com\/dbc7mw2mns2ii57lkrbexvelvfhz90pz\/","category":"Sports","tags":"Football, Kids, Soccer","thumb":"https:\/\/img.gamemonetize.com\/dbc7mw2mns2ii57lkrbexvelvfhz90pz\/512x384.jpg","width":"800","height":"600"},{"id":"48179","title":"Liga Super Malaysia","description":"Permainan Bola Sepak Liga Super Malaysia Pengalaman Liga Super Malaysia: Terlibatlah dalam dunia Liga Super Malaysia yang terkenal, dengan pasukan-pasukan terbaik dari liga ini. Kawal Pasukan Anda: Gunakan jari anda untuk mengawal pemain-pemain dan mengarahkan laluan mereka untuk menjaringkan gol. Pasukan dan Stadium Terkenal: Mainkan dengan pasukan kegemaran anda di stadium-stadium terkenal dari Liga Super Malaysia. Sertai Turnamen Menarik: Ambil bahagian dalam pelbagai turnamen yang menarik dan tunjukkan kemahiran anda dalam permainan. Mod Latihan Taktikal: Latihlah kemahiran anda dalam mod latihan sebelum berentap dalam pertandingan","instructions":"Guna Tetikus","url":"https:\/\/html5.gamemonetize.com\/cdjjmn1cbil1e0avgn054wv67ukyu2gx\/","category":"Soccer","tags":"Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/cdjjmn1cbil1e0avgn054wv67ukyu2gx\/512x384.jpg","width":"800","height":"600"},{"id":"47973","title":"Womens World Cup 2023","description":"Womens world cup is here and you find yourself in the elimination rounds. Win trophies for your first win, getting to the finals or scoring 20 goals. Of course, the most important one is the world cup trophy. Can you make it to the finals and in it all? Good luck!","instructions":"Mouse click or tap to set direction of your shot again to set height and one more time to set curve of your kick When defending click or tap keeper gloves that appear as your opponent is about to kick","url":"https:\/\/html5.gamemonetize.com\/2xmopvaig70eb5svyq9706xqrkbz4plu\/","category":"Sports","tags":"Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/2xmopvaig70eb5svyq9706xqrkbz4plu\/512x384.jpg","width":"960","height":"540"},{"id":"47635","title":"Messi New Challenge","description":"Messi makes the move to a new Continent and new challenges await. Participate in the excitement and go through numerous goal scoring and skill testing levels and earn trophies too.","instructions":"Mouse or finger to move player during juggling levels swipe to shoot at targets or goal","url":"https:\/\/html5.gamemonetize.com\/8m3ox950lsb3vxarbxdfuwlnftq41i3p\/","category":"Sports","tags":"Football, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/8m3ox950lsb3vxarbxdfuwlnftq41i3p\/512x384.jpg","width":"500","height":"800"},{"id":"47448","title":"Goal Quest","description":"Experience the fusion of sports and puzzle-solving in this captivating 2D soccer ball game. Break through cube stone obstacles by simply touching them, clearing your path to the goal. But it&rsquo;s not just about scoring; you must also collect three stars scattered throughout each level to unlock new challenges. Navigate intricate mazes, utilize physics, and explore visually stunning environments as you strive to become the ultimate soccer ball champion. Are you ready for an adventure filled with excitement, discovery, and a touch of soccer magic?","instructions":"Desktop Explode Cubes with leftmouse button Mobile Touch the screen and pop whatever you want","url":"https:\/\/html5.gamemonetize.com\/4gfskfmycte9r79aaz1umeaj9lmyjkvh\/","category":"Sports","tags":"1 Player, Brain, Football, Fun, Funny, Puzzle, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/4gfskfmycte9r79aaz1umeaj9lmyjkvh\/512x384.jpg","width":"1280","height":"720"},{"id":"47534","title":"Squad Goals: Soccer 3D","description":"Squad Goals is fun and simple 3D soccer game that can quickly turn into a crazy ball brawl! No cards, fouls, or offsides! Slide, tackle, dribble, kick, shoot, and score &ndash; all with just one finger! Whoever scores first wins the match! Rise through the ranks to dominate the game! Key game features: &bull; One-finger on-screen joystick controls, with support for mouse and keyboard &bull; Upgrade character traits to unlock full potential &bull; Level up to rise through the ranks &bull; Shop for cosmetics to customize your character, ball, and stadium &bull; Complete daily quests to earn more coins &bull; Daily and hourly rewards &bull; Play in two modes: ARENA or TEAM vs TEAM","instructions":" bull Touch Mouse TAP CLICK and DRAG to RUN RELEASE to SLIDE SHOOT or PASS bull Keyboard Press arrow keys or WASD to RUN Release arrow keys or press SPACE to SLIDE SHOOT or PASS","url":"https:\/\/html5.gamemonetize.com\/413slo2x1o8km5rs8vb6ikya691zsm78\/","category":"Soccer","tags":"3D, Alien, Android, Animal, Ball, Basketball, Football, Robot, Skill, Soccer, Sport, Sports, Tennis, Zombie","thumb":"https:\/\/img.gamemonetize.com\/413slo2x1o8km5rs8vb6ikya691zsm78\/512x384.jpg","width":"1024","height":"1820"},{"id":"47118","title":"Tiny Football Cup","description":"Become a football legend by winning all the tournaments and matches! Unlock all the leagues and play with 28 different teams. Prove to your friends you are the number one football player. Play and Score! Endless 3 Turnaments Local Multiplayer Mode 28 Teams","instructions":"Play matches and tournaments to win in-game currency and diamonds Control your team and get the ball to enemys goal Have fun with friends in the local multiplayer mode ","url":"https:\/\/html5.gamemonetize.com\/dzitjk45xlzs7cmsqfo6v6vos58y4jc8\/","category":"Sports","tags":"2 Player, 2 Player Games, Football","thumb":"https:\/\/img.gamemonetize.com\/dzitjk45xlzs7cmsqfo6v6vos58y4jc8\/512x384.jpg","width":"800","height":"600"},{"id":"46375","title":"Messi vs Ronaldo KTT","description":"Messi and Ronaldo find themselves in competition on another continent. Play this unique version of Kick Tac Toe, where you play as Messi or Ronaldo against your foe and try to win. You can also play against your friends in 2 player mode","instructions":"Swipe to kick and hit blocks to reveal your teams logo","url":"https:\/\/html5.gamemonetize.com\/l55plwa1pm7lz65c6wmu3bg3yk5aggsn\/","category":"Soccer","tags":"2 Player, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/l55plwa1pm7lz65c6wmu3bg3yk5aggsn\/512x384.jpg","width":"450","height":"800"},{"id":"46984","title":"Legendary Soccer","description":"Legendary Soccer is an exciting and captivating free online game designed specifically for soccer lovers. With the option to play against AI as a single player or compete against your friend in a thrilling match with the 2-player mode, try to win the game. This game is suitable for players of all ages and skill levels. Legendary Soccer is developed for you to have a great time by controlling three soccer players, making amazing passes and scoring goals. Hold your player and pull towards the ball to shoot legendary goals. With its cartoonish graphics, this game appeals to players of all ages and can be played with a friend or against AI.","instructions":"Grab one of the three players and drag the cursor on top of them to the desired destination Release it and the player will move there and Goal Both sides take turns making moves in the game Lets see who will win ","url":"https:\/\/html5.gamemonetize.com\/hg4m7cai1ptybmtkjlnmvavwqw22xhe9\/","category":"Soccer","tags":"2 Player, 2 Player Games, Boy, Boys, Celebrity, Fun, Funny, New, Soccer","thumb":"https:\/\/img.gamemonetize.com\/hg4m7cai1ptybmtkjlnmvavwqw22xhe9\/512x384.jpg","width":"1280","height":"720"},{"id":"46742","title":"Shoot a Goal!","description":"In this game you need to score a goal. Be accurate and hit the ball into the goal! Good luck!","instructions":"Mouse","url":"https:\/\/html5.gamemonetize.com\/v0u43no4eytqdhym63oaw7q1t64mx56b\/","category":"Sports","tags":"Boys, Football, HTML5, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/v0u43no4eytqdhym63oaw7q1t64mx56b\/512x384.jpg","width":"450","height":"800"},{"id":"46518","title":"Endless Car Football Game","description":"Endless Car Football Game is an exhilarating two-player game designed for computer play. Grab a friend and get ready for some intense car football action! Take control of your vehicles using the arrow keys and compete head-to-head on a never-ending football field. The objective is simple: score as many goals as you can against your opponent. Maneuver your car with precision and speed, strategically positioning yourself for the perfect shot. Use your driving skills to outwit your rival and defend your goal with expert timing. Enjoy the excitement and friendly competition of Endless Car Football Game!","instructions":"Player 1 controls the car using the W A S D keys while Player 2 controls their car using the ARROW keys ","url":"https:\/\/html5.gamemonetize.com\/6hqs98lv08y8myw3le04f53ygwdqohr4\/","category":"Soccer","tags":"2 Player, 2 Player Games, 2D, 3D, Arena, Car, Driving, Football, HTML5, Soccer","thumb":"https:\/\/img.gamemonetize.com\/6hqs98lv08y8myw3le04f53ygwdqohr4\/512x384.jpg","width":"854","height":"480"},{"id":"45384","title":"Neymar can play","description":"Neymar may be injured but he can still play. Brasil or PSG Neymar, your choice, get those crutches ready and get on the pitch to score some awesome goals and earn trophies","instructions":"move with mouse or finger left click or lift finger to kick on goal","url":"https:\/\/html5.gamemonetize.com\/0gpxu3prgjpltlbh8mtlc5gvdzrtfu50\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/0gpxu3prgjpltlbh8mtlc5gvdzrtfu50\/512x384.jpg","width":"800","height":"600"},{"id":"44505","title":"Car Football 3D","description":"play soccer with your car and try to score the most goals","instructions":"W Gas S Brake A Left D Right Space handbrake Shift Boost","url":"https:\/\/html5.gamemonetize.com\/fuzrx9k5kj56o9nhlifou6j8uf8r7r2b\/","category":"Soccer","tags":"1 Player, 3D, 3D Games, Car, Cars, Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/fuzrx9k5kj56o9nhlifou6j8uf8r7r2b\/512x384.jpg","width":"1920","height":"1080"},{"id":"38032","title":"Rumble Stars Football","description":"Explosive multiplayer soccer game with crazy action, easy to pick up! Assemble your Rumble Stars team and progress through the leagues in this real-time multiplayer soccer game!","instructions":"Launch your Rumblers onto the field synchronize your timing and create strategic combos to challenge your opponents and score goals Then upgrade your team and climb the world rankings ","url":"https:\/\/html5.gamemonetize.com\/cy67u9altfod8zcvn79a02e6mjvjhui6\/","category":"Soccer","tags":"2 Player Games, Football, Game, Games, Soccer","thumb":"https:\/\/img.gamemonetize.com\/cy67u9altfod8zcvn79a02e6mjvjhui6\/512x384.jpg","width":"800","height":"600"},{"id":"44993","title":"El Clasico","description":"El Clasico, the greatest rivalry in all of sport. Here is your chance to get involved, Choose Real or Barca and win the El Clasico","instructions":"Tap or Click to set direction height and curve of your shot","url":"https:\/\/html5.gamemonetize.com\/yha7c2v8calegde0qdunmgn8zlj9xdf7\/","category":"Sports","tags":"Football, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/yha7c2v8calegde0qdunmgn8zlj9xdf7\/512x384.jpg","width":"960","height":"540"},{"id":"42683","title":"Magic Soccer","description":"Our character, who is trained to move the soccer ball in the magic school, is working to become a successful magician. Our character has to solve some puzzles by guiding the soccer ball. At the end of this hard training, you will be rewarded by your master. He needs help with this challenging training. Solve puzzles by guiding the ball and join the adventure. Try the Magic Soccer game now! Enjoy.","instructions":"Click and drag to play","url":"https:\/\/html5.gamemonetize.com\/axp4ptn6v02qqay6mavnglpxe9gkzr7s\/","category":"Soccer","tags":"3D, Ball, Football, Funny, Hot, Hypercasual, Kids, Magic, Mobile, Puzzle, Skill, Soccer","thumb":"https:\/\/img.gamemonetize.com\/axp4ptn6v02qqay6mavnglpxe9gkzr7s\/512x384.jpg","width":"900","height":"506"},{"id":"42743","title":"Balles","description":"Bubble Shooter is a bubble ball game with exquisite graphics, rich bubble game elements, and interesting origin levels, bringing you a wonderful balloon pop experience. The operation of the bubble ball games is very smooth, and there is no difficulty for you to get started and no time pressure!","instructions":"Tap To Play","url":"https:\/\/html5.gamemonetize.com\/8axqwjb6mbhogm93f0ohglkebf6xhbp2\/","category":"Soccer","tags":"Ball, Ballon, Soccer","thumb":"https:\/\/img.gamemonetize.com\/8axqwjb6mbhogm93f0ohglkebf6xhbp2\/512x384.jpg","width":"800","height":"600"},{"id":"43705","title":"Tap Goal","description":"Use your skills and tap perfectly at the perfect time to dribble and score a goal to pass all the crazy challenging challenges that await you.","instructions":"Mouse","url":"https:\/\/html5.gamemonetize.com\/gmghz6l2waphpn3g1qpvp67a0qoit17s\/","category":"Soccer","tags":"3D, Arcade, Football","thumb":"https:\/\/img.gamemonetize.com\/gmghz6l2waphpn3g1qpvp67a0qoit17s\/512x384.jpg","width":"800","height":"600"},{"id":"44017","title":"Head Soccer 2023 2D","description":"Have you ever played a soccer game before? this is different from all and in this adventure you have to score a goal with your head. Welcome to head ball or head football.The only goal in this game, which you can play both alone and with your friend, is to score a goal. score goals and win the match, all goals are in your hands. Come on, score a goal and win.","instructions":" Single player mode Press arrow keys to move Press the Z and X key to hit the ball Two player mode Player 1 Press WASD to move Press the N and M key to hit the ball Player 2 Press arrow keys to mo","url":"https:\/\/html5.gamemonetize.com\/6t7go4eg9l4nh17kju788jue92g00u4u\/","category":"Soccer","tags":"2 Player, 2 Player Games, 2D, Adventure, Arcade, Funny, Soccer","thumb":"https:\/\/img.gamemonetize.com\/6t7go4eg9l4nh17kju788jue92g00u4u\/512x384.jpg","width":"800","height":"600"},{"id":"42276","title":"Mini Head Basketball","description":"Put on your sneakers, and get ready to go onto the court in this brand new basketball game! Experience basketball like never before, in this fresh and easy to play basketball game.","instructions":"Mouse Controls","url":"https:\/\/html5.gamemonetize.com\/0ehfztq657ya5n3rkrn4jt2b1m42i0z7\/","category":"Sports","tags":"3D, 3D Games, Action, Arcade, Casual, Crafting, Fun, Funny, Hot, Hypercasual, jump, Jumping, Soccer, Sport, Sports, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/0ehfztq657ya5n3rkrn4jt2b1m42i0z7\/512x384.jpg","width":"800","height":"600"},{"id":"41857","title":"Free Kick World Cup 2022","description":"<b>Free Kick World Cup 2022<\/b>, one of the best soccer games 2022. Play digital soccer: Free Kick World Cup 2022 now. Experience realistic free kick offline.<br> <br>One of the best soccer games in 2022 from the developers of Football Craft. If you got tired of uncontrollable free-kick offline games <b>Free Kick World Cup 2022<\/b> is the game that you are looking for. Digital Soccer: free kick 2022 offers you realistic soccer simulation physics and a soccer ball kick system. Prepare your soccer player and get ready for the battle with the world's best soccer teams from 20 major leagues on best of soccer games 2022. Love soccer? Try our real soccer kicks.<br> <br>Practice with free kick offline, random shoots, and hit target modes. Challenge with the tournament, real-time multiplayer, and survival modes. Try the best soccer games in 2022. Enjoy the best 3d soccer free kick 2022 game with stunning graphics.<br> Download one of the best soccer games of 2022 today.<br> <br> <b>FEATURES<\/b> <br> - Full control over the soccer ball<br> - Real-time Multiplayer games with friends<br> - A real challenge for the world's best goal<br> - Online replay system<br> - 6 Different game modes like free kick offline.<br> - 183 Unique soccer world cup tournament stages<br> - Ability to customize and develop your soccer player<br> - Online leaderboards and 20+ achievements<br> - Super slow motion effects<br> - Top of soccer games 2022<br> - Real soccer kicks and real soccer ball movement.<br>","instructions":"","url":"https:\/\/html5.gamemonetize.com\/qd68lm6gy8j770jit57qhaw0uq17hhju\/","category":"Sports","tags":"1 Player, Ball, Casual, Clicker, Football, HTML5, Kids, Point And Click, Shoot, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/qd68lm6gy8j770jit57qhaw0uq17hhju\/512x384.jpg","width":"800","height":"600"},{"id":"36548","title":"Head Socce2022","description":"Head Soccer 2022 is a fast-paced sports football game where you can challenge all your friends or play with the CPU. Choose your favorite player and play against the CPU for the tournament or be the best of your friends in the versus mode. With detailed players to choose from the best teams, 3 game fields, and all the arcade fun in a single game.","instructions":"Use keyboard to play ","url":"https:\/\/html5.gamemonetize.com\/evzf7ayakql2so1vniglol5wx13k58df\/","category":"Sports","tags":"1 Player, 2 Player, 2 Player Games, 2D, Football, Game, Games, Highscore, HTML, HTML5, Kid, Kids, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/evzf7ayakql2so1vniglol5wx13k58df\/512x384.jpg","width":"800","height":"600"},{"id":"39679","title":"Ketchapp Basketball","description":"Become a basketball star in Ketchapp Basketball! Score as many points as you can by shooting the ball in the basket, you will directly get +2 points if you make a direct shot !","instructions":"","url":"https:\/\/html5.gamemonetize.com\/v162dv9vwwh3zfu5tisqcfozi781dcve\/","category":"Sports","tags":"Basketball, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/v162dv9vwwh3zfu5tisqcfozi781dcve\/512x384.jpg","width":"800","height":"600"},{"id":"39681","title":"Géométrie Clash GO!","description":"Be careful! - Nerve cells do not regenerate after they die! Get to the top levels and beat your friend's records! Your goal is to maneuver between obstacles and collect coins. Seems simple at first glance, but its no cake walk. The coins are placed in hard-to-reach places that you will most certainly want to reach through the screen to the other side, grab the beard of the developer, just to stair in his eyes with total hatred. Nevertheless, you will play this game again and again and again, making progress.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/92d15tots1bqm2zmwgh3aoo0zso2nlp8\/","category":"Soccer","tags":"Adventure, Puzzle, Soccer","thumb":"https:\/\/img.gamemonetize.com\/92d15tots1bqm2zmwgh3aoo0zso2nlp8\/512x384.jpg","width":"800","height":"600"},{"id":"41301","title":"Super Simple Soccer","description":"Super Simple Soccer as its name suggests is a fresh and easy to play soccer game. In this game, all you have to do is score more goals than the other team before the 90-second timer runs out. You need to win five matches in a row to lift the world cup. Features: • Fresh and simple gameplay • Pick your own team's name and color • Tackle, sprite, jump, and shoot • Sound effects","instructions":"- Arrow keys to move up down left and right - Press Z key to Jump - Press X key to Tackle Sprint - Press C key to Shoot ","url":"https:\/\/html5.gamemonetize.com\/7vydxmim8r289apeby6tftyo9sy8hz7v\/","category":"Sports","tags":"1 Player, Ball, Casual, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/7vydxmim8r289apeby6tftyo9sy8hz7v\/512x384.jpg","width":"854","height":"480"},{"id":"40598","title":"FIFA Soccer 2023","description":"Prepare yourself for your authentic FIFA World Cup 2022 journey with EA SPORTSFIFA Mobile. Build your Ultimate Team and kick off your soccer journey in FIFA World Cup 2022 today. Immerse yourself in the world‘s greatest soccer tournament. FIFA Mobile is the only officially licensed FIFA World Cup 2022mobile game where you can play through the official tournament brackets with any of the 32 qualified nations. The new ‘23 season is here! The new season includes updated players, kits, clubs, leagues and national teams to reflect the real world 22\/23 soccer season! Build your dream team in FIFA Mobile - collect players and put your favorite soccer stars to the test. With over 15,000 authentic soccer stars to choose from including world-class talent like Kylian Mbappé, Vini Jr, and Christian Pulisic, plus 600+ teams including Real Madrid and Manchester City. Score goals with some of the world’s best players as you level up a team of soccer superstars. Compete against the best in pvp modes, including Head-to-Head, VS Attack and the all new Manager Mode, where you choose strategic tactics for your team so they can rise in rank to FIFA Champions. Champions are made in FIFA Mobile. World-class competition, realistic sports game thrills, real time 11v11 gameplay, and authentic soccer game action await. Kick it in the next generation of mobile soccer games.","instructions":"Use Your Mouse","url":"https:\/\/html5.gamemonetize.com\/j6y0wq913tf5t6iswkgr5t70i4d0ouwz\/","category":"Sports","tags":"8 Ball Pool, Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/j6y0wq913tf5t6iswkgr5t70i4d0ouwz\/512x384.jpg","width":"800","height":"600"},{"id":"40812","title":"Super Soccer","description":"Super Soccer is an unblocked game to play online in your browser for free, free of charge and on any device, can be played on your computer, phone or tablet, also as a comment, We want to let you know, Super Soccer game is unblocked and it's one of the best sports games with a lot of fun, playable in any device at school or home, the game Super Soccer has been chosen by many players as their favorite, try it and we hope you enjoy playing. Remember, we offer you the funniest unblocked flash games of the world to play online free.","instructions":"keyboard","url":"https:\/\/html5.gamemonetize.com\/vpgtwmtpzq6b7kp6h0wjp982vn5z051b\/","category":"Sports","tags":"Boys, Football, Fun, Girls, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/vpgtwmtpzq6b7kp6h0wjp982vn5z051b\/512x384.jpg","width":"800","height":"600"},{"id":"40955","title":"Santa Fiity Special","description":"Play Santa's soccer skills gaqme by scoring goals, hitting targets and playing against a grinch or challenge a friend to a game of Soccer tic tac toe","instructions":"Swipe to kick","url":"https:\/\/html5.gamemonetize.com\/30d9z08ar6ig07k46t66d8qrsm3yomuk\/","category":"Soccer","tags":"2 Player, Holiday, Skill","thumb":"https:\/\/img.gamemonetize.com\/30d9z08ar6ig07k46t66d8qrsm3yomuk\/512x384.jpg","width":"450","height":"800"},{"id":"39150","title":"THROW BALL IN THE HOLE","description":"your objective is simply to put the ball in the hole. When there are multiple balls, you will need make sure that each ball lands in its respective colored bucket","instructions":" your objective is simply to put the ball in the hole When there are multiple balls you will need make sure that each ball lands in its respective colored bucket","url":"https:\/\/html5.gamemonetize.com\/8vlen8kkrbwdvx6qqmpkj9zr6xg0vjgv\/","category":"Soccer","tags":"2D, 8 Ball Pool, Arcade","thumb":"https:\/\/img.gamemonetize.com\/8vlen8kkrbwdvx6qqmpkj9zr6xg0vjgv\/512x384.jpg","width":"1920","height":"1080"},{"id":"40207","title":"WorldCup 2022 FK","description":"You are out of the group stage and have to win 4 more games to lift that world cup trophy and make your country proud","instructions":"Tap or Left mouse click to set direction curve and defend","url":"https:\/\/html5.gamemonetize.com\/juh3ozer4ug8ad8xls172qm18mjvabt4\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/juh3ozer4ug8ad8xls172qm18mjvabt4\/512x384.jpg","width":"960","height":"540"},{"id":"38559","title":"Soccer Star 22: World Football","description":"Soccer Star 2022 World Football: World Football has become the best soccer game in the world and this is possible because we offer the possibility to play together with great players in their soccer teams. Don't forget that World Football is the most important soccer tournament in the world and if you manage to win it, you will be a world legend in soccer history.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/zwntx01hocikqbtsrr3pqpcrx6u444jb\/","category":"Sports","tags":"2 Player Games, Football, Game, Games, Soccer","thumb":"https:\/\/img.gamemonetize.com\/zwntx01hocikqbtsrr3pqpcrx6u444jb\/512x384.jpg","width":"800","height":"600"},{"id":"39777","title":"Football Brawl","description":"Live your football story! Enter the field, decimate your opponent with various powerful kicks and fun and quirky powerups. Finally let them know who is the boss with the emotes system - become a football legend today!","instructions":"Move sideways and jump with the arrow buttons Perform various kicks with the ball buttons Score more goals in the given time and win the match Climb divisions and unlock all rewards Random match powerups and player emotes are available ","url":"https:\/\/html5.gamemonetize.com\/rifgnadbc38y3dj4dypflqh1714zpx1x\/","category":"Sports","tags":"Ball, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/rifgnadbc38y3dj4dypflqh1714zpx1x\/512x384.jpg","width":"800","height":"600"},{"id":"38537","title":"Leap the bottle","description":"Flip Bottle Leap 3D - Flip Flip Game Leap Bottle Flip will allow you to explore different rooms, jumping on all kinds of objects: tables, sofas, shelves, lamps, chairs and any object you can imagine that can be found in a room!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/wr4wlp74kijqnfpkkdn69ethjgc0u2j5\/","category":"Soccer","tags":"Game, Games, Shooter, Shooting, Soccer","thumb":"https:\/\/img.gamemonetize.com\/wr4wlp74kijqnfpkkdn69ethjgc0u2j5\/512x384.jpg","width":"800","height":"600"},{"id":"38498","title":"Head Soccer - Star League","description":"Head soccer star league - funny football game will bring joy and laughter to you. If you are tired of work, play this head soccer game, it will help you relieve stress.","instructions":"Mouse Controls","url":"https:\/\/html5.gamemonetize.com\/dwlxrt6qwqzk5wll91wlpbm0t5ljyzbd\/","category":"Sports","tags":".io, .io Games, Action, Arcade, Casual, drift, Fun, Funny, Hot, Hypercasual, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/dwlxrt6qwqzk5wll91wlpbm0t5ljyzbd\/512x384.jpg","width":"800","height":"600"},{"id":"36078","title":"Hppppppppppppppppp","description":"If you are tired of work, play this head soccer game, it will help you relieve stress.","instructions":"Mouse Controls","url":"https:\/\/html5.gamemonetize.com\/4zcrfm3xwqcfn9ra25owqbj1lpcwjrpc\/","category":"Sports","tags":".io, .io Games, 3D, 3D Games, Action, Adventure, Arcade, Fight, Fighting, Fun, Funny, Hidden, Horse, House, Mobile, Soccer, Sport, Sports, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/4zcrfm3xwqcfn9ra25owqbj1lpcwjrpc\/512x384.jpg","width":"800","height":"600"},{"id":"39456","title":"Board Soccer","description":"Turn based ball fight is a flexible 3d game that uses real-time physics to simulate game events.","instructions":"Tab to screen","url":"https:\/\/html5.gamemonetize.com\/llrchqplhpv19og35kzt84csviof31h8\/","category":"Soccer","tags":"Board, Soccer","thumb":"https:\/\/img.gamemonetize.com\/llrchqplhpv19og35kzt84csviof31h8\/512x384.jpg","width":"800","height":"600"},{"id":"38136","title":"Subway Santa Princess Runner","description":"Subway Santa Princess Runner is an awesome endless running game. Help Princess Santa dodge the trains and run from the policeman who's after her. The princess is waiting to live with her the most beautiful adventures subway run game and challenges to level up and she needs to collect various components of power and coins on the Subway road. You can control the game very easily and with one finger you can change the running path by swiping right to left or left to right and jump by swiping up or sliding when swiping down. You can also get a skateboard and double-tap to use it to protect you from collisions and don't avoid the surprise box and jump boots, also a jet-pack to help you get as many coins and gifts as possible","instructions":"","url":"https:\/\/html5.gamemonetize.com\/t98ouu7fy5oze8qrc0bh9295xsweb0ju\/","category":"Soccer","tags":"Game, Games, HTML5, subway, Subway Surfers","thumb":"https:\/\/img.gamemonetize.com\/t98ouu7fy5oze8qrc0bh9295xsweb0ju\/512x384.jpg","width":"800","height":"600"},{"id":"38141","title":"Basketball Stars: Multijoueur","description":"From the creators of many famous eSports games! Dribble, shoot, score, WIN in this competitive multiplayer basketball game! Take the ball and conquer the world with BASKETBALL STARS!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/v0cib43fj98ng1nq43eaavgmbaycwkgd\/","category":"Soccer","tags":"Basketball, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/v0cib43fj98ng1nq43eaavgmbaycwkgd\/512x384.jpg","width":"800","height":"600"},{"id":"38546","title":"Basketball Online","description":"Get your favorite ball and make lots of great dunk shots in different beautiful locations!","instructions":"GAME FEATURES - outstanding visuals - realistic physics model - wide variety of balls and locations ","url":"https:\/\/html5.gamemonetize.com\/peshwa0e4jg3k6fxkd1xhi1jdyl9etpz\/","category":"Sports","tags":"Basketball, Game, Games, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/peshwa0e4jg3k6fxkd1xhi1jdyl9etpz\/512x384.jpg","width":"800","height":"600"},{"id":"39031","title":"Soccer Kid vs Huggy","description":"Various levels of fun soccer action against your favorite monster. Kick the ball at him to knock him out, score goals, outsmart him and come out on top","instructions":"Swipe to kick","url":"https:\/\/html5.gamemonetize.com\/k78had981iftg6zb10tmma57d6cfkpwk\/","category":"Sports","tags":"Action, Skill, Soccer","thumb":"https:\/\/img.gamemonetize.com\/k78had981iftg6zb10tmma57d6cfkpwk\/512x384.jpg","width":"450","height":"800"},{"id":"38253","title":"Traffic Run!: Driving Game","description":"Wanna go for a drive and enjoy a traffic game? Navigate your vehicle on the road to avoid traffic without crashing any cars and reach the goal. There is traffic in front of you, but you must run and drive through the traffic. If you drive carefully, you will level up easily. This game is 3D graphic so you feel like you are driving for real. Drive all kinds of vehicles with your skill: trucks, station wagons, vans, jeeps, limousines, sports cars, and more by earning coins and level up! You can also change the car’s color to your favorite one! Vehicles cross the street at fast and furious speeds and race down asphalt roads, highways, railroad crossings and roundabouts. The object of this game is to cross the street without crashing into other cars. Drive on the asphalt carefully, but don’t be too cautious! You won’t be able to reach the goal if you hesitate. But beware of traffic lights, roundabouts and railroad crossings... And, of course, the police!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/0mpht9o0d23fe0w47lmuwnt50nfbxlrg\/","category":"Soccer","tags":"drift, drifting, Driving, Game, Games, Prison","thumb":"https:\/\/img.gamemonetize.com\/0mpht9o0d23fe0w47lmuwnt50nfbxlrg\/512x384.jpg","width":"800","height":"600"},{"id":"37543","title":"Roll a Ball","description":"Roll a Ball is a 3D games.You have the ability to control a ball and you need to hit all the yellow stuff around with it to win.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/9kmccyr5y9oq3ht9o96tn7vambk2k0qu\/","category":"Sports","tags":"3D, Arcade, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/9kmccyr5y9oq3ht9o96tn7vambk2k0qu\/512x384.jpg","width":"800","height":"600"},{"id":"31394","title":"European Football Jersey Quiz","description":"The most popular football memory quiz finally has arrived on your device. The concept is simple, you have several flags that you must make match with the correct jersey. You can do the opposite, match the jersey with the correct flag... But at the end, the challenge, if you accept it, is to be smart and fast enough.","instructions":"Match the player jersey with the flag of the team ","url":"https:\/\/html5.gamemonetize.com\/oijk33pesuwrttzz0ovz38ndutt4xqpq\/","category":"Soccer","tags":"Football, Matching, Puzzle, Quiz, Soccer","thumb":"https:\/\/img.gamemonetize.com\/oijk33pesuwrttzz0ovz38ndutt4xqpq\/512x384.jpg","width":"600","height":"800"},{"id":"37534","title":"PJ Masks - Sticky Splat Soccer","description":"Sticky Splat Soccer is the game with which today we are starting off our category of PJ Masks Games, a brand new category of Disney Junior Games for which we have planned multiple new and awesome games for you all to enjoy, one more awesome than the other one, and we highly recommend that you stick with us today, since we have not one, but five such games coming for you, one more worth your time than the other. You will be playing soccer with these heroes, and we teach you how right here and now, so make sure you pay close attention! Begin by choosing who of the three heroes you want to be. You will be the goalkeeper, having to catch all of the balls thrown at you, getting points in return for each of them you grab. There will be a point that will start extending on the lines on the right and left, and you have to click on them when they get the biggest they can so that you get the timing right and catch the ball. It is as simple as that, so don't stand around, but start playing and having fun with this game right away!","instructions":"Use the mouse ","url":"https:\/\/html5.gamemonetize.com\/5xpnahvxzsbym3k5dpt84ia98h31y776\/","category":"Sports","tags":"Adventure, Anime, Arcade, Cartoon, Cartoon Network, Disney, Football, HTML5, Kids, Shoot, Shooting, Soccer","thumb":"https:\/\/img.gamemonetize.com\/5xpnahvxzsbym3k5dpt84ia98h31y776\/512x384.jpg","width":"800","height":"600"},{"id":"37153","title":"Foot Starts","description":"Foot Starts game Play it on iyigames.com. Soccer has never been this fun. Simply drag, aim and release to shoot the soccer ball. The first to score 3 goals wins. Game features choose your side, from 32 nations. Smart and calculative AI. Be prepared to play hard with tutorial to learn the ropes. Exciting soccer stadium environment, perfect for soccer nuts. Finger Soccer is a turn-based soccer game. With simple game play and great physics, Finger Soccer is easy to pick up and fun to play! You don't need to be master of the soccer game , just drag the ball, adjust power and direction, and kick the ball to the goal.","instructions":"Mouse and drag to shoot","url":"https:\/\/html5.gamemonetize.com\/6xtnv9ynct84av1hck4ig1utvxzwfyh1\/","category":"Sports","tags":"Boys, Fun, Girls, HTML5, Shoot, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/6xtnv9ynct84av1hck4ig1utvxzwfyh1\/512x384.jpg","width":"800","height":"600"},{"id":"36622","title":"Football Qatar 2022","description":"Play these stunning cards in real-life games against your friends, or use them for our ever-growing online game. And watch out for the strongest cards of all: the TOP MASTERS, a must-have for any Adrenalyn XL™ fan, and the super-rare INVINCIBLE, the collection’s most-wanted card. And as ever, where there’s football, there’s also Panini, and we’re ready to kick off with FIFA World Cup Qatar 2022™ Adrenalyn XL™, the official card collection that gets bigger and better with every edition!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/yvbuoggiurd8qdgr8gvymg0dq0o860xs\/","category":"Soccer","tags":"Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/yvbuoggiurd8qdgr8gvymg0dq0o860xs\/512x384.jpg","width":"800","height":"600"},{"id":"31527","title":"Football Penalty Champions","description":"You’ve been following the world cup on TV since you were a kid, you love football and you’d like to kick the ball as soon as possible? Then Football Penalty World Cup is the perfect game for you. Imagine yourself a night of big match during the last minutes of the game. It’s a tie for now and everything rely on your ability to offer a penalty to your team. It’s about time to put your reflexes to the trial!","instructions":"Get as many penalties as you can in this game for football fans and prove to your friends that you are the king of footballer Touch click the screen at the right time on the right spot to score a goal ","url":"https:\/\/html5.gamemonetize.com\/kdc3vjxh7rxnbrv5nwroi8atmyfq1uji\/","category":"Sports","tags":"Football, Games, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/kdc3vjxh7rxnbrv5nwroi8atmyfq1uji\/512x384.jpg","width":"800","height":"600"},{"id":"37248","title":"Gumball Penalty kick","description":"Gumball is throwing a party and you're invited! Get ready to go head to head with family, friends and foes as you explore four exciting board game worlds based on locations from The Amazing World of Gumball. Race your fellow players round the board and be the first one to reach the finish line - all while putting your skills to the test in cooperative and competitive mini-games! You never know what will happen next in Gumball's Amazing Party Game! Football is back and it's bigger than ever! Play Toon Cup, the totally free football game! Have fun choosing your favourite Cartoon Network characters such as Darwin from The Amazing World of Gumball, Bubbles from The Powerpuff Girls and Apple from Apple & Onion. Master your skills and work with your team to score goals and fight your way to the top of the leader board in the biggest Toon Cup Tournament yet!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/4xd3zmb4c3t3z466bzhck4rjm5a2hs94\/","category":"Sports","tags":"2 Player, Ball, Football, Shooting, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/4xd3zmb4c3t3z466bzhck4rjm5a2hs94\/512x384.jpg","width":"800","height":"600"},{"id":"35583","title":"BandyBall","description":"Dribble with balls that have made football history. Dribble, earn stars, do challenges and unlock new balls and shoes.","instructions":"Touch for mobile Mouse click for browsers ","url":"https:\/\/html5.gamemonetize.com\/glthxanlgmu72u2knn1ialxufj80ti6g\/","category":"Sports","tags":"2D, Arcade, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/glthxanlgmu72u2knn1ialxufj80ti6g\/512x384.jpg","width":"1160","height":"2400"},{"id":"36691","title":"Stick Soccer 3D","description":"A new style of a soccer game is beginning with the Stick Soccer 3D game. Various football teams, soccer match tactics, various stadiums, and many other things are waiting for you with this soccer game. You can play single or two player. Also, you can participate in speed mode and you can start a soccer game with no limits. The tournament mode will bring you a cup if you can win all of the soccer matches! Let the soccer matches begin!","instructions":"Use LEFT-CLICK on a player when your turn comes and aim with your MOUSE and release to shoot ","url":"https:\/\/html5.gamemonetize.com\/b0xfkcy8iaqk10hkxv08iohwbiyxp0u5\/","category":"Soccer","tags":"2 Player, 2 Player Games","thumb":"https:\/\/img.gamemonetize.com\/b0xfkcy8iaqk10hkxv08iohwbiyxp0u5\/512x384.jpg","width":"900","height":"500"},{"id":"37173","title":"Heads Arena Soccer All Stars","description":"Heads Arena Soccer All Stars is a fun soccer game you can play on iyigames.com. Pick your favorite soccer team and prepare yourself for a head boggling, action packed, challenging game of soccer that you can only find in Heads Arena: Soccer All Stars. Use your big head to knock the ball into the goal! Heads Arena: Soccer All Stars lets you play for 13 world-class teams with outstanding soccer heads. You can compete in solo, 1-on-1, or 2-on-2 match-ups. In this head soccer game, you can choose your favorite football club, and try to win the tournament!","instructions":"Move WASD Shoot Space","url":"https:\/\/html5.gamemonetize.com\/l0jdsvppleowsqzcs0xxcnfngx266i1z\/","category":"Sports","tags":"1 Player, 2 Player, Ball, Basketball, Boys, Celebrity, Football, Fun, Girls, HTML5, School, Shoot, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/l0jdsvppleowsqzcs0xxcnfngx266i1z\/512x384.jpg","width":"800","height":"600"},{"id":"36027","title":"Pips up","description":"Can you roll your way to the goal? Keep an eye on the time, you need to roll quick! Goal Roll to the goal to complete the level. Be sure to have the pips needed facing up!","instructions":"W S A D or Arrow keys Move ","url":"https:\/\/html5.gamemonetize.com\/q8gs1zrtm7ia9c68ouneijs7gd7al6kf\/","category":"Soccer","tags":"3D Games, Arcade, Gold, Google","thumb":"https:\/\/img.gamemonetize.com\/q8gs1zrtm7ia9c68ouneijs7gd7al6kf\/512x384.jpg","width":"800","height":"600"},{"id":"36559","title":"Peppa Pig: Sports Day","description":"Peppa and her friends are taking part in Sports Day and they want you to join them! Fans of the TV show will love this sports day-inspired app, which encourages pre-schoolers to explore fun filled games with their favourite little piggy. 5 x fun-filled games featuring Peppa, George and their family and friends: • Bicycle Race • Obstacle Course • Tug of War • Long Jump • Ice Cream Maker Plus special Sports Day features, such as: • Rosette Maker • Earn Sticker Rewards","instructions":"Tap To Play","url":"https:\/\/html5.gamemonetize.com\/md9t6w9k4hcdsokpd9igi1v81ll9w47p\/","category":"Soccer","tags":"Racing, running, Soccer","thumb":"https:\/\/img.gamemonetize.com\/md9t6w9k4hcdsokpd9igi1v81ll9w47p\/512x384.jpg","width":"800","height":"600"},{"id":"36418","title":"Free Kick","description":"Select your team and try to score as many goals as you can. Try to be the best facing obstacles, barriers and other challenges in each level.","instructions":"Drag with your finger to kick the ball Drag and swipe to curve the ball ","url":"https:\/\/html5.gamemonetize.com\/ex6hpdacxmxxult8ljumakb54vpn0z25\/","category":"Sports","tags":"Football, Kids, Mobile, Shoot, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/ex6hpdacxmxxult8ljumakb54vpn0z25\/512x384.jpg","width":"720","height":"1280"},{"id":"30360","title":"Kick","description":"Kick is a single player game in which gamer assumes the character of a soccer player keen on sharpening his skills in one of the most unconventional locations(street alleys). Awareness, speed and shot accuracy will come handy as you kick the ball around. Points are subtracted when ball smashes a window but are added when the ball consequently hits a wall. The aim is to keep the points total above zero for as long as possible","instructions":"Use left and right arrow keys to move left right respectively","url":"https:\/\/html5.gamemonetize.com\/baa9wqjaativvxxpa3h62usxptc647lw\/","category":"Sports","tags":"1 Player, 2D, Arena, Ball, Casual, Family, Football, HTML5, Mobile, Obstacle, Online, Skill, Skills, Soccer, Sport, Sports, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/baa9wqjaativvxxpa3h62usxptc647lw\/512x384.jpg","width":"640","height":"480"},{"id":"34773","title":"Joystick Adventure","description":"Are you ready to accompany him in the adventure of joystick, who is a cute adventurer? Be careful, no matter how simple it may seem, there are walls you have to go through, obstacles you have to overcome. You'll get burned by hitting obstacles and you may have to start over. collect the ores, take the key and go to the door. Adventure Joystick belongs to Adventure and it is often associated with Fun Games and Escape Games. This game has received 23 votes, 14 positive ones and 9 negative ones and has an average score of 3.8.","instructions":"Tap To Play","url":"https:\/\/html5.gamemonetize.com\/27cyix44icohq7nijuv6qnvw1w0mw9je\/","category":"Soccer","tags":"Adventure","thumb":"https:\/\/img.gamemonetize.com\/27cyix44icohq7nijuv6qnvw1w0mw9je\/512x384.jpg","width":"800","height":"600"},{"id":"34995","title":"World Cup Head 2022","description":"World Cup is coming. What are you waiting for ? Click play button and strat aginst another teams and all matechs to win world cup.","instructions":"clik above down left right and shoot by button z or x ","url":"https:\/\/html5.gamemonetize.com\/kuhex30p457gxpf6h9z9zm0oe8mh2jq7\/","category":"Sports","tags":"Ball, Ballon, Boy, Boys, Football, Matching, Shoot, Sport, Sports, World","thumb":"https:\/\/img.gamemonetize.com\/kuhex30p457gxpf6h9z9zm0oe8mh2jq7\/512x384.jpg","width":"800","height":"600"},{"id":"33636","title":"Ball Up","description":"Click the ball to make it jump. Try to keep it in the air. It changes size and weight. Attention to the wind.","instructions":"Click on ball - JUMP","url":"https:\/\/html5.gamemonetize.com\/3dq3v67d4nzzaar6yyeg8f2dhycp9dhh\/","category":"Soccer","tags":"1 Player, 2D, Air, Ball, Bounce, Click, HTML5, jump, Jumping, Kids, Skill, Skills, Soccer","thumb":"https:\/\/img.gamemonetize.com\/3dq3v67d4nzzaar6yyeg8f2dhycp9dhh\/512x384.jpg","width":"1000","height":"700"},{"id":"34327","title":"Nations League Soccer","description":"Play against a friend on same device or go for the Tournament on your own against the best teams in the world. Group stage and elimination rounds, all the way to the championship","instructions":"Mouse or finger drag for direction and power release to kick","url":"https:\/\/html5.gamemonetize.com\/ni7z4o695ju6qr9crdzvg6vq3a0hbhp5\/","category":"Soccer","tags":"2 Player, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/ni7z4o695ju6qr9crdzvg6vq3a0hbhp5\/512x384.jpg","width":"450","height":"800"},{"id":"32142","title":"CRAZY CHICKS","description":"Crazy Chicks! Put your record in this addictive arcade!","instructions":"use mouse","url":"https:\/\/html5.gamemonetize.com\/tht87jw4tlslki23yo7w33cuuls7fjv1\/","category":"Soccer","tags":"Chicken, Clicker, Collecting, Crazy","thumb":"https:\/\/img.gamemonetize.com\/tht87jw4tlslki23yo7w33cuuls7fjv1\/512x384.jpg","width":"800","height":"600"},{"id":"33454","title":"Liverpool vs Real 2022","description":"This is your chance to win the championship. Choose Liverpool F.C. or Real madrid and kick and defend your way to the trophy","instructions":"Mouse or Tap to set direction lift and curve of your kick When defending Tap or click keeper gloves when they appear ","url":"https:\/\/html5.gamemonetize.com\/4s4igxk8mcalex0xptrhjoj3yoojogf3\/","category":"Sports","tags":"Arcade, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/4s4igxk8mcalex0xptrhjoj3yoojogf3\/512x384.jpg","width":"960","height":"540"},{"id":"33377","title":"Cristiano Ronaldo Kick N Run","description":"Super soccer star Cristiano Ronaldo is going to start an exciting adventure. He will run all the way with a soccer ball. Avoid obstacles. After you collect four letters, you will pass successfully. Attention other players, they are foxy, they will change direction.","instructions":"Tap or click ","url":"https:\/\/html5.gamemonetize.com\/spgx5ytd64fptcz6od43gzyyfsottpi8\/","category":"Soccer","tags":"3D, 3D Games, Boy, Boys, Football, Fun, H5, HTML5, Kid, Kids, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/spgx5ytd64fptcz6od43gzyyfsottpi8\/512x384.jpg","width":"720","height":"1280"},{"id":"32681","title":"Pocket Soccer","description":"Kick the soccer ball is an HTML5 game. Don’t let the ball hit the ground and try to beat your records. Enjoy cool music, sounds and graphics.","instructions":"Click touch the ball ","url":"https:\/\/html5.gamemonetize.com\/hjno1zvbupfufoh51s0lv8clwuxc4qyr\/","category":"Sports","tags":"Ball, Football, Fun, Game, Games, HTML, HTML5, Kid, Kids, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/hjno1zvbupfufoh51s0lv8clwuxc4qyr\/512x384.jpg","width":"800","height":"600"},{"id":"33458","title":"Head Soccer 2022","description":"Get ready for a brand new head soccer adventure! The game offers 1 and 2 player modes. In the \"1 Player\" mode, you will fight against artificial intelligence. In the \"2 Player\" mode, take over the keyboard with your friend and show off your football skills. In both modes, try to score the most goals in the given match time. When the match period ends, the player who has scored the most goals becomes the winner. Let's start the competition!","instructions":"1 PLAYER MODE Move ARROW KEYS Shoot F and G 2 PLAYER MODE Player 1 Move WASD Shoot F and G Player 2 Move ARROW KEYS Shoot K and L","url":"https:\/\/html5.gamemonetize.com\/ln9clr5f3rmz9rmmo03d0ry8bca9348g\/","category":"Soccer","tags":"1 Player, 2 Player, 2 Player Games, 2D, Android, Ball, Football, Mobile, Skill, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/ln9clr5f3rmz9rmmo03d0ry8bca9348g\/512x384.jpg","width":"800","height":"450"},{"id":"33113","title":"World Cup Penalty Football Game","description":"Are you a soccer fan? Well, so are we! And since the 2014 World Cup is coming up and this happens to be our first ever soccer-themed mobile game, we have decided to make it our professional version of \"Penalty Football\" – or \"Penalty Soccer\" for the rest of the world out there. World Cup Penalty is a game in which the goal is to succeed in scoring a penalty shot more times than your opponent does. Each team takes turns attacking and blocking the other side, all while listening for instruction from the referee. The successful enough team to shoot past their opponent five times will be declared the winner of the World Cup: Penalty! In the World Cup Penalty sports game, you have five chances to score a goal and five chances to block an opponent's shot. So you win a match by getting the ball into the goal more times than your opponent, but the catch is that you have to beat all teams in the tournament to win the whole game! World Cup Penalty is a soccer game where you can choose from different countries, each with its unique playing style. You try to score more times than the opponent by alternately taking turns in shooting and defending. Then, you go on to the next round; otherwise, you lose and are out! World Cup Penalty is a fun soccer game where you play as one country's team and must beat the others to win. You have ten shots, and your opponent has ten photos so you can alternate taking them. Block any incoming shots that come at you or are launched from your opponent. You may be able to make a successful goal if you plan ahead of time!","instructions":"Tap To Play Click the area at the bottom of the screen where a moving ball ","url":"https:\/\/html5.gamemonetize.com\/jb7nf5pq2bvoipsqma483pvmhc3nrsxq\/","category":"Sports","tags":"Football, Soccer, Sport, Sports, World","thumb":"https:\/\/img.gamemonetize.com\/jb7nf5pq2bvoipsqma483pvmhc3nrsxq\/512x384.jpg","width":"720","height":"1280"},{"id":"32427","title":"Football soccer penalties","description":"penalty, football, soccer","instructions":"","url":"https:\/\/html5.gamemonetize.com\/u2txrbr7u98zmnes77g3cn0a6tbz7uau\/","category":"Sports","tags":"Shooting, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/u2txrbr7u98zmnes77g3cn0a6tbz7uau\/512x384.jpg","width":"0","height":"0"},{"id":"32721","title":"Kick The Soccer Ball","description":"Kick the soccer ball is an HTML5 game. Don’t let the ball hit the ground and try to beat your records. Enjoy cool music, sounds and graphics.","instructions":"Click touch the ball ","url":"https:\/\/html5.gamemonetize.com\/2cntky5xojfk8kuivmvmsan35e5gbcy7\/","category":"Soccer","tags":"Ball, Football, Fun, Funny, Game, Games, HTML, HTML5, Kid, Kids, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/2cntky5xojfk8kuivmvmsan35e5gbcy7\/512x384.jpg","width":"800","height":"600"},{"id":"31840","title":"Yuki and Rina Football","description":"Yuki & Rina are 2 young talented football players. They showed incredible football skills and their coach and manager decided it was time to train them to become Pro Players in the famous “Soccer stars Major Football League”. Before becoming Pro Players, Yûki & Rina must pass the ultimate test, which is a combination of agility, skills and reflex.","instructions":"Tap a side to make the player switch between lines Avoid strikers and other players and collect medals and cups","url":"https:\/\/html5.gamemonetize.com\/huemcw3ly55tmrthz249zc5xap6y3xni\/","category":"Sports","tags":"Brain, Race, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/huemcw3ly55tmrthz249zc5xap6y3xni\/512x384.jpg","width":"600","height":"800"},{"id":"28622","title":"Footix.io","description":"Footix.io is a fast-paced multiplayer soccer game in which the only rule is to win with the help of your teammates. To learn how to play click on \"Tutorial\", Chat with the world by clicking on \"Global Chat\". Don't forget to create an account to keep your statistics.","instructions":"Move WASD Run Mouse Right Kick Mouse Left Slide Space Hey E","url":"https:\/\/html5.gamemonetize.com\/an0i1pdpqua7zz66xt16y9g0uba5hhmy\/","category":"Soccer","tags":".io Games, Ball, Football, Multiplayer, Pixel, Soccer","thumb":"https:\/\/img.gamemonetize.com\/an0i1pdpqua7zz66xt16y9g0uba5hhmy\/512x384.jpg","width":"800","height":"600"},{"id":"30718","title":"Fun football","description":"Welcome to Fun Football with physics, various locations. Virtuoso combinations of blows, spectacular feeds, all this awaits you in the game.","instructions":"A D","url":"https:\/\/html5.gamemonetize.com\/jig3ioym71l5yy27fbaiziwzn0jvxrpr\/","category":"Soccer","tags":"Boys, Football, Fun, Girls, HTML5, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/jig3ioym71l5yy27fbaiziwzn0jvxrpr\/512x384.jpg","width":"800","height":"600"},{"id":"31402","title":"Soccer Rush","description":"Avoid soccer hooligans and defenders and make it to the box to shoot on goal","instructions":"Tap arrows on screen or use arrow keys on desktop","url":"https:\/\/html5.gamemonetize.com\/ua7epaxcqir3003gq4f1fw9m1ixxacfx\/","category":"Soccer","tags":"Action, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/ua7epaxcqir3003gq4f1fw9m1ixxacfx\/512x384.jpg","width":"600","height":"800"},{"id":"30329","title":"Extreme Race ","description":"In this challenging game you control a car that has no brake and only gains more speed. All you have to do is collect the coins and not crash into the other cars. Collect coins and buy new vehicles.","instructions":"Tap to Play","url":"https:\/\/html5.gamemonetize.com\/zflnd650jcd2elnej7g7sen5jae93sbz\/","category":"Soccer","tags":"Action, Car, Racing, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/zflnd650jcd2elnej7g7sen5jae93sbz\/512x384.jpg","width":"800","height":"600"},{"id":"30646","title":"GotSoccer","description":"Overtake your opponents, move swiftly and shoot goals! Dribble, pass and kick. Real football experience complete with easy controls and enjoyable movements.","instructions":"Tap to play","url":"https:\/\/html5.gamemonetize.com\/w6tm785s4eg7zqojdzpiws9qavkcfuzr\/","category":"Sports","tags":"Football, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/w6tm785s4eg7zqojdzpiws9qavkcfuzr\/512x384.jpg","width":"800","height":"600"},{"id":"30356","title":"Penalty Kick Target","description":"It's penalty time! Are you confident in your abilities? Hit the target and don't miss to become the best!","instructions":"Use mouse or tap to aim and kick","url":"https:\/\/html5.gamemonetize.com\/os00yv4rjbamn3014mxc5mhyqw5jy2rv\/","category":"Sports","tags":"1 Player, 2D, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/os00yv4rjbamn3014mxc5mhyqw5jy2rv\/512x384.jpg","width":"960","height":"540"},{"id":"30363","title":"Mini Football","description":"Welcome to Mini Football, the best soccer game ever with 3D design. Overtake your opponents, move swiftly and shoot goals! Dribble, pass and kick. Real football experience complete with easy controls and enjoyable movements.","instructions":"Tap To Play Follow The Game Tutorials ","url":"https:\/\/html5.gamemonetize.com\/1v4knye4iqemy9amfjnlq9j9ravm9pnb\/","category":"Soccer","tags":".io Games, Football, Hypercasual, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/1v4knye4iqemy9amfjnlq9j9ravm9pnb\/512x384.jpg","width":"720","height":"1280"},{"id":"30281","title":"456 Minimal Bubble Shooter","description":"Put your strategy skills to the test! Compete against friends and family and see who can reach the highest score and get 3 stars on every level. Earn coins while you play and use them to get cool boosters. Use your logic and puzzle-solving skills to complete the missions and clear the board, and make sure to collect special daily bonuses.","instructions":"Try the Puzzle Game Mode and Discover the Ultimate Bubble Popping Fun This shooter is a thrilling balloon popper free app with thousands of challenging puzzles to master Shoot the colorful balls to advance to the next amazing puzzle level train","url":"https:\/\/html5.gamemonetize.com\/38mkqmjp4j4dcznqgqs0084iosnvzvcd\/","category":"Stickman","tags":"Bubble, Bubble Shooter, Game, Games, Puzzle, Shoot, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/38mkqmjp4j4dcznqgqs0084iosnvzvcd\/512x384.jpg","width":"800","height":"600"},{"id":"29967","title":"MINI RUN RACE","description":"Mini run race : Simple and addicting gameplay that will have you running ◉ Many upgrades to keep you race. ◉ Funny design and areas to discover. ◉ Bright and varicolored. ◉ Play without wifi or internet connection, play offline.","instructions":"CLICK","url":"https:\/\/html5.gamemonetize.com\/oqmvtjapf9d4fr6iv6v6fui0ubn3egkl\/","category":"Soccer","tags":"Funny, Games, Highscore, Hypercasual, jump, Racing","thumb":"https:\/\/img.gamemonetize.com\/oqmvtjapf9d4fr6iv6v6fui0ubn3egkl\/512x384.jpg","width":"700","height":"500"},{"id":"29498","title":"Ultimate PK","description":"Rise up the rankings during the year by defeating the best teams. Score goals and defend against opposing teams. Challenge a friend on the same device too.","instructions":"Swipe to shoot Tap click keeper gloves to defend","url":"https:\/\/html5.gamemonetize.com\/10owzubh13i7v8w0oi747qu4p5urendu\/","category":"Soccer","tags":"1 Player, 2 Player, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/10owzubh13i7v8w0oi747qu4p5urendu\/512x384.jpg","width":"800","height":"600"},{"id":"29122","title":"Burrito Bison Revenge","description":"Burrito Bison Revenge is only playable on your computer for now.","instructions":"Press space when the meter hits the absolute center so you can start with a powerful launch Gain momentum by firing the slam button at the right moment ","url":"https:\/\/html5.gamemonetize.com\/vlaxrvuydmqeslb9h6asemn3kaq3enws\/","category":"Soccer","tags":"Flight, fly, jump, Jumping","thumb":"https:\/\/img.gamemonetize.com\/vlaxrvuydmqeslb9h6asemn3kaq3enws\/512x384.jpg","width":"800","height":"600"},{"id":"28758","title":"Kick the soccer ball (kick ups)","description":"Kick the soccer ball is an HTML5 game. Don’t let the ball hit the ground and try to beat your records. Enjoy cool music, sounds and graphics.","instructions":"Mouse click pc or tap the screen mobile ","url":"https:\/\/html5.gamemonetize.com\/b4zkssoijj548ugwfznpg0gvlpz0kl8k\/","category":"Sports","tags":"1 Player, 2D, Action, Air, Arcade, Arena, Balance, Ball, Basketball, Best, Bounce, Bow, Classic, Click, Clicker, endless, Football, Fun, Funny, Game, Games, Highscore, HTML, HTML5, Hypercasual, Interactive, jump, Jumping, Kid, Kids, Music, Physics, Play, Point And Click, Relaxation, Retro, Rhythm, running, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/b4zkssoijj548ugwfznpg0gvlpz0kl8k\/512x384.jpg","width":"1024","height":"768"},{"id":"28632","title":"Baldi FNF Music Mod","description":"Today is Friday. And, you do love horror things in school at night. Welcome you! This horror fantastic game will fulfill your dream with funkin music battles.","instructions":"HOW TO ENJOY THIS FUNKIN GAME Just tap to the arrow to make them perfectly match Try your best to beat enemies in rap battle as well as you can to get the highest score point and unlock all amazing FNF songs Enjoy this funkin time with Baldi - a basi","url":"https:\/\/html5.gamemonetize.com\/bywzebj93d9w2c7r70pfya0n5c92d353\/","category":"Soccer","tags":"Game, Games, Mobile, Music","thumb":"https:\/\/img.gamemonetize.com\/bywzebj93d9w2c7r70pfya0n5c92d353\/512x384.jpg","width":"800","height":"600"},{"id":"28793","title":"Driving To Travel","description":"Hold on to the vehicle and speed up. Take care to avoid the traffic.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/xmee5fxs8ltmctwiaias6x94at3ngm8j\/","category":"Soccer","tags":"Car, Race, Racing","thumb":"https:\/\/img.gamemonetize.com\/xmee5fxs8ltmctwiaias6x94at3ngm8j\/512x384.jpg","width":"455","height":"930"},{"id":"28411","title":"Poppy Football 2","description":"Huggy and Wuggy are playing ball, choose your favorite character and and your team, join the tournament only for the best championship. Control your favorite Huggy Wuggy player You can play alone against the AI. Show your real football mastery Huggy Wuggy","instructions":"A left D Right E Shoot and jump W Up angle S Down angle","url":"https:\/\/html5.gamemonetize.com\/pbq9bp9azehxvp6m2vdy3hr5oo3gz2ws\/","category":"Soccer","tags":"Football, Game, Games, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/pbq9bp9azehxvp6m2vdy3hr5oo3gz2ws\/512x384.jpg","width":"854","height":"480"},{"id":"28224","title":"Football Shoot League","description":"Choose your favorite team and enter a tournament only fighting for the best championship. Control your favorite player You can play solo player against AI. Show your real football mastery Huggy Wuggy","instructions":"A left D Right E Shoot and jump W Up angle S Down angle","url":"https:\/\/html5.gamemonetize.com\/rkzw9azb3m9mq93ltsge3w2fzy8df0z6\/","category":"Soccer","tags":"Football, Game, Games, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/rkzw9azb3m9mq93ltsge3w2fzy8df0z6\/512x384.jpg","width":"854","height":"480"},{"id":"28132","title":"Mini Goalkeeper","description":"Be a Super Soccer Goalie! Be a Super Soccer goalkeeper! Mini Goalkeeper is a soccer goalkeeper game, use your finger to slide goalkeeper to the kicked penalty. As a super goalkeeper you must protect your goal from as much incoming balls as you can. How to Play: - The computer will shoot soccers - Just swipe the screen to control the path of your tiny goalie Enjoy your soccer game! Become a Soccer Goalkeeper Superstar!","instructions":"Use your mouse or touch the screen to play ","url":"https:\/\/html5.gamemonetize.com\/vvlkhqmcfe1ig8ntbfhlchvz4tsgwtsq\/","category":"Sports","tags":"1 Player, 2D, Boy, Boys, Casual, Football, Girl, Girls, HTML, HTML5, Hypercasual, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/vvlkhqmcfe1ig8ntbfhlchvz4tsgwtsq\/512x384.jpg","width":"1280","height":"800"},{"id":"27955","title":"Super Cute Soccer - Soccer and Football","description":"Best soccer game. More than 20 enemies with different abilities and fun game modes. Choose your best football player and win the championship Have fun with unique and innovative soccer dolls. Buy new dolls and new skills and avatars","instructions":"Touch or mouse do all the work","url":"https:\/\/html5.gamemonetize.com\/2oj4yrjzfwl0pqcu4y1vlkywtyurjxwm\/","category":"Soccer","tags":"Action, Cute, Football, Fun, Funny, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/2oj4yrjzfwl0pqcu4y1vlkywtyurjxwm\/512x384.jpg","width":"720","height":"1280"},{"id":"27759","title":"Toon Cup 2022","description":"Football is back and its bigger than ever! Play Toon Cup 2022, the totally free football game! Have fun choosing your favourite Cartoon Network characters","instructions":"Keyboard","url":"https:\/\/html5.gamemonetize.com\/aeoe5t0fnvdotya28svdmgyjbqll97hf\/","category":"Sports","tags":"1 Player, Cartoon, Cartoon Network, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/aeoe5t0fnvdotya28svdmgyjbqll97hf\/512x384.jpg","width":"800","height":"600"},{"id":"27643","title":"Cooking My Story: cooking game","description":"That’s right, the internationally handsome - I mean, famous - Chef Alex chose ME to be his apprentice! To think, a year ago I was lucky to get a job as an official “wiener steamer” for my town’s annual hot dog eating new cooking games for free contest (to be fair, the last three winners had their wieners steamed by yours truly). Whoa! That didn’t come outright. Oh, well... it’s not like anyone else is ever going to read these cooking games for free diary...","instructions":"","url":"https:\/\/html5.gamemonetize.com\/c6qs1gvrcul16wkk5rtzmeiqlmrbofjz\/","category":"Soccer","tags":"Cook, Cooking, Game, Games","thumb":"https:\/\/img.gamemonetize.com\/c6qs1gvrcul16wkk5rtzmeiqlmrbofjz\/512x384.jpg","width":"800","height":"600"},{"id":"27401","title":"Super Ball Juggling","description":"How many times you can juggle these two soccer balls? How to play: Tap left side of screen to kick the left football\u2028- Tap right side of screen to kick the right football\u2028\u2028 Don't let the ball fall Warning: \u2028\u2028This game create dependence :)","instructions":"Use your mouse or touch the screen to play ","url":"https:\/\/html5.gamemonetize.com\/lwhhk9mcr33z86x7niqj9jfk7kb2bmdf\/","category":"Sports","tags":"Casual, Click, Clicker, Football, HTML, HTML5, Hypercasual, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/lwhhk9mcr33z86x7niqj9jfk7kb2bmdf\/512x384.jpg","width":"600","height":"1024"},{"id":"27364","title":"Goal","description":"Cool Goal is a football game that always hits the back of the net! Cool Goal, an action-packed football game with a focus on goal scoring and dodging obstacles, has arrived on mobile devices. Your task? Shoot and score in this fun football game. Show off your best shots by getting creative with angles and timing. Try to dodge as many enemies as you can to progress through increasingly challenging levels.","instructions":"Tap To Play","url":"https:\/\/html5.gamemonetize.com\/qwd09cun1gn7fls066shdno1h7amw0f1\/","category":"Sports","tags":"Football, Game, Games, HTML5, Soccer","thumb":"https:\/\/img.gamemonetize.com\/qwd09cun1gn7fls066shdno1h7amw0f1\/512x384.jpg","width":"720","height":"1280"},{"id":"27444","title":"Head The Ball","description":"Head The Ball is a new way for soccer players to head the ball. By using your head, you can create an impact that is difficult for your opponent to miss. With your head, you can create an impact that is difficult for your opponent to miss. Your opponent will be forced to defend against the ball if it falls off your hand. You can also use this ability to create space on the pitch for your teammates.","instructions":"Drag The Player For Head The Ball","url":"https:\/\/html5.gamemonetize.com\/l6cywxfmizcfpepbx8cf2zxbm53dujql\/","category":"Soccer","tags":"Ball, Football","thumb":"https:\/\/img.gamemonetize.com\/l6cywxfmizcfpepbx8cf2zxbm53dujql\/512x384.jpg","width":"720","height":"1280"},{"id":"22411","title":"Pineapple Pen - Arcade","description":"Sometimes all you need is to stick a pen into a fruit. Tap to throw the pen and try to hit an pineapple or an apple. Hit the perfect center for two times in a row, and experience joy! Challenge your friends to find out which one of you is the true master of the pen!","instructions":"Tap on the screen to shoot the pens towards the pineapple Don t hit your character or you will lose ","url":"https:\/\/html5.gamemonetize.com\/95uj8m1l9gkw6sn36fj59l1vouli62dh\/","category":"Soccer","tags":"Fashion, Girl, Girls, Princess","thumb":"https:\/\/img.gamemonetize.com\/95uj8m1l9gkw6sn36fj59l1vouli62dh\/512x384.jpg","width":"800","height":"600"},{"id":"26655","title":"Soccer Basketball","description":"Tap and slide the soccer ball, control its angle and power, then shoot towards the hoop. The perfect effect and physic effect will help you see more clearly. The game is an endless arcade game, than shoot towards the hoop to win the levels; as the difficulty could increases, there are four different random movements for the hoop. You have only 3 shoots to complete each level! Are you able to try to sign the best record in the local leaderboard? HOW TO PLAY: 1: Touch the screen! 2: Drag the ball to change the power and angle! 3: Release to shoot! KEY FEATURES: -Addictive gameplay -Great ball physic -Cool graphic -Great sound effects -Totally free game -Zoom camera effect -Easy control, one touch to play -Easy to start, hard to stop -Hours and hours of fun for all family -Great shooting experience -Easy to control, fun for every age players.","instructions":"Use your mouse to play ","url":"https:\/\/html5.gamemonetize.com\/5y6gjagh93gmo9djb7gy8722p0wlsdb4\/","category":"Soccer","tags":"Ball, Ballon, Basketball, Boy, Boys, endless, Football, Physics, Soccer, Sport, Sports, World","thumb":"https:\/\/img.gamemonetize.com\/5y6gjagh93gmo9djb7gy8722p0wlsdb4\/512x384.jpg","width":"1024","height":"768"},{"id":"27074","title":"Football Legends","description":"Choose your favorite team and join a tournament where only the best fight for the title. Control your favorite player! You can play solo against AI opponents or play with or against your friend.","instructions":"Follow game instructions","url":"https:\/\/html5.gamemonetize.com\/65s7iqle6xe0exlr7a3cs2hmkkabzohw\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/65s7iqle6xe0exlr7a3cs2hmkkabzohw\/512x384.jpg","width":"920","height":"480"},{"id":"27075","title":"Soccer Masters","description":"Choose your favorite team and join a tournament where only the best fight for the title. Control your favorite player! You can play solo against AI opponents or play with or against your friend. Show them real football masters!","instructions":"Folow game instructions","url":"https:\/\/html5.gamemonetize.com\/dxuq5dd43onhpfevqts0cyogbj1uxn8r\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/dxuq5dd43onhpfevqts0cyogbj1uxn8r\/512x384.jpg","width":"920","height":"480"},{"id":"27122","title":"Dream Head Soccer","description":"Jouez 60 secondes de matchs de football bourrés d'action ; celui qui marque le plus de buts gagne ! Frappez, frappez et marquez en utilisant votre héros. Utilisez vos pieds, votre tête et vos super pouvoirs pour marquer des buts. Head Ball offre un gameplay simpliste qui peut être rapidement transformé en jeux passionnants et bourrés d'action. Frappez la balle, frappez votre adversaire, utilisez des en-têtes, des super pouvoirs ou déjouez votre adversaire en les jetant. Tout est permis, à condition de gagner !","instructions":"utiliser les boutons pour aller et pour frapper le ballon","url":"https:\/\/html5.gamemonetize.com\/0cuvhtdevqaudqx6j9spjy0455o7lbed\/","category":"Sports","tags":"2 Player Games, Ball, Ballon, Football, Sport","thumb":"https:\/\/img.gamemonetize.com\/0cuvhtdevqaudqx6j9spjy0455o7lbed\/512x384.jpg","width":"1920","height":"1080"},{"id":"27112","title":"Puppet Soccer - Football","description":"Smash the football and score goals in this addicting pocket puppet soccer 2019 game! Pick your favorite worldcup big head team and play as a famous footballer. Tactically play offense and defense as you ascend the World Cup 2019 ladder!","instructions":"Move sideways and jump with the arrow buttons Perform various kicks with the ball buttons Score more goals in the given time and win the match Climb divisions and unlock all rewards Random match powerups and player emotes are available ","url":"https:\/\/html5.gamemonetize.com\/yuln3nospa45pr41reixpytmu5r0ygy9\/","category":"Soccer","tags":"Football, Game, Games, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/yuln3nospa45pr41reixpytmu5r0ygy9\/512x384.jpg","width":"800","height":"600"},{"id":"24854","title":"Battle Soccer Arena","description":"Enter the green battlefield in this amazing version of the beautiful football game. Play with your friends or against the CPU in a three on three football game between nations of your choice. Neither side has a goalkeeper, so adjust your playing style accordingly and enjoy!","instructions":"SPACE BAR to kick slide ARROWS to move","url":"https:\/\/html5.gamemonetize.com\/37txwsiv746k38gigehe08yrgpuporc7\/","category":"Sports","tags":"2 Player, 2 Player Games, Battle, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/37txwsiv746k38gigehe08yrgpuporc7\/512x384.jpg","width":"1280","height":"720"},{"id":"27212","title":"Crazy Football War","description":"Car battles and football go together in this amazing game! Buckle up and fly through the world's arenas facing different opponents in a championship where only victory matters. Play Crazy Football War now and try to be the best in the world!","instructions":"Computer Arrow keys or WASD Mobile Touch on screen ","url":"https:\/\/html5.gamemonetize.com\/f1at4gwd63ux3msbc8dfggxi02b84ba8\/","category":"Soccer","tags":"Adventure, Arcade, Football, Race, Racing, Soccer","thumb":"https:\/\/img.gamemonetize.com\/f1at4gwd63ux3msbc8dfggxi02b84ba8\/512x384.jpg","width":"1280","height":"720"},{"id":"26916","title":"Santa kick Tac Toe","description":"Play against your friend in 2 player mode or play as Santa against a CPU controlled Grinch, Kick Tac Toe is better than tic tac toe of course. You actually need some skill to win.","instructions":"Swipe to kick","url":"https:\/\/html5.gamemonetize.com\/9lmv8yxi9d6blsblj8q7tlxeui0f3o2p\/","category":"Soccer","tags":"2 Player, Christmas, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/9lmv8yxi9d6blsblj8q7tlxeui0f3o2p\/512x384.jpg","width":"800","height":"600"},{"id":"26588","title":"Golden Boot 2022","description":"Win the golden boot as the top scorer and earn other trophies in the process. Can you pull off a hat trick, can you get it past the defense and the keeper to earn that golden boot trophy.","instructions":"Move with mouse or finger click or lift finger to shoot no need to swipe ","url":"https:\/\/html5.gamemonetize.com\/6lujax20kicvs9hc7p69eshjx4qscgrs\/","category":"Sports","tags":"Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/6lujax20kicvs9hc7p69eshjx4qscgrs\/512x384.jpg","width":"800","height":"600"},{"id":"26035","title":"Lob Master 2021","description":"Exciting soccer action like you've never seen before. Lob it over the keeper, or pass to your teammate so he can score while avoiding numerous defenders and obstacles","instructions":"Mouse or Touch","url":"https:\/\/html5.gamemonetize.com\/1hkj10uxmo9lgstvotv2l2seufuu0s5p\/","category":"Sports","tags":"Arcade, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/1hkj10uxmo9lgstvotv2l2seufuu0s5p\/512x384.jpg","width":"800","height":"600"},{"id":"15148","title":"TOP DRIFT RACING","description":"THE REAL DRIFTING SIMULATOR - Drift Racing gives you a uniquely simple and intuitive experience in handling sport cars - If you like to drift, get ready to spend many hours playing this game - Use the separate handbrake button to start drifting - Burn tires doing donuts - Animation of the thick smoke while drifting","instructions":"Tap to control the car ","url":"https:\/\/html5.gamemonetize.com\/ufvbxu4tq8rhhxmskm3s5ex5eueotd1n\/","category":"Soccer","tags":"drift, drifting, Driving, Halloween, Holiday, Memory","thumb":"https:\/\/img.gamemonetize.com\/ufvbxu4tq8rhhxmskm3s5ex5eueotd1n\/512x384.jpg","width":"800","height":"600"},{"id":"25479","title":"Rocket Soccer Derby","description":"It's possible now to play the Rocket Soccer Derby game in your web browser for free at Superkidgames.com and more fun games. This futuristic racing sports game equips players with demolition derby-like boosted vehicles that can be smashed into the soccer ball for amazing action-packed goals. Breathtaking graphics and ultra-realistic car physics will test your racing soccer skills to the max! Rocket Soccer Derby is a frantic mixture of a soccer game, a card game, and a simulation game in all-in-one. You have to drive around a football pitch and try to score goals against your opponent. You can choose to play a quick game or you can choose to enter the Rocket League. By entering the Rocket League you are joining the competition and you can earn in-game money and cogs to upgrade your car! You start in the Beginners League, but once you've got the hang of it you can quickly promote to the Intermediate League, and maybe you can even reach the Expert League. Give it all and win the league!","instructions":"Drive - WASD Nitro - LShift Jump - Spacebar Change camera - F","url":"https:\/\/html5.gamemonetize.com\/iz49b5s6h2xl6jsxrjxra3kkhm09x972\/","category":"Sports","tags":"3D, 3D Games, Action, Adult, Adventure, Arcade, Boys, Car, Driving, Family, Fun, Girls, Highscore, HTML5, Hypercasual, jump, Kid, Mobile, Race, Rocket, Soccer, Sport, Supercars","thumb":"https:\/\/img.gamemonetize.com\/iz49b5s6h2xl6jsxrjxra3kkhm09x972\/512x384.jpg","width":"800","height":"600"},{"id":"24350","title":"Shoot and goal","description":"It is a game of badges where two players controlled by the player and two others controlled by the UI automatically face each other. The first one that reaches to score 5 goals before his rival wins.","instructions":"You move your players by dragging the mouse from your player to the position you want to emulate The power you decide depending on what you move your player s finger away from further away it will take more strength to reach its goal ","url":"https:\/\/html5.gamemonetize.com\/bvxjwlmhwn2zxe233gts3919hm9diyc9\/","category":"Sports","tags":"Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/bvxjwlmhwn2zxe233gts3919hm9diyc9\/512x384.jpg","width":"960","height":"600"},{"id":"24380","title":"Penalty Power 2021","description":"Play Penalty Power 2021 Game online in your web browser and mobile at Superkidgames.com for free and more html5 games. On our website you can findi and playing some of the best new Cartoon Network soccer games online, and this is because CN has always been very linked with this sport, and considering that the Euro Cup is now ongoing, you can experience it directly through a game such as Penalty Power 2021! Become a great penalty kick shooter, and win the championship! Yes, in this game, instead of focusing on the whole sport of soccer, you are only concentrating on the penalty kicks, where you will both shoot and defend shots as well. You shoot with the captain you pick, and you defend with the goalkeeper you’ve chosen. To do the shooting you use the mouse to swipe in the direction you want to shoot, and with the mouse you also defend, tapping where you think the ball is heading to intercept it. Before the time goes out, score more goals than the other team to win! You will play matches all across Europe, and you can pick your team from characters belonging to shows on Cartoon Network such as DC Superhero Girls, Gumball, Apple and Onion, Mao Mao, We Bare Bears, Teen Titans Go, as well as Craig of the Creek. Fun is waiting for you one click away, so hit play right now, and let it start!","instructions":"Use the mouse ","url":"https:\/\/html5.gamemonetize.com\/kq1du4k7dxbi12vv3lg89mmkp95p139i\/","category":"Sports","tags":"Adventure, Boys, Brain, Cartoon, Cartoon Network, Family, Football, Fun, Game, Girls, Highscore, Mobile, Skills, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/kq1du4k7dxbi12vv3lg89mmkp95p139i\/512x384.jpg","width":"800","height":"600"},{"id":"23907","title":"Pawn Shop Master","description":"Line your business with gold, antique guns, jewelry, art - whatever you can get your hands on to make a profit. Will you become the most famous Pawn Store in the city? In this game, only one person comes out a winner in these traders - and that person is you! Embrace that silver tongue of yours and convince people that they have to make this deal. They are desperate for the money and only you can provide what they are looking for. Let’s make a deal!","instructions":"1 Make the right choice How good are your observational skills Do you have the innate ability to spot the diamond in the rough 2 Many items to Pawn So many unique and cool items for you to buy sell and collect 3 Fun for the whole fami","url":"https:\/\/html5.gamemonetize.com\/ea8c2f9qo4xmo6lx14cth28ofx78w106\/","category":"Soccer","tags":"Boy, Boys, Game, Games, Shopping","thumb":"https:\/\/img.gamemonetize.com\/ea8c2f9qo4xmo6lx14cth28ofx78w106\/512x384.jpg","width":"800","height":"600"},{"id":"23871","title":"Snow Trial","description":"Snow Trial is a new and exciting winter trial game loved by players around the world. It’s time for action! Unlock awesome skier and snowboard characters. Race in fun and challenging single player levels or defeat your opponents in multiplayer mode! Become the greatest extreme athlete ever!","instructions":" Collect 10 free snowboarders and skiers Do insane tricks Learn challenging downhill trial tracks Compete with players from around the world Progress through multiple leagues to the top ","url":"https:\/\/html5.gamemonetize.com\/gyer2gj0tpmv7841mf0hjeayjazwuvby\/","category":"Sports","tags":"Snow, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/gyer2gj0tpmv7841mf0hjeayjazwuvby\/512x384.jpg","width":"800","height":"600"},{"id":"23851","title":"Super Basketball Shooting: Crazy Street Shot Hoops","description":"Ready for the real basketball shooting challenge! Great jump into the super basketball shooting with the realistic physics target practice contest. Here you can gather knowledge about how to shoot a basketball better way and improve your shot techniques. No need to go anywhere for the basketball hoop shoot techniques practice! Here you are challenged to hit the target scores to move onto the next level perfect trick shots and try to beat the highest score. You can learn here your target throwing tricks. The better the players are the longer able to play this game! Play this new basketball hoops dunking master & knockout winning shoots kings game! Download now these best free basketball shootout training games.","instructions":"Super basketball shooting is the professionally shoot a basketball farther sports game Sharp pure shooter is most important in basketball Our game design on the aim ball shooting drills for teaching about the proper elbow plump shots technique This","url":"https:\/\/html5.gamemonetize.com\/66z4o7y5chxdkj9cgcts7qspcf3fwasl\/","category":"Soccer","tags":"Basketball, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/66z4o7y5chxdkj9cgcts7qspcf3fwasl\/512x384.jpg","width":"800","height":"600"},{"id":"23924","title":"Soccer Strike Penalty Kick","description":"Soccer strike penalty kick football super league is real enjoyable football games which you never played before in your life. Face-offs kick in football strike games 2021.challenge the all world soccer star player to done the goal without face any problem during free penalty strike in super league. Kick ball to hit target of goal in limited time to get lot of point and goal save from goalkeeper in real football strike league 2021. show off your goal keeping skill and customize freekick, opponent players, goalkeeper with lot of unlockable players. super league is a new way of real football soccer games. Enjoy a soccer strike penalty kick in different stadiums and get a unique soccer kick.it is a football games fun league which easy to play and easy to enjoy penalty kick football strike.","instructions":"Moder football games match player use an unpredictable strike style for gain the goal Great soccer star player gets goal and up team score in penalty score hero free kick goalkeeper work hard to stop score match football games but you have a experience a","url":"https:\/\/html5.gamemonetize.com\/salgdfl6o84tnsbioeuzqrqxjfppq2o3\/","category":"Sports","tags":"Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/salgdfl6o84tnsbioeuzqrqxjfppq2o3\/512x384.jpg","width":"800","height":"600"},{"id":"23482","title":"Street Basketball Championship","description":"Welcome to the Street Basketball Championship! This exciting sports game was made for the fans of street basketball and people who like sports simulators. Choose your favorite team and play for it, each received point reduces rating opponent. Play this game with your friends and raise your favorite team in the ranking. Shoot the ball in the basket and do not miss, it will increase the multiplier and give more points. Compete with players from around the world and help your favorite team win the championship. Street Basketball game gives a sporting chance to challenge other players from around the world. It's very simple and fun, install this free basketball game and enjoy it!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/ge2y9ca16xzdm6alw5iaxq6nhfd0dq31\/","category":"Sports","tags":"Basketball, Game, Games, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/ge2y9ca16xzdm6alw5iaxq6nhfd0dq31\/512x384.jpg","width":"800","height":"600"},{"id":"23371","title":"Head Ball 2 - Online Soccer Game","description":"Challenge your opponents in Head Ball 2, the most competitive game ever created. It's a fast-paced, exciting multiplayer soccer game. Games are played in 1v1 online soccer matches against real players from all over the world.","instructions":"Shoot hit and score using your hero Use your feet head and superpowers to score goals Head Ball 2 offers simple gameplay that can quickly turn into a hectic and exciting game Hit the ball hit the opposing player make heads superpowers and drive","url":"https:\/\/html5.gamemonetize.com\/gcrq7w6atx2bvxwwg7r6itufhcrtpgzg\/","category":"Sports","tags":"2 Player, 2 Player Games, Football, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/gcrq7w6atx2bvxwwg7r6itufhcrtpgzg\/512x384.jpg","width":"800","height":"600"},{"id":"17677","title":"Race.io","description":"\"Race.io\" gets really addictive and challenging game as you start playing it and keep making progress. Make insane jumps and challenge your opponents.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/tpu1prgl1wtt9shgpnjnl1ugz34ojz5d\/","category":"Soccer","tags":".io Games, Game, Games, Race, Racing","thumb":"https:\/\/img.gamemonetize.com\/tpu1prgl1wtt9shgpnjnl1ugz34ojz5d\/512x384.jpg","width":"800","height":"600"},{"id":"23412","title":"Pong Ball Game ","description":"\"Arcade Soccer Pong\" mode added. Now you can play ping-pong with obstacles - namely, rocks - on the field! Game becomes unpredictable and challenging. Or you can collect coins, to get best score. Or you can mix it. Anyhow, this definitely changes your pong-ball experience to better and will add more fun to the game. Go to \"Options\" and visit \"Game Mode\" tab: use scrollbar to pick either original pong-ball mode or arcade taste. By default, \"classic\" ping pong soccer mode is selected. When selecting \"arcade\", you will get an option to also adjust flavor - if to have rocks on the field (and how many of them) and if to show coins, available for collection. To pick coins, make sure the ball hits it.","instructions":"Extra easy control just put your finger on the left side of your phone s screen where your gates are in game and swipe finger up or down to ensure enemy can t score a goal - and tricking AI with the direction ball will fly once deflected ","url":"https:\/\/html5.gamemonetize.com\/0g0rvlq9qp5umlaut1k4qr650e0r9io6\/","category":"Soccer","tags":"Soccer","thumb":"https:\/\/img.gamemonetize.com\/0g0rvlq9qp5umlaut1k4qr650e0r9io6\/512x384.jpg","width":"800","height":"600"},{"id":"23574","title":"SuperStar Soccer","description":"International SuperStar Soccer choose your own team from among 20 teams with tough opponents and reach the championship by completing challenging matches! Use arrows to move and jump and tap space or x button to shoot the ball. Play against powerful teams and try to win the legue","instructions":"arrows to move and jump x and space to shoot","url":"https:\/\/html5.gamemonetize.com\/6j1o8v3aunm0vmmkx2cwhqdhpa83lkmd\/","category":"Sports","tags":"Ball, Ballon, Best, Clicker, Football, Hot, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/6j1o8v3aunm0vmmkx2cwhqdhpa83lkmd\/512x384.jpg","width":"800","height":"600"},{"id":"23365","title":"Toon Cup 2021","description":"Football is back and its bigger than ever! Play Toon Cup 2021, the totally free football game! Have fun choosing your favourite Cartoon Network characters such as Darwin from The Amazing World of Gumball, Grizz from We Bare Bears and Apple from Apple & Onion. Master your skills and work with your team to score goals and fight your way to the top of the leader board in the biggest Toon Cup Tournament yet! You can also find more games at superkidgames.com, pick up one and have fun! CREATE A TEAM Build an unbeatable team by carefully selecting players based on their stats and powers. This year Toon Cup welcomes brand new players including Jessica from Craig of the Creek, Elliott and Mo from Elliott From Earth and Beast Boy from Teen Titans Go! There are loads of characters to choose from including: · Batgirl and Wonder Woman from DC Super Hero Girls · Craig and Kelsey from Craig of the Creek · Four arms and XLR8 from Ben 10 · Cyborg and Raven from Teen Titans Go! · Apple and Onion from Apple & Onion · Finn and Jake from Adventure Time · Darwin and Anais from The Amazing World of Gumball · Blossom and Bubbles from The Power Puff Girls · Panda and Ice Bear from We Bare Bears · Badgerclops from Mao Mao: Heroes of Pure Heart CHOOSE YOUR COUNTRY Choose from a world wide roster of countries to compete in the Toon Cup championship for a chance to become a football world champion! Play games and score goals to earn points and fight your way to the top of the football leaderboard. SCORE GOALS The aim of the game is to score goals while defending your own net. Don't be fooled, scoring might not be as simple as it seems with the opponents ruthless goal keeper! Tackle, dribble, pass and shoot to be in with a chance of winning! Look out for the awesome power-ups that drop during the game too - they can give your team members a vital boost (or cause them problems if your opponent gets them)! Banana Slip and a Super Speed are among the many power ups to discover. PLAY TOON LEAGUES Discover brand new game play mode Toon Leagues. Create a team and play against Super Squads! Win matches to earn points and complete the different Leagues! Each League has its own awesome trophy - can you win them all? UNLOCK FOOTBALLS, STADIUMS AND CHARACTERS There are tones of awesome unlockables to choose from including stat upgrades, themed stadiums and loads of footballs! Not to mention you can unlock exclusive characters like brand new Elliott from Elliott From Earth! COMPLETE DAILY CHALLENGES With loads of unlockables to choose from, you're going to need extra coins! Complete daily challenges to earn coins. You can also find more games at superkidgames.com, pick up one and have fun!","instructions":"Build an unbeatable team by carefully selecting players based on their stats and powers This year Toon Cup welcomes brand new players including Jessica from Craig of the Creek Elliott and Mo from Elliott From Earth and Beast Boy from Teen Titans Go ","url":"https:\/\/html5.gamemonetize.com\/1hsxhoce2s1g11nbze04xn6gahh5nztm\/","category":"Sports","tags":"Adventure, Cartoon, Cartoon Network, Football, Fun, Game, HTML5, Mobile, Soccer, Sport, Superhero, World","thumb":"https:\/\/img.gamemonetize.com\/1hsxhoce2s1g11nbze04xn6gahh5nztm\/512x384.jpg","width":"800","height":"600"},{"id":"22307","title":"Subway Surfers SpaceStation","description":"The Subway Surfers SpaceStation! - Experience unique architecture and dazzling beaches - Team up with Sofia and unlock her brand new Tango outfit - Take a trip through the colorful streets on the cool Roto board - Search for shiny horse shoes to win the Weekly Hunt prizes","instructions":"DASH as fast as you can ","url":"https:\/\/html5.gamemonetize.com\/c5p4bszdjsvoz0ta2joxl020ou6qytv5\/","category":"Soccer","tags":"Race, Racing, run, running, subway, Subway Surfers","thumb":"https:\/\/img.gamemonetize.com\/c5p4bszdjsvoz0ta2joxl020ou6qytv5\/512x384.jpg","width":"800","height":"600"},{"id":"22631","title":"Soccer Heroes","description":"Show all your skill in this football game. Choose your dream team and get into the fast-paced football action where you control um jogador. You can score goals with just a swipe of your finger or mouse. You are in charge of both the offense and the defense in this game, so you have to be quick to gain the upper hand.","instructions":"Touch and drag your player to move Use your player to attack and defend the goal ","url":"https:\/\/html5.gamemonetize.com\/5q6dqaiwdp1k8ycfxp58xrhlveeq02z8\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/5q6dqaiwdp1k8ycfxp58xrhlveeq02z8\/512x384.jpg","width":"720","height":"1280"},{"id":"22507","title":"World Cup 2018","description":"Here is a small game that will allow anyone who wants to take part in an exciting competition - the football penalty shootout world championship. It's simple, to win you have to score as many goals as possible and concede as few goals as possible. To win the cup, you will have to defeat, one after another, seven national teams. Try to do it on the first try and with the maximum score.","instructions":"To win the cup you will have to defeat one after another seven national teams ","url":"https:\/\/html5.gamemonetize.com\/788ltur7jk2dg6kbum6fusmkji04w64n\/","category":"Sports","tags":"Ball, Ballon, Football, HTML, HTML5, Shoot, Skill, Skills, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/788ltur7jk2dg6kbum6fusmkji04w64n\/512x384.jpg","width":"800","height":"600"},{"id":"22387","title":"ARIEL MISSING ERIC","description":"Eric and Ariel is a lovely couple Eric is going to another country for stydy and Ariel will miss him so much Rapunzel and Cinderella try their best to make her feel a little bit happier They have a great plan called Mermaid cheer up All of them are going to go shopping dressing up and dancing all night Fun isnt it","instructions":"","url":"https:\/\/html5.gamemonetize.com\/88lfis9qrt1wen0ad5wwdq9dip5qkfy6\/","category":"Soccer","tags":"Dress Up, Fashion, Girl, Girls, Princess","thumb":"https:\/\/img.gamemonetize.com\/88lfis9qrt1wen0ad5wwdq9dip5qkfy6\/512x384.jpg","width":"800","height":"600"},{"id":"22372","title":"Flappy Football ","description":"Flappy Football is a highly addictive hyper casual soccer game. It has 2 game modes, in the story mode you can win 7 international tournaments. The endless mode will challenge your sync skills. Tap to impulse the ball, beat your rivals, dodge all obstacles and score epic goals.","instructions":"Click tap anywhere in the screen to make the ball jump ","url":"https:\/\/html5.gamemonetize.com\/y4i6s1bvbxfluom1ph9gt2o81p0z98tr\/","category":"Sports","tags":"Football, Soccer, Spongebob","thumb":"https:\/\/img.gamemonetize.com\/y4i6s1bvbxfluom1ph9gt2o81p0z98tr\/512x384.jpg","width":"800","height":"600"},{"id":"21719","title":"Bubble Shooter - puzzle","description":"Put your strategy skills to the test! Compete against friends and family and see who can reach the highest score and get 3 stars on every level. Earn coins while you play and use them to get cool boosters. Use your logic and puzzle-solving skills to complete the missions and clear the board, and make sure to collect special daily bonuses.","instructions":"Try the Puzzle Game Mode and Discover the Ultimate Bubble Popping Fun This shooter is a thrilling balloon popper free app with thousands of challenging puzzles to master Shoot the colorful balls to advance to the next amazing puzzle level train","url":"https:\/\/html5.gamemonetize.com\/6lfjdkrujhim8t417hsjv8r9a18f9yfo\/","category":"Stickman","tags":"Bubble Shooter, Game, Games, Puzzle, Shoot, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/6lfjdkrujhim8t417hsjv8r9a18f9yfo\/512x384.jpg","width":"800","height":"600"},{"id":"21684","title":"Swimming Pool Race","description":"Welcome to water sports swimming tournament! Are you going to win? Practice water sports in a realistic 3D environment! Do your best in different athletic events and have fun with Swimming Pool Race in 3D! Be ready for an impetuous rush and try different relays from 100 meters to 400 meters using different swimming styles – breaststroke, front crawl, backstroke, butterfly stroke and a freestyle! Swim fast and do anything to win the contest!","instructions":"Ultimate water sports swimming simulator try different distances from 100 meters to 400 meters and different swimming styles backstroke butterfly freestyle forward crawl and breaststroke Wide range of countries and athletes to choose try uniqu","url":"https:\/\/html5.gamemonetize.com\/430jcb70x6rut4cp61af9bx58stsx3q2\/","category":"Sports","tags":"Game, Games, Race, Sports","thumb":"https:\/\/img.gamemonetize.com\/430jcb70x6rut4cp61af9bx58stsx3q2\/512x384.jpg","width":"800","height":"600"},{"id":"19566","title":"Kopanito All Stars Soccer","description":"Control in the game \"Football Heads\" on the computer is carried out using the arrows of the keyboard, and on the touch screens using taps. Your goal in Football Heads is to score as many goals as possible in the allotted time and win the match. Perform different kicks with the ball buttons. Climb the divisions and unlock all the rewards. Random bonuses and player emotions are available.","instructions":"Climb the divisions and unlock all the rewards Random bonuses and player emotions are available ","url":"https:\/\/html5.gamemonetize.com\/a7wztnzkt033ssit6nact2setujcnztx\/","category":"Sports","tags":"3D, 3D Games, Ball, Ballon, Football, HTML, HTML5, Shoot, Shooting, Sport, Sports, Unity3D, World","thumb":"https:\/\/img.gamemonetize.com\/a7wztnzkt033ssit6nact2setujcnztx\/512x384.jpg","width":"800","height":"600"},{"id":"21516","title":"Basketball Master-Star Splat","description":"Grab a real 3D ball to start your dunking legend! Just dunk to see if you can be the MVP! Dunk MVP is a very hot dunking game! Shot to get points as much as possible, challenge yourself in time-limited mode. Earn three-points and improve your ranking! It’s time to dunk!","instructions":"How to play - Tap and release But need to practice your dunk skill - Adjust the shooting angle by dragging the ball ","url":"https:\/\/html5.gamemonetize.com\/nmtu49tbw26ldzc8fxybs33abn4u7qce\/","category":"Sports","tags":"Basketball, Game, Games, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/nmtu49tbw26ldzc8fxybs33abn4u7qce\/512x384.jpg","width":"800","height":"600"},{"id":"19938","title":"Skate Rush","description":"Skate and scoot with the Cartoon NEtwork gangs as they try to rush to the finish line. Upgradable such as top speed after each race, so collect as much coins as you can. WIll you be able to unlock all the playable characters? Playable on Mobile and Tablets.","instructions":"Arrow keys in keyboard to play ","url":"https:\/\/html5.gamemonetize.com\/wu3h7zycjvrvkduxsu5z57kengfm9mr5\/","category":"Soccer","tags":"Cartoon, Cartoon Network, Games, HTML5, Online","thumb":"https:\/\/img.gamemonetize.com\/wu3h7zycjvrvkduxsu5z57kengfm9mr5\/512x384.jpg","width":"800","height":"600"},{"id":"10641","title":"BrawlBall.io","description":"BrawlBall.io is a fast-paced multiplayer football (soccer) game where you must be a team player and have the skill to climb the trophy leaderboards! You must log in with Discord to save your weekly trophies. Join a random team based on your trophies, or CREATE A TEAM and invite your friends to play against others!","instructions":"WASD to MOVE Mouse to AIM direction Click to SHOOT or TACKLE","url":"https:\/\/html5.gamemonetize.com\/et2nkq3z0j1ynuoj1h7ws22a746yp6g4\/","category":"Soccer","tags":".io, .io Games, Action, Football, Multiplayer, Soccer","thumb":"https:\/\/img.gamemonetize.com\/et2nkq3z0j1ynuoj1h7ws22a746yp6g4\/512x384.jpg","width":"800","height":"600"},{"id":"20591","title":"Fifa World Cup 2021 : Free Kick","description":"Fifa World Cup 2021 : Free Kick , win the champions league and be a hero of fifa soccer game","instructions":"mouse","url":"https:\/\/html5.gamemonetize.com\/rki5j8np5pawajw663uwqsiy9mblx8lp\/","category":"Soccer","tags":"2 Player, Football, Shoot, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/rki5j8np5pawajw663uwqsiy9mblx8lp\/512x384.jpg","width":"720","height":"1280"},{"id":"20630","title":"Copa America 2021","description":"Copa America 2021, the South American soccer\/football tournament. Pick your favorite team and bring the championship to your country","instructions":"Mouse or Finger ","url":"https:\/\/html5.gamemonetize.com\/k1orda4ozayeomp9aujirw4yqnuwxebh\/","category":"Sports","tags":"Football, HTML5, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/k1orda4ozayeomp9aujirw4yqnuwxebh\/512x384.jpg","width":"960","height":"540"},{"id":"20063","title":"Penalty EURO 2021","description":"Choose one of your favorite football teams from around the world to defend your goal in this exciting sports game \"Penalty: European Cup 2021\"! try it and score a goal right now!","instructions":"on the PC is carried out with the mouse and on touch screens with taps","url":"https:\/\/html5.gamemonetize.com\/31e95dommfqc3ktoz7x5pzuegah3vo8y\/","category":"Sports","tags":"Ballon, Football, HTML5, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/31e95dommfqc3ktoz7x5pzuegah3vo8y\/512x384.jpg","width":"800","height":"600"},{"id":"19537","title":"Super Soccer  Shooter","description":"Super Soccer Shooter game sport soccer has a lot of success review and player this MONTH that significantly improves overall game performance, especially on mobile phones. To play the game just touch the screen buttons if you use a mobile device.","instructions":"Touche screen Controls sport soccer","url":"https:\/\/html5.gamemonetize.com\/a7ypkqik2ym0hzg44792z2w7wohgq6w1\/","category":"Sports","tags":"Bounce, Boy, Boys, Bubble Shooter, Clash, Food, Football, Kid, Kids, Platform, Shoot, Shoot 'Em Up, Shooter, Shooting, Soccer, Spongebob, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/a7ypkqik2ym0hzg44792z2w7wohgq6w1\/512x384.jpg","width":"800","height":"600"},{"id":"19804","title":"Touchdown Hero Master","description":"The exciting experience becomes an American football player, who throws the ball as far as possible. become number one quarterback thrower. Reach as far as you can to unlock upgrades that makes you even stronger.","instructions":"-Easy one tap control -Unique environment -Play anywhere anytime","url":"https:\/\/html5.gamemonetize.com\/mlngnavogzxztxr6tpq7ofvn7w5xfd72\/","category":"Sports","tags":"Boy, Cartoon, Christmas, Football, Girl, Hypercasual, Soccer, Sport, Superhero","thumb":"https:\/\/img.gamemonetize.com\/mlngnavogzxztxr6tpq7ofvn7w5xfd72\/512x384.jpg","width":"460","height":"600"},{"id":"18531","title":"Soccer","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/firaerwte93572uccuhbrn2kxxyy29zi\/","category":"Sports","tags":".io, 2D, 3D, Action, Adventure, Animal, Anime, Arcade, Army, Baby, Balance, Ball, Ballon, Barbie, Ben 10, Bike, Bomb, Bounce, Boy, Boys, Bubble, Bubble Shooter, bus, Car, Cars, Cartoon, Cartoon Network, Cat, city, Classic, Clicker, Color, Crazy, Defense, Design, Dora, Dragon, Dragon Ball Z, Dress Up, Driving, Family, Fashion, Fight, Fighting, Fire, Flight, Football, Funny, Game, Games, Girl, Gun, Kid, Kids, Kill, Killing, Love, Mario, Memory, Minion, Monster, Moto, Ninjago, Shooter, Shooting, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/firaerwte93572uccuhbrn2kxxyy29zi\/512x384.jpg","width":"800","height":"600"},{"id":"19602","title":"Euro 2020 ( 2021 )","description":"Play the Euro 2020 free kick edition, choose from 10 of the best teams and take them to the championship glory","instructions":"Mouse or touch to kick and defend","url":"https:\/\/html5.gamemonetize.com\/afsdceo148sxpldq92poqda4jnauoe0z\/","category":"Sports","tags":"Football, HTML5, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/afsdceo148sxpldq92poqda4jnauoe0z\/512x384.jpg","width":"960","height":"600"},{"id":"18558","title":"girl and boy football","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/5kkl48n1ta0uq5he7n62cz5a7ywuixrn\/","category":"Soccer","tags":".io, 2 Player, 2D, 3D, Action, Adventure, Animal, Anime, Arcade, Army, Baby, Balance, Ball, Ballon, Barbie, Ben 10, Bike, Bomb, Bounce, Boy, Boys, Bubble, Bubble Shooter, bus, Cake, Car, Cars, Cartoon, Cartoon Network, Cat, Christmas, city, Classic, Color, Coloring, Crazy, cut, Defense, Dragon, Dragon Ball Z, Draw, Dress Up, Driving, Family, Fashion, Fight, Fighting, Fire, Flight, Football, Funny, Girl, gta, jump, Jumping, Kid, Kids, Kill, Killing, King, Mario, Memory, Minecraft, Minion, Monster, Moto, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/5kkl48n1ta0uq5he7n62cz5a7ywuixrn\/512x384.jpg","width":"800","height":"600"},{"id":"18859","title":"Goal Kick 3D","description":"Dribble, shoot and score! Overtake your opponents, move swiftly and shoot goals! Dribble, pass and kick. Real football experience complete with easy controls and enjoyable movements.","instructions":"Simple gameplay with efficient and easy to learn controls ","url":"https:\/\/html5.gamemonetize.com\/s1d2sdegktj9bgt7r3tcjgtszqd4s1gl\/","category":"Sports","tags":"Arcade, Casual, Football, Hypercasual, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/s1d2sdegktj9bgt7r3tcjgtszqd4s1gl\/512x384.jpg","width":"380","height":"600"},{"id":"19315","title":"Merge Puppet Soccer: Headball Star Soccer‏","description":"Have you got the soccer talent? Skills and speed? Lace up your sock puppet boots and pull your shirt on: this game was made for you. So, enjoy it. Pick your team, play as your favorite sock puppet and score as many goals as you can! Pass, shoot, dribble, foul - it’s all here. The game is full of twists. Play in single player mode or team up with a friend for the awesome 2-player mode – you can play with your friend. Who will be better and give better place of the charts? Game is completely customizable – 4 different control options to make sure the user experience is the best. Destroy your opponent with precise kicks. Change your team tactics from defense style to winger or offensive strategy and all at the same time. The goals will increase their size to speed up the match progress in the overtime.","instructions":"WSDA JUMP Spacae Shout Mouse Click","url":"https:\/\/html5.gamemonetize.com\/u97a17m6y2lqas6d7bv3zzkv40eqw42r\/","category":"Sports","tags":"2D, Arcade, Ball, Football, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/u97a17m6y2lqas6d7bv3zzkv40eqw42r\/512x384.jpg","width":"900","height":"600"},{"id":"18273","title":"Head Ball Soccer","description":"Challenging 1vs1 online matches! Strike, score, and be a soccer champion!","instructions":"Simple gameplay with efficient and easy to learn controls ","url":"https:\/\/html5.gamemonetize.com\/nss6zr81p8hfm8em5g2xyq0jqq9quq1h\/","category":"Sports","tags":"2D, Arcade, Football, Game, Online, Puzzle, Quiz, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/nss6zr81p8hfm8em5g2xyq0jqq9quq1h\/512x384.jpg","width":"854","height":"480"},{"id":"18172","title":"American Football Runner","description":"American Football Runner ! new Run and Sports Hyper casual Game with Ultimate fun , your goal is Collect ball and run to pass the Your Team Mate and Avoid Obstacles and Rivals to Reach Destination to Have Fun .","instructions":"Tap and Swipe to run throw the ball to Team Mate and reach destination by avoid obstacles and opponents","url":"https:\/\/html5.gamemonetize.com\/k02ictnz0z0ayid0xxeupj08t7e8lzw5\/","category":"Sports","tags":"3D, Casual, Football, Hypercasual, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/k02ictnz0z0ayid0xxeupj08t7e8lzw5\/512x384.jpg","width":"400","height":"600"},{"id":"18171","title":"Crazy Touchdown 3D","description":"Hit and Dodge the opponents to reach touchdown! Super cool game on NFL, the most loved sport worldwide. If you are taken down by the opponents, you have 2 other team mates to help you pass through them.","instructions":"Simple gameplay with efficient and easy to learn controls ","url":"https:\/\/html5.gamemonetize.com\/7crkfoktbo9kwdof8ecnkrzo2g6c3tnb\/","category":"Sports","tags":"3D, Crazy, Football, Game, Online, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/7crkfoktbo9kwdof8ecnkrzo2g6c3tnb\/512x384.jpg","width":"960","height":"600"},{"id":"18098","title":"DRIFT RACING - RACING","description":"Fast action drifting with your car around an endless race track.How far can you go?","instructions":"Tap to control the car ","url":"https:\/\/html5.gamemonetize.com\/i9jruya2miqcrn0hvqstcdy2w0ztgp2z\/","category":"Soccer","tags":"drift, drifting, Race, Racing","thumb":"https:\/\/img.gamemonetize.com\/i9jruya2miqcrn0hvqstcdy2w0ztgp2z\/512x384.jpg","width":"800","height":"600"},{"id":"17961","title":"Soccer Kick Ball","description":"Soccer Kick Ball game in the style of Pinball Game. Use the Striker to get the ball on the screen and get points! kick the ball into the goal post and win this game!!","instructions":"Use Mouse Or keyboard To Play","url":"https:\/\/html5.gamemonetize.com\/ehoki50oc7tomvrbft0kd4g0blinjd0x\/","category":"Sports","tags":"Ball, Football, Game, Online, Soccer","thumb":"https:\/\/img.gamemonetize.com\/ehoki50oc7tomvrbft0kd4g0blinjd0x\/512x384.jpg","width":"1280","height":"720"},{"id":"17958","title":"Shoot Goal","description":"Score Goals with the Power of your Finger! Just the Best of Soccer Games!","instructions":"Use Mouse Or keyboard To Play","url":"https:\/\/html5.gamemonetize.com\/50plb44qh0l221tia0u4xdd1ogt0uq2z\/","category":"Sports","tags":"Football, Game, Online, Shoot, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/50plb44qh0l221tia0u4xdd1ogt0uq2z\/512x384.jpg","width":"720","height":"1280"},{"id":"17944","title":"Head Ball - Online Soccer Game","description":"Challenge your opponents in Head Ball 2, the most competitive game ever created. Head Ball 2 is a thrilling and fast-paced multiplayer soccer game. Take place in 1v1 online soccer matches against real opponents from all around the world.","instructions":"Use Mouse Or keyboard To Play","url":"https:\/\/html5.gamemonetize.com\/35of1bqu47ak4cf3juasckn0f083w9i0\/","category":"Sports","tags":"Ball, Football, Game, Online, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/35of1bqu47ak4cf3juasckn0f083w9i0\/512x384.jpg","width":"854","height":"480"},{"id":"17841","title":"Among Ball : Bounce Ball","description":"Be Bounce Ball Hero defeat all the evil squares in among ball adventure.","instructions":"Use Mouse Or keyboard To Play","url":"https:\/\/html5.gamemonetize.com\/spa2uaekkcm1xcfu0vq3ohcyu5ja3vyv\/","category":"Soccer","tags":"Adventure, Ball, Ballon, Bounce, Side Scrolling","thumb":"https:\/\/img.gamemonetize.com\/spa2uaekkcm1xcfu0vq3ohcyu5ja3vyv\/512x384.jpg","width":"1280","height":"720"},{"id":"17840","title":"Flying football- Flapper Soccer Game","description":"Play flap football game with flappy type, tap to jump and fly football to avoid pipes. Now, challenge with the best football flying game is here. Let patience to make a goal. Tap to keep the little football flapping its tiny wings. Keep the little ball flapping its tiny wings by tapping on your phone screen! Don’t let the tweety ball falls down or touch the pipes.","instructions":"Tap to fly jump the football keep to flying and have a fun time with the Flying football - Flapper football Game This game is easy to play but hard to control let patience ","url":"https:\/\/html5.gamemonetize.com\/3qm6lf1n9x07guifzegpkuohz09kjb1m\/","category":"Sports","tags":"fly, Football, Game, Highscore, jump, Jumping, Online, Soccer","thumb":"https:\/\/img.gamemonetize.com\/3qm6lf1n9x07guifzegpkuohz09kjb1m\/512x384.jpg","width":"1280","height":"720"},{"id":"17839","title":"cute the road","description":"cute the road is about racing traffic, avoiding trains, collecting cars and most importantly having fun. Collect coins, open prize boxes to get new cars and complete collections! Drive at full speed to score big and be the #1","instructions":"- Gorgeous voxel art graphics - 4 worlds to choose from - 55 different vehicles to drive Taxi Tank Ufo Police Car Army 4x4 Dragster Monster Space Shuttle Motorbikes Boats and so much more - Crash time","url":"https:\/\/html5.gamemonetize.com\/430ppdc9shxy80a07dxjlx675d00bz4g\/","category":"Soccer","tags":"1 Player, Adventure, Boys, Funny","thumb":"https:\/\/img.gamemonetize.com\/430ppdc9shxy80a07dxjlx675d00bz4g\/512x384.jpg","width":"800","height":"600"},{"id":"12720","title":"Gun Master  : pro du tir","description":"If you like action movies and games with invincible assassins, then Gun Master is for you! Take on the challenge and attack all your rivals to cover yourself in glory. In Gun Master, show that you are a professional, the best of the best secret agents! At the beginning of the game, a horde of robots attacks you. To survive, kill every last one of them with your gun! Don't forget the hostages... These robots are hardened criminals who have locked up their victims. Defeat them all to save the captives and become a hero!","instructions":"aim at the bad guys and shoot them ","url":"https:\/\/html5.gamemonetize.com\/p0h8kzuubuvm4ksjlvbd6gqb7oj5pome\/","category":"Soccer","tags":"Action, Gun, Shoot, Shooting","thumb":"https:\/\/img.gamemonetize.com\/p0h8kzuubuvm4ksjlvbd6gqb7oj5pome\/512x384.jpg","width":"800","height":"600"},{"id":"15841","title":"Beat Roller","description":"Are you a music-maker? Do you like amaze music game and some challenges while you enjoy your weekend? Then BEAT ROLLER is the Amanotes arcade music game for you!","instructions":"Are you a music-maker Do you like amaze music game and some challenges while you enjoy your weekend Then BEAT ROLLER is the Amanotes arcade music game for you ","url":"https:\/\/html5.gamemonetize.com\/2ba8a95bdcq013etqhaa4n53z3r5upux\/","category":"Soccer","tags":"1 Player, Funny","thumb":"https:\/\/img.gamemonetize.com\/2ba8a95bdcq013etqhaa4n53z3r5upux\/512x384.jpg","width":"800","height":"600"},{"id":"17837","title":"KickAround Live","description":"KickAround Live is a skill-based multiplayer football game. Dribble, pass, head or loft the ball to score a goal. There can be from 1 to 8 people per match!","instructions":"Move WASD or arrow keys Dash spacebar ctrl shift Pass the ball Head Tackle left mouse button Loft ball Switch Player right mouse button Tackle or Jump middle mouse button Zoom mouse wheel Toggle Chat Tab","url":"https:\/\/html5.gamemonetize.com\/mom5khuvflfzz3arwps4knbzjrlmhag3\/","category":"Soccer","tags":".io, .io Games, Skill, Soccer, WebGL","thumb":"https:\/\/img.gamemonetize.com\/mom5khuvflfzz3arwps4knbzjrlmhag3\/512x384.jpg","width":"1000","height":"700"},{"id":"15027","title":"Super Pong Ball ⚽ Soccer like Ping-Pong game","description":"Play crazy table soccer with fast paced gameplay and enjoy the awesome classic Pin Pong recast as a soccer game offline. Choose your pud and a football ball from more than 10 different skins. Pass all 22 Levels of cool soccer game. Make sure you Catch the ball by moving your paddle left and right, and bounce the ball back to your opponent's side of the soccer pitch. Try to shoot the ball past your opponent and through the goal posts. Take on your opponents in easy football one touch game and win every round of this one-on-one soccer tournament. Tests your football skills to move a crazy ball toward the goal. Kick the ball and score your goal in this FREE football \/ soccer game!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/em9mvp76n164v7hd3p5zhwhvk5vevk49\/","category":"Sports","tags":"Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/em9mvp76n164v7hd3p5zhwhvk5vevk49\/512x384.jpg","width":"800","height":"600"},{"id":"17988","title":"Bicycle Kick Master","description":"The most awesome kick in all of sports ( soccer definitely ) The bicycle kick, so a game where you try to beat the keeper and a defender by shooting only bicycle kicks. Cut out all the nonsense and go for the best action on every kick.","instructions":"Mouse to move click to kick on mobiles move with finger lift finger to kick 9 no need to swipe ","url":"https:\/\/html5.gamemonetize.com\/oonsdaa12i0e2xf7096c318el03ayh0m\/","category":"Sports","tags":"Arcade, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/oonsdaa12i0e2xf7096c318el03ayh0m\/512x384.jpg","width":"600","height":"650"},{"id":"17308","title":"Top Scribble Rider!","description":"Draw and then racing! you must draw wheels first.Make sure to draw a new pair every time, different challenges need diverse shapes of the wheels.Race fast and get through all the levels successfully!","instructions":"Draw your wheels to win the race ","url":"https:\/\/html5.gamemonetize.com\/kl1s5caltsc6k63b3387ul1wss6jxlai\/","category":"Soccer","tags":"Draw, Mobile, Racing","thumb":"https:\/\/img.gamemonetize.com\/kl1s5caltsc6k63b3387ul1wss6jxlai\/512x384.jpg","width":"800","height":"600"},{"id":"17692","title":"Basket Fall","description":"Touch to cut the rope. Cut the rope to release the ball. Aim for the hoop to win! - Basket Fall Motto","instructions":"The award-winning team behind Duet brings you a crazy basketball game - A host of characters - Great boosts springs and magnets - Exciting challenges ","url":"https:\/\/html5.gamemonetize.com\/1sz72a0gm2ufahansvrhlwek3j48nbhp\/","category":"Sports","tags":"Basketball, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/1sz72a0gm2ufahansvrhlwek3j48nbhp\/512x384.jpg","width":"800","height":"600"},{"id":"16890","title":"The SpaceCraft Alien Abduction Game","description":"An alien invasion has taken place in a quiet city. The streets became a deadly arena. Only one question remains. Who is going to be the last UFO standing? Show the galaxy who’s the boss by pulling everything and everyone into your starship! Game Modes Classic mode: The invasion has never been so ruthless! You and the other aliens might compete to eat everything in your way as fast as you can. The more you eat, the bigger you get, but only one alien will be crowned as king! Eliminate the other invaders by tracking them down and abducting them too, but watch out for not getting sucked by other spacecraft in your way to the top. Friendly mode: Invading planets and abducting everything is always funnier when you are in a friendly mood. Play in Friendly mode with no competition, just spread the chaos for fun with your alien buddies. Solo mode: Wanna practice for your next invasion? In this mode, you will have the entire map just for you. No hurries, just you, cars, trees and some terrified citizens ready for abduction. Time Attack mode: Feeling sharp? Or have to go back to your galaxy before the dinner goes out? What about a quick invasion? In this mode, you’ll have 90 seconds to pull the entire city. Can you do it? Going out in your ufo for an invasion had never been so funny. Be a part of the most fearless alien horde of all times. Join this adventure right now! If you like to play alien games including shooter and invasion, then you will surely love this multiplayer alien game. Don't think of this as a simple pinball game, rather think of simulating the existence of an alien space jet with mission invasion earth as the goal. It's time for apocalypse for mankind. Be the best of alien invaders and show power of your rangers. The battle has begun and you have to be there till the end of the alien war on earth. Fight to death and pull everything that you see. The human army can do nothing in front of the massive number and technology of the alien army. Mission Invasion Earth is bound to be successful so show everyone who’s the boss.","instructions":"The battle has begun and you have to be there till the end of the alien war on earth Fight to death and pull everything that you see The human army can do nothing in front of the massive number and technology of the alien army Mission Invasion Earth is","url":"https:\/\/html5.gamemonetize.com\/zbdh11pg22k2l5r2mcq7xt9ycdsyps0o\/","category":"Soccer","tags":".io, .io Games, 1 Player, 2 Player, 2 Player Games, 2D, 3D, Action, Animal, Chicken","thumb":"https:\/\/img.gamemonetize.com\/zbdh11pg22k2l5r2mcq7xt9ycdsyps0o\/512x384.jpg","width":"800","height":"600"},{"id":"15621","title":"Ninja Race - Multiplayer","description":"Ninja Race is a live, multiplayer racing game featuring unique Ninja Characters. You'll race against three real people, including your Facebook friends and random opponents.","instructions":" Race real people Compete in real-time","url":"https:\/\/html5.gamemonetize.com\/01mwtn8nlpch0bzjx6ywd8kqtp85h3yh\/","category":"Soccer","tags":"1 Player, Adventure, Boy, Funny, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/01mwtn8nlpch0bzjx6ywd8kqtp85h3yh\/512x384.jpg","width":"800","height":"600"},{"id":"15866","title":"Crazy Dodge","description":"Have you ever wondered how to get Escape from the Gears? Are you a real PLayer? Become a real Player tycoon by managing your Player and protect yourself from the Gears. Expand your Best Time by not hitting with the gear and boost yourself. Discover the new record of Best Time Surviving in the game and show off to your Friend for getting more Notorious in front of them.","instructions":" 1 One of the best time pass games 2 Geniously an interesting gameplay 3 A New truly Unique Game on the Internet 4 Protect Yourself Plane from the Gears 5 OPTIMIZED FOR MOBILE 6 Have fun and amaze your friends 7 100 free game ","url":"https:\/\/html5.gamemonetize.com\/jtq0chkf73xphhvlfo57u1srrzas64yq\/","category":"Soccer","tags":"1 Player, Funny, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/jtq0chkf73xphhvlfo57u1srrzas64yq\/512x384.jpg","width":"800","height":"600"},{"id":"13132","title":"Football World League Cup penality Final Kicks","description":"Footbal penality final kick of European Champions League - a game that allows you to become a part of this epic event: Club World Cup Final. it will be attended by the best football dream clubs and super star football players. You can prove that you are not inferior in skill, being soccer stars.","instructions":" When shooting adjust position height and strength of the shot When goalkeeping tap on the target that will appear shortly before the opponent makes a shot ","url":"https:\/\/html5.gamemonetize.com\/v75asjz7fqch33i2qgkxzyruk6eydf19\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/v75asjz7fqch33i2qgkxzyruk6eydf19\/512x384.jpg","width":"800","height":"600"},{"id":"16353","title":"Soccer Caps League","description":"Welcome to the international World Cup of soccer caps\/table game. Choose your desired team, and control your players to score goals. It's time to fight and win the champion cup. PLAY NOW!","instructions":"Tap the cap player and drag to adjust the direction and shooting power ","url":"https:\/\/html5.gamemonetize.com\/46f8ew49meyj3tgl44jsxg0hwakakzcp\/","category":"Sports","tags":"Best, Football, HTML, Mobile, Sport","thumb":"https:\/\/img.gamemonetize.com\/46f8ew49meyj3tgl44jsxg0hwakakzcp\/512x384.jpg","width":"800","height":"450"},{"id":"15054","title":"Flappy Dunk","description":"Train touching and avoiding obstacles You have up to 22 increasingly difficult levels in this soccer game where you have to keep the ball in the air as you go through the obstacles. Convenient contact for the World Cup and challenge your friends via Google Play Game.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/iot135f33c5ay8twsfucgjkeyu0ix1ff\/","category":"Soccer","tags":"fly, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/iot135f33c5ay8twsfucgjkeyu0ix1ff\/512x384.jpg","width":"800","height":"600"},{"id":"16941","title":"Skipp Rope","description":"A very casual 3D game, players control the role in different situations jump, simple operation, click the screen can jump, seize the right time, do not trip.","instructions":"Tap To Play","url":"https:\/\/html5.gamemonetize.com\/fw55ugicz4lobdnzdzlomvjvkq89effu\/","category":"Soccer","tags":"3D, Adventure, Arcade, Games, Racing, Stickman, Strategy","thumb":"https:\/\/img.gamemonetize.com\/fw55ugicz4lobdnzdzlomvjvkq89effu\/512x384.jpg","width":"800","height":"600"},{"id":"15080","title":"SuperPonGoal","description":"The soccer match is all about hitting the soccer goal and scoring goals! You have never played a soccer game like this before. Run with soccer, follow curved and winding paths on soccer field, dribble countless enemy soccer players and crazy obstacles to reach soccer goal and score the perfect goal!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/z1gnfrqip3beijv65vpmzoank1xa6q25\/","category":"Sports","tags":"Balance, Ball, Football, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/z1gnfrqip3beijv65vpmzoank1xa6q25\/512x384.jpg","width":"800","height":"600"},{"id":"16824","title":"Europe Soccer Cup 2021","description":"Twenty four best soccer national teams in europe are competing to get the first place in the 2020 Europe Soccer Cup, Do you think you can choose a team and do it?","instructions":"Computer - mouse Mobile - Touch","url":"https:\/\/html5.gamemonetize.com\/655y8nrx0nhw0wk7ldan9rh5rnpwucj0\/","category":"Sports","tags":"Best, Football, HTML5, Mobile, Soccer, Sport, Sports, World","thumb":"https:\/\/img.gamemonetize.com\/655y8nrx0nhw0wk7ldan9rh5rnpwucj0\/512x384.jpg","width":"800","height":"500"},{"id":"15369","title":"Stickman Roof Runner","description":"Run adrenalin charged for your life over deadly roof tops, avoid urban canyons, perfectly time your jumps and try to get as far as possible. Beat your friends highscore and share your awesome replays.","instructions":"Tight and fast paced gameplay Unlimited number of levels Endless playing in never ending cities for the pros A lot of achievements to unlock Online and Offline leaderboard","url":"https:\/\/html5.gamemonetize.com\/jllf3kejv5dzze4a0qj4ae0u3k8bxpmh\/","category":"Soccer","tags":"Action, Funny, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/jllf3kejv5dzze4a0qj4ae0u3k8bxpmh\/512x384.jpg","width":"800","height":"600"},{"id":"15673","title":"Halloween Hidden Object Games : Haunted House","description":"Beautifully designed search and finder game with 30+ Autumn Season levels. Halloween Objects! Explore Fall Harvest by seeing Fall Foliage covered Forests and Creeks, New England Towns, Halloween Pumpkin Patches, Rustic Barns, Cornfields and more!","instructions":"Hidden Objects Fall Harvest features Gorgeous Crisp Graphics reflecting Fall Autumn Thanksgiving Halloween themes 3 Game Modes- Traditional Chill Adventure Exciting Levels Scenes of Hidden Object Puzzles Artistically Crafted Levels","url":"https:\/\/html5.gamemonetize.com\/c1drlfdpx7nm6xpm6g9pa8eto2zh678i\/","category":"Soccer","tags":"1 Player, Funny, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/c1drlfdpx7nm6xpm6g9pa8eto2zh678i\/512x384.jpg","width":"800","height":"600"},{"id":"15392","title":"Monster Truck Soccer Climb","description":"How about a great football game with your monster truck? If you're ready, jump into your truck and start an action-packed football game! Have fun!","instructions":"Game Controls SPACE Fire MOVE Arrow Keys","url":"https:\/\/html5.gamemonetize.com\/r0xvjy0s4ext0291ahz7ujy9sq50zgtq\/","category":"Sports","tags":"Ball, Boys, Fun, Funny, Game, HTML5, Kids","thumb":"https:\/\/img.gamemonetize.com\/r0xvjy0s4ext0291ahz7ujy9sq50zgtq\/512x384.jpg","width":"800","height":"450"},{"id":"16480","title":"Hero Soccer","description":"Best Soccer Game.It's a simple control soccer game.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/1tphgocdfwiek95gn8y2j9auydi2ncmp\/","category":"Sports","tags":"Ball, Ballon, Football, Funny, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/1tphgocdfwiek95gn8y2j9auydi2ncmp\/512x384.jpg","width":"900","height":"600"},{"id":"11089","title":"Table Football, Soccer","description":"Table Football, Table Soccer,. Now you can carry a whole retro table football game around in the pocket of your jeans and play any time. Keep fit, play sport, well at least it will keep your fingers fit as you sit there on the sofa pitching your two favorite teams in battle.","instructions":"You can play against the computer or a friend in this version of the classic tabletop game See how many goals you can score The first player to make ten of them will go home a winner ","url":"https:\/\/html5.gamemonetize.com\/lv7eiuomqolh3ok3rul5us6oe1x8qzdb\/","category":"Sports","tags":"1 Player, 2 Player, Sports","thumb":"https:\/\/img.gamemonetize.com\/lv7eiuomqolh3ok3rul5us6oe1x8qzdb\/512x384.jpg","width":"800","height":"600"},{"id":"16261","title":"Head Soccer","description":"Smash the football and score goals in this addicting pocket puppet soccer 2019 game! Pick your favorite worldcup big head team and play as a famous footballer. Tactically play offense and defense as you ascend the World Cup 2019 ladder!","instructions":"Choose your big head team and score many goals You can destroy your enemies with kicks in single player mode or in 2-player mode play with friend funny gameplay Practice kicks in perfect physics simulation and goal You can jump pass or foul Begin M","url":"https:\/\/html5.gamemonetize.com\/qzpme4zjjid204cb81dfhommj2a8l46c\/","category":"Sports","tags":"2 Player, 2 Player Games, 2D, Arcade, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/qzpme4zjjid204cb81dfhommj2a8l46c\/512x384.jpg","width":"960","height":"600"},{"id":"11504","title":"Football Kicks Strike Score : Messi","description":"Have you ever played real-world soccer games penalty on your android device? A mini flick football game is here to make your day more enjoyable. Test your strategy skills while playing against mini futsal players & experienced real football strike team managers around the world. Boost your attacking skills to face the challenger. This is the best mobile arcade flick & mini soccer games. Play as a country club manager, you will enjoy flick soccer games challenge to win the finger contest. The tournament in different football games with different countries to be a legend player and win the world trophy. So, play with your favourite mini kick-ball heroes. The champions are easy & fun to play. Our mini football kicks also known as flick gridiron is a game played upon a finger strike and it just feels like a real ball game. Classic Soccer Games Play Tournament: This game offers classic modes like free, targets mode. In this kick-ball final match, you will play real-world kicks matches against the world's top challenging rivals. Mobile soccer Challenges will help you to master your quick moves, clever dodging, penalties, and mini football skills while playing against top soccer kicks superstars. Penalties are the most thrilling moments in any final match that makes the audience bite their nails, and you will get the same thrilling action in this exciting penalty soccer kick mode. Football players will be using swipe motion controls to kick the ball towards the goal. The goalkeeper will act as an obstacle and defend the goal by jumping and diving. Football Games for Soccer kicks Lovers: It is not only a game but also addictive fun, it will engage you for many hours as you are playing in the ground with your football strike team players & part of your favourite flick soccer kicks club heroes. Playing finger kick tournament more exciting & latest mobile finger flick football games. This is kind of a sports manager experience; you need to control all players to move and use tactics. Adventure of football games, the skill of moving around opponents, and goal. Play against the computer or play challenge mode with pro tactics and mobile soccer games strategy. Football Contests & Realistic Finger Flick Soccer Kicks Challenge: Play against different flick football team players & master your flick soccer kicks to win the mini superstars tournament. Feel of a realistic environment during mini football games and feel the heat of free kick penalty moments. Finger soccer superstars league is the latest mobile football games featuring simple controls, smooth animations, and shots. With simple game-play and great physics, flick soccer kicks are easy to play with unlimited fun. Football Kicks Strike Score: Soccer Games Hero Features: • Play as soccer kicks strike team manager & pro football player • Select your favourite world superstar’s player • Win the cup of soccer kicks by beating your rivals • Free kick flick football simulator to play any time & anywhere • You can play without an internet connection • Soccer free game with simple rules • Realistic graphics and sound effect will enhance the game-play experience • Enjoy sharp & smarter s of your player and opponent’s strong defence • Realistic finger soccer or flick s football game-play So, what are you waiting for? Let’s download and enjoy the mini world football game-play experience in soccer kicks free games.","instructions":"mouse only","url":"https:\/\/html5.gamemonetize.com\/nsyn5id7oh8jhzl0w1inc37ekklbcg30\/","category":"Sports","tags":"1 Player, Adventure, Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/nsyn5id7oh8jhzl0w1inc37ekklbcg30\/512x384.jpg","width":"800","height":"600"},{"id":"15625","title":"Steam Trucker","description":"Steam Trucker - One of the most addictive and entertaining physics based cargo driving games ever made! And it's free!","instructions":"Play the best cargo driving game with fantastic grafic ","url":"https:\/\/html5.gamemonetize.com\/qi23oht2xu5ee1d28gdi53hvaph3txrk\/","category":"Soccer","tags":"1 Player, Funny, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/qi23oht2xu5ee1d28gdi53hvaph3txrk\/512x384.jpg","width":"800","height":"600"},{"id":"14910","title":"Soccer Legends 2021 Games","description":"Soccer Legends 2021 is the latest addition to the two-player Soccer Legends series by MadPuffers. Enjoy a range of new players and teams to choose from various eras of the game. Play solo against AI or challenge your friend to a match!","instructions":"How to Play Get the ball in your opponent s net before they have the chance Use your superkicks to send the ball flying at high speed You can play in tournament or friendly mode when playing solo with the opportunity to play co-op with a friend Tea","url":"https:\/\/html5.gamemonetize.com\/36tlng83d7y4zqhjrcsxc23bvip3r7xv\/","category":"Sports","tags":"Football, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/36tlng83d7y4zqhjrcsxc23bvip3r7xv\/512x384.jpg","width":"800","height":"600"},{"id":"15143","title":"Football Stars","description":"Play football with cartoon stars like teen titans, we bare bears, dc super hero girls, apple and onion, gumball, mao mao heroes, adventure time, Clarence. Enjoy playing Football Stars","instructions":"keyboard or tap to play","url":"https:\/\/html5.gamemonetize.com\/fb4j0uxqslq8grlvjmxvgf30zeai9edo\/","category":"Sports","tags":"Boys, Cartoon, Football, Mobile, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/fb4j0uxqslq8grlvjmxvgf30zeai9edo\/512x384.jpg","width":"1280","height":"720"},{"id":"11534","title":"Street Basketball Association","description":"Welcome to the\"Street Basketball Association\". We will bring you the hottest basketball game experience.You can invite other players to a real-time online competition or rank up while playing various league, cups and events in spectacular arenas.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/pcj51m3vk349c1e85vjf4qcixb2j3x7t\/","category":"Sports","tags":"Baseball, Basketball, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/pcj51m3vk349c1e85vjf4qcixb2j3x7t\/512x384.jpg","width":"800","height":"600"},{"id":"15526","title":"Candy Frenzy 2021","description":"New innovative candy game comes! Objectives differ in over 100 levels. Make matches of 3 or more candies, create candy blasts! Starts out simple, but things get more and more interesting and challenging. Start your sweet candy journey in this puzzle adventure!","instructions":" Sweet and shining candies Over 100 interesting levels Multiple game goals time mode move mode and more Very small size but tasty graphics Create a high score in your friends circle","url":"https:\/\/html5.gamemonetize.com\/jsn0fr7gcnvnts0bjhrqi3tw8pssv5ff\/","category":"Soccer","tags":"1 Player, Baby, Funny, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/jsn0fr7gcnvnts0bjhrqi3tw8pssv5ff\/512x384.jpg","width":"800","height":"600"},{"id":"15104","title":"Basket Swooshes - basketball game","description":"Fun online basketball game for one or two players. Choose your favorite basketball team, then try to prove to the world you are the best at shooting baskets. After winning (or skipping) group stages, the knock-out phase begins. Win every match to earn your spot in the finals of Basket Swooshes Plus. Are you calm and precise enough to win the tournament?","instructions":"How to play It s simple Touch and drag with your finger to aim release to shoot You ll see a path from your player showing the flight of the ball While you re shooting your opponent shoots too - you need to be faster and more precise to wi","url":"https:\/\/html5.gamemonetize.com\/dl417pg55w1d1rrraz1av7amjg3b9dkm\/","category":"Sports","tags":"2 Player, 2 Player Games, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/dl417pg55w1d1rrraz1av7amjg3b9dkm\/512x384.jpg","width":"800","height":"450"},{"id":"14735","title":"Toon Cup","description":"Football game! Have fun choosing your favourite Cartoon Network characters such as Ice Bear from We Bare Bears, Batgirl from DC Superhero Girls and Darwin from The Adventures of Gumball. Master your skills and work with your team to score goals and fight your way to the top of the leader board!","instructions":"The game play is fun and fast-paced You ll have a blast controlling the players and competing in the championship Practice your skills to showcase your talent and earn your place on the pitch ","url":"https:\/\/html5.gamemonetize.com\/jd2m53ylo7csotkewbh7luigtc682xvl\/","category":"Sports","tags":"Ball, Ballon, Ben 10, Cartoon, Cartoon Network, Football, Game, Games, Highscore, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/jd2m53ylo7csotkewbh7luigtc682xvl\/512x384.jpg","width":"800","height":"600"},{"id":"14671","title":"Touch Drawn","description":"With Touch Drawn, which is a fun soccer game, you have to show the route the footballer will go and get the player to the goal line. You have to heck out the rival football players in your way. You can also develop tactics by moving your teammates correctly. Hypercasual fun awaits you with 100 different levels and 16 different football players!","instructions":"Mouse or Touch swipe","url":"https:\/\/html5.gamemonetize.com\/mymccxf8uzptykk7ribrwuknexrby3sl\/","category":"Soccer","tags":"3D, Android, Arena, Ball, Best, HTML5, Hypercasual, Kids, Shoot","thumb":"https:\/\/img.gamemonetize.com\/mymccxf8uzptykk7ribrwuknexrby3sl\/512x384.jpg","width":"800","height":"600"},{"id":"13965","title":"Head Football LaLiga 2021 Jeux de Football","description":"⚽HEAD FOOTBALL LALIGA 2020 - LIGUE DE FOOTBALL ⚽ est le jeu de sport gratuit officiel de la Ligue espagnole de football pour la saison 2020-2021. Choisissez votre joueur de football préféré parmi les équipes officielles de LaLiga, tirez, gagnez et amenez votre équipe de football au sommet du monde du football: marquez des buts avec la tête de votre footballeur et devenez le plus grand champion et le héros de l'équipe de rêves!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/kwi2sin3z2hni0h86z52xvdljrzgqzea\/","category":"Sports","tags":"Ball, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/kwi2sin3z2hni0h86z52xvdljrzgqzea\/512x384.jpg","width":"800","height":"600"},{"id":"11173","title":"⚽ Puppet Soccer 2021 – Football ⚽","description":"⚽Casser le football ⚽et marquer des buts dans ce jeu de football de marionnettes de poche addictif! Choisissez votre équipe de tête mondiale préférée et jouez en tant que footballeur célèbre. Jouez tactiquement à l'offensive et à la défense en gravissant le classement de la Coupe du Monde 2021 Upgrades: kick, jump, speed ⚽ Two player split screen multiplayer on one mobile device ⚽ Achievements, best scores, great manager ⚽ 2021 Marionette World Cup of noxgames in Brazil ⚽ Better physique for ball and crazy goals","instructions":"","url":"https:\/\/html5.gamemonetize.com\/o2jdeh6jbac7xe6abvxlyol7c1m6k9k9\/","category":"Sports","tags":"Ball, Boys, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/o2jdeh6jbac7xe6abvxlyol7c1m6k9k9\/512x384.jpg","width":"800","height":"600"},{"id":"13932","title":"Valto Jumpe","description":"The young sailor had a dream, and it was very exciting. He could jump very high, and avoid spikes to collect stars as many as possible! Try your best to score higher!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/2cp91g80irwm3svse3asf5083eajoncr\/","category":"Soccer","tags":"1 Player, 2D, Fun, HTML5, jump, Jumping, Kids, Skill","thumb":"https:\/\/img.gamemonetize.com\/2cp91g80irwm3svse3asf5083eajoncr\/512x384.jpg","width":"800","height":"600"},{"id":"13951","title":"Bear Chase Jump","description":"Bear Chase is a great reaction game in which all you need to do is collect the presents. But there’s something wrong here! Your previous selves are appearing as shadows and chasing you down. You’ll have to run and jump across the platforms to avoid them. Since they mimic your own actions, you'll need to calculate the best way to stay out of their reach. Touching a shadow is an instant \"game over\". Will you be able to stop yourself from… stopping yourself?","instructions":"","url":"https:\/\/html5.gamemonetize.com\/7jbe1ajkk2iwmk9t0500b3j6mzmm5lnc\/","category":"Soccer","tags":"1 Player, 2D, Adventure, HTML5, jump, Jumping, Puzzle, run","thumb":"https:\/\/img.gamemonetize.com\/7jbe1ajkk2iwmk9t0500b3j6mzmm5lnc\/512x384.jpg","width":"800","height":"600"},{"id":"13735","title":"Head Soccer Pro - Head Ball 2 ","description":"Enjoy exciting and fun soccer games at Head Soccer Pro. A great game that combines agility, skill and tournaments so you can prove you can be a champion.","instructions":"Compete in a cup against 32 teams in group stage and elimination Countries or Clubs you choose Make luxury goals from a distance head or free kick and Penalty But beware of injuries and yellow cards ","url":"https:\/\/html5.gamemonetize.com\/wmsy76khiwydfslcg1rv9d3km98id80a\/","category":"Sports","tags":"2 Player, Football, Sports","thumb":"https:\/\/img.gamemonetize.com\/wmsy76khiwydfslcg1rv9d3km98id80a\/512x384.jpg","width":"800","height":"600"},{"id":"11574","title":"Soccer Manager GAME 2021 - Football Manager","description":"New Boss buy football team and you should be new manager. The strategy plan is clear: victory star team in Champions league. Is it challenge for you? No? Become manager of soccer team and lead everything: recruit new players or change them for better one, train their skills (experiences gain in matches), respect budget.","instructions":"It is up to you which tactic do you select defensive and offensive or who will be your best player goalkeeper midfielder striker center winger Gain league points for each successful match and go up get new players in higher levels and boss will g","url":"https:\/\/html5.gamemonetize.com\/l85es8bfq1xapoejp7mat3l76hmqxlsj\/","category":"Sports","tags":"2 Player Games, 2D","thumb":"https:\/\/img.gamemonetize.com\/l85es8bfq1xapoejp7mat3l76hmqxlsj\/512x384.jpg","width":"800","height":"600"},{"id":"13717","title":"Football Tapis Soccer : Multiplayer and Tournament","description":"If you like table soccer this is your football game. With simple gameplay and great physics, Football Games 2021: Football Tapis Soccer : Multiplayer and Tournament Table is easy to pick up and fun to play! In true competitive style, challenge your opponents all over the world for Football table soccer matches! The aim of this Football Tapis Soccer : Multiplayer and Tournament is for a player to score more goals with the soccer caps than their opponent by their digital football legends and champions.","instructions":"hold left mouse button to the GOAL","url":"https:\/\/html5.gamemonetize.com\/zdb0r635yflck6izojtpdyiivi7o8gd7\/","category":"Soccer","tags":"2 Player, 2 Player Games, 3D, Adventure, Ball, Football, Multiplayer, Soccer","thumb":"https:\/\/img.gamemonetize.com\/zdb0r635yflck6izojtpdyiivi7o8gd7\/512x384.jpg","width":"1024","height":"640"},{"id":"13670","title":"Head Ball Soccer 2021","description":"Soccer is all about kicking the ball and scoring goals, right? Experience soccer in a way you have never experienced before. Kick, strike and score using your hero. Use your head, and superpowers to score goals. Head Ball 2 offers simplistic gameplay that can be quickly transformed into action-packed and exciting games. Hit the ball, hit your opponent, use headers, superpowers or outwit your opponent by juking them. Everything is permitted, as long as you win! No match will be the same as the previous in the most exciting soccer game! Connect with your friends via Facebook and challenge them to show who is the better soccer player.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/s5aho8o9kl3csuanliztmk18ji9epnbh\/","category":"Soccer","tags":"Ball, Basketball, Football, Multiplayer, Soccer","thumb":"https:\/\/img.gamemonetize.com\/s5aho8o9kl3csuanliztmk18ji9epnbh\/512x384.jpg","width":"800","height":"600"},{"id":"13508","title":"Head Football 2021 - Best LaLiga Football Games","description":"LaLiga is back! Experience all the fun with Head Football, the most frenetic game with all the official teams, stadiums, and cartoons of LaLiga Santander's stars! Download this football game for free and enjoy playing football with all the teams of LaLiga Santander! ⚽HEAD FOOTBALL LA LIGA 2020 - BEST FOOTBALL GAMES LEAGUE ⚽ is the official free sports game for Spanish Football League for 2019-2020 season! Choose your favourite football player among the official LaLiga teams, unleash your powerful shots and take your football team to the top of the football world ranking! ¡Score thousand of goals using the big head of your footballer and become the ultimate champion and the hero of your sport dream team! Download this football game for free and enjoy playing football with all the soccer clubs and superstars from LaLiga! Impress the FIFA and the fans by scoring incredible goals in the best official soccer stadiums: Bernabéu, Camp Nou, Calderón, … What is your favourite soccer team? Select a football team from the dream league and play as a mini footballer with a bobble head. Goalkeepers, defenders, midfielders, … only Head Football LaLiga 2020 has all the official football players from LaLiga! Join millions of players in this exciting soccer game and enjoy playing with all your favourite footballers: Messi, Griezmann,… Now you just need to choose your big-headed soccer player, get out on the field, show off your skills and win tournaments in-game! Only the best players are able to take on this football challenge! Show off your ball skills and beat each round! Try to survive in the most astonishing football matches jumping as high as you can, kicking stronger and sprinting faster than all your rivals within the game. Score amazing goals in every clash and win all the cups, leagues and tournaments. Download Head Football LaLiga - Best Football Games League now, the best of the sport games of football teams ! OFFICIAL LICENSES FROM LALIGA⚽ Play football in real stadiums with all your idols. The only football sports game with the original soccer clubs and players from the Spanish Football League for 2019-2020 season! TRAIN AND IMPROVE⚽ Evolve your soccer players and their skills: SPEED to move quickly down the field, SHOT to make it unstoppable, JUMP to leap higher in each attack and defense, SPRINT to overtake your rivals, POWER UP to reduce the time between special shots… Level up and be the ultimate score football hero! AMAZING SPECIAL SHOTS⚽ Defeat all the opponents using the shocking special kicks: Dragon Ball, Orange Machine, Falling Star… And more! Each with stunning light and sound effects! Ultimate extreme football! DIVISIONS⚽ Create your player and compete. Choose from three categories within the game: bronze, silver, and gold. Win games to reach the gold category and beat other players in the league. Victories will earn you rewards that you can use to level up your player. GAME MODES⚽ Try the CUP, where champions are remembered! Go down in history through all of the rounds and enjoy playing in the Final Football League! Start a FRIENDLY match and play soccer against any club you want! Consistency is key to success in the FOOTBALL GAMES LEAGUE! You must face off against all of the teams and gain points to be ranked at the top of the table by the end of the season. Make your own huge head football player with the amazing EDITOR! BEAT YOUR FRIENDS⚽ Sync your progress with Google Play Games and Facebook. How many goals could you score? Even Luis Figo has fun playing Head Football LaLiga, check it out: http:\/\/laliga.es\/en\/video\/sportel-visita Play in the Dream League, reach the Gold Division. Enjoy playing Head Football LaLiga 2020 - Best Football Games League! This app uses Wi-fi or mobile data to download game content and advertising. You can disable mobile data usage on this game within Settings\/Mobile Data. Visit us at:","instructions":"","url":"https:\/\/html5.gamemonetize.com\/dkkhcerfdzzde57oso48w1hrywysyz5c\/","category":"Sports","tags":"Ball, Ballon, Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/dkkhcerfdzzde57oso48w1hrywysyz5c\/512x384.jpg","width":"960","height":"600"},{"id":"13946","title":"TouchDown Master Glory","description":"Are you ready to score some incredible touchdowns? Running is avoiding many enemies and various obstacles. Drag your finger on the screen to move the player. Touchdown Master glory (American football) is a fun free game you'll want to play with your friends. What level can they reach?! Features : - Many interesting levels - Beautiful low poly graphics -Multiple Graphic rugby Player","instructions":"Are you ready to score some incredible touchdowns Running is avoiding many enemies and various obstacles Drag your finger on the screen to move the player Touchdown Master glory American football is a fun free game you ll want to play with ","url":"https:\/\/html5.gamemonetize.com\/ubgm7znimdc4hqfwlkgx2seselhqgw1a\/","category":"Sports","tags":"Baseball, Basketball, Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/ubgm7znimdc4hqfwlkgx2seselhqgw1a\/512x384.jpg","width":"600","height":"960"},{"id":"13221","title":"NBA Baller","description":"Get enough basketball and free throw basketball drills, shooting through backboard basketball","instructions":"Get enough basketball and free throw basketball drills shooting through backboard basketball","url":"https:\/\/html5.gamemonetize.com\/tzgvhd60o7ff75643tr20jpqg6tjgzsa\/","category":"Sports","tags":"Basketball, Shooting, Soccer","thumb":"https:\/\/img.gamemonetize.com\/tzgvhd60o7ff75643tr20jpqg6tjgzsa\/512x384.jpg","width":"600","height":"800"},{"id":"13069","title":"Basket King  2021","description":"Basketball is the 1 basketball game. Basketball is a game of levels in which to move from one level to another you have to score baskets. Nothing more fun!","instructions":"use mouse in the game","url":"https:\/\/html5.gamemonetize.com\/phcyqu2ue93up31jmzn4nj1xv4t9nrqd\/","category":"Soccer","tags":"Ball, Ballon, Baseball, Basketball, Football","thumb":"https:\/\/img.gamemonetize.com\/phcyqu2ue93up31jmzn4nj1xv4t9nrqd\/512x384.jpg","width":"800","height":"600"},{"id":"10370","title":"Football Heads","description":"Live your football story! Enter the field, decimate your opponent with various powerful kicks and fun and quirky powerups. Finally let them know who is the boss with the emotes system - become a football legend today!","instructions":"Move sideways and jump with the arrow buttons Perform various kicks with the ball buttons Score more goals in the given time and win the match Climb divisions and unlock all rewards Random match powerups and player emotes are available ","url":"https:\/\/html5.gamemonetize.com\/uzkm3h1igndrx9is3e3mzrhmwfpzv3zp\/","category":"Sports","tags":"Ball, Football, Matching, Soccer","thumb":"https:\/\/img.gamemonetize.com\/uzkm3h1igndrx9is3e3mzrhmwfpzv3zp\/512x384.jpg","width":"800","height":"600"},{"id":"13380","title":"Football Strike penalty - Soccer Games","description":"Football Strike is easy to play and offers endless competitive football fun! Take on your friends in multiplayer free-kick face-offs. Easy controls, high-quality graphics, and immersive sound make it absolutely worth inexperience.","instructions":" Take your shot and make amazing saves all with the flick of the finger ","url":"https:\/\/html5.gamemonetize.com\/waanbkgb66wklwg5x62sq666r3b1s17o\/","category":"Sports","tags":"Football, Soccer, Sport, Sports, Strategy","thumb":"https:\/\/img.gamemonetize.com\/waanbkgb66wklwg5x62sq666r3b1s17o\/512x384.jpg","width":"600","height":"800"},{"id":"13165","title":"Mini Golf King  2","description":"Enjoy and play mini golf game in a cartoon style! Complete all 18 holes, and sign you score the best in this fun cartoon Mini Golf game. In top view carton style, enjoy putting the green in this obstacle laden mini golf course. So bring out the golfer in You in this exciting mini golf game; it's perfect to relax on the green after a day of hard work or play.","instructions":"move mouse","url":"https:\/\/html5.gamemonetize.com\/qa1u4j7aimr878jo0va8lj5qwus43w4t\/","category":"Sports","tags":"Golf, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/qa1u4j7aimr878jo0va8lj5qwus43w4t\/512x384.jpg","width":"800","height":"600"},{"id":"12533","title":"Football Among Us ","description":"Football among us Shoot is an one-button Physics based soccer game! It is easy to play and very entertaining, will bring you a huge fun when play with friends. Support multiplayer match, create your own avatar and build your dream team! Control your team by tapping the button to poke your opponent, kick & shoot the ball into your opponent’s gate! Easy to play, but not that easy to score! Go to win your friends and to be the hero in their hearts! LOL If you like football and soccer, you must play this humorous game NOW!","instructions":"mouse ","url":"https:\/\/html5.gamemonetize.com\/80lhndshf4warjjpja8dmqqv7g3b1p89\/","category":"Soccer","tags":"2 Player, 2 Player Games, Games, Soccer","thumb":"https:\/\/img.gamemonetize.com\/80lhndshf4warjjpja8dmqqv7g3b1p89\/512x384.jpg","width":"800","height":"600"},{"id":"11899","title":"Candy Burst Popcorn","description":"Big fan for sweet popcorn and candy puzzle game? Match and collect 3 or more candies or Popcorn in Popcorn and Candy Burst. Create sweet boosters to achieve the highest score and win 3 stars with each puzzle. Join and share the fun in Popcorn and Candy Burst!","instructions":"Big fan for sweet popcorn and candy puzzle game Match and collect 3 or more candies or Popcorn in Popcorn and Candy Burst Create sweet boosters to achieve the highest score and win 3 stars with each puzzle Join and share the fun in Popcorn and Candy Bu","url":"https:\/\/html5.gamemonetize.com\/4tanqxaltlg5zbyvex6tlyegmwvzeeai\/","category":"Soccer","tags":".io, .io Games, 1 Player, 2D, 3D, 3D Games, Candy, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/4tanqxaltlg5zbyvex6tlyegmwvzeeai\/512x384.jpg","width":"600","height":"960"},{"id":"11925","title":"Castel game","description":"Are you a die hard game player? Are you one who love playing games for hours? How is your concentration power, do you want to improve? If the answer to any of question above is yes, than this game is for you. I said concentration power, fingers crossed? Do you feel it will be very complex or hard to play? Not at all, anyone can play this game. Yes, you just have to tap on screen keep bird flying and save the bird from falling on ground or hit with pillars. Like you are flapping the bird. Play the game and unlock new birds. Stay focused and don't let bird touch the hurdles or fall on ground. Suggestions and Improvements are always welcome. Throw your ideas and force us to think in that direction.","instructions":"Use the joypad to move Try not to approach the obstacles","url":"https:\/\/html5.gamemonetize.com\/0l71kjw1iy00gf76tkduwilhpjhw95b9\/","category":"Soccer","tags":"8 Ball Pool, Adventure, Bejeweled, Ben 10, Brain, Driving, Minecraft, run","thumb":"https:\/\/img.gamemonetize.com\/0l71kjw1iy00gf76tkduwilhpjhw95b9\/512x384.jpg","width":"800","height":"600"},{"id":"13546","title":"Shoot Goal Soccer Game","description":"The world’s most popular football game is now available for android. Football Legends 2016 allows you to compete with players all across the globe from those who are die-hard football fans to those who are just looking to have a fun competitive game on their mobile device.","instructions":"just drag and drop ball to make goals","url":"https:\/\/html5.gamemonetize.com\/b9n473y187l0x8xh5ggjcn1kpxg1zmja\/","category":"Soccer","tags":"1 Player, 2 Player, 3D, 3D Games, 8 Ball Pool, Action, Adventure, Android, Anime, Arcade, Balance, Ball, Ballon, Board, Boxing, Candy, Cartoon, Casual, Collecting, Defense, Detective, Educational, endless, Fight, Football, Game, Games, Hypercasual, Management, Obstacle, Puzzle, Soccer, Sport, Sports, Tower Defense, World","thumb":"https:\/\/img.gamemonetize.com\/b9n473y187l0x8xh5ggjcn1kpxg1zmja\/512x384.jpg","width":"600","height":"960"},{"id":"11588","title":"Pirate Octopus Memory Treasures Game Memory Game","description":"Ahoy pirate octopus Memory treasures on the ocean waiting you, Come on join Octopus treasure in this new Epic puzzle game adventurer to improve your memory and be able to learn a new skills through the journey on this best Octopus puzzle games ever. Octopus treasures adventure have more puzzles to solve which is helpful to train your brain and become the master of your own memory through solving different block of puzzles. also you can share playing this game with your underworld's collegues that include fish and sharks. and as you noticed you should serve coins that have only interest to octopus pirate, For example, jewels or diamonds are good ideas to achieve a good score and that's a good mark to know that your memory and your brain are increasing ever time you play pirate octopus adventure. An exemplary pirate octopus amusement to play could be a privateer gems Remember with hungry sharks, the fun starts when you gather the gem coins every experience you got on treasure chase. before you make any smart move you need to observe which one is good to chose thought is to utilize a promoters to open the hardest new riddle excitement and accomplish 3 stars and best score. How to Play Pirate Octopus Treasure : Select the same coins to create your combination jewel and exchange it to a common side jewels of the same coins and all of them will be solved. Try to observe before you selet any coin, then start testing you remembering ability. So it's imperative to know the standards of any diversion before you can play it you will have a Cat multi day, and before soliciting yourself a ton from inquiries, approach one appropriate for you that may be great is how to win? What's more, the best answer and genuine feline one is to play, you can't win a diversion that you absolutely never begin and I think you prepared presently to begin wining and getting a charge out of.","instructions":"Ahoy pirate octopus Memory treasures on the ocean waiting you Come on join Octopus treasure in this new Epic puzzle game adventurer to improve your memory and be able to learn a new skills through the journey on this best Octopus puzzle games ever Oc","url":"https:\/\/html5.gamemonetize.com\/oax3hpqc0ti86rt3woybx09ekcxhzlsn\/","category":"Soccer","tags":"Memory, Pirate","thumb":"https:\/\/img.gamemonetize.com\/oax3hpqc0ti86rt3woybx09ekcxhzlsn\/512x384.jpg","width":"600","height":"960"},{"id":"12205","title":"Head Sport Football ","description":"Head Football - Champions League 19\/20 game with 32 champions league teams and challenging matches waiting for you. You have to play with the right strategy against advanced artificial intelligence and get out of groups. Immediately after that, you have to get your skills in the last 16 and get your name in the quarter finals. You must pass the 2-game quarter-finals and play a better game against the tough rivals in the semifinals. In the final one of the hardest matches will be waiting for you! What is waiting for you in Head Football - Champions League 19\/20: * 32 Champions League Team * Easy Gameplay * Real Tribune Sounds * 90 Second Gripping Matches * 3 Different Stadiums * 3 different balls * High performance When playing Head Football - Champions League 19\/20, you will not understand how time passes! Don't forget to mention your wishes and opinions so that we can offer you better games!","instructions":"Head Football - Champions League 19 20 game with 32 champions league teams and challenging matches waiting for you You have to play with the right strategy against advanced artificial intelligence and get out of groups Immediately after that you have t","url":"https:\/\/html5.gamemonetize.com\/kc3bdedbsyp4o3nwj5nzzrmxirb1m547\/","category":"Soccer","tags":"2 Player, 2 Player Games, 2D, Action, Adventure, Animal, Anime, Arcade, Ball, Ballon, Baseball, Basketball, Football, HTML, HTML5, Online, Soccer, Sport, Sports, Strategy, Unity3D, WebGL, World","thumb":"https:\/\/img.gamemonetize.com\/kc3bdedbsyp4o3nwj5nzzrmxirb1m547\/512x384.jpg","width":"800","height":"600"},{"id":"11578","title":"Cat Rope I","description":"Follow the adventure of Om Nom in the first part of the legendary \"Cut the Rope\" logic puzzles series. Get it now for free and start playing with millions of players around the world! Eager to learn more about Om Nom's adventures? Watch \"Om Nom Stories\" cartoons and other amazing videos on our YouTube channel! www.zep.tl\/youtube A mysterious package has arrived, and the little monster inside has only one request… CANDY! Collect gold stars, discover hidden prizes and unlock exciting new levels in this addictively fun, award-winning, physics-based game! Game awards: BAFTA Award Pocket Gamer Award GDC Award Best App Ever Award Key features: - 17 boxes with 425 levels - Innovative physics gameplay - Adorable character - Outstanding graphics - \"Om Nom Stories\" animation shorts - Superpowers","instructions":"Follow the adventure of Om Nom in the first part of the legendary Cut the Rope logic puzzles series Get it now for free and start playing with millions of players around the world Eager to learn more about Om Nom s adventures Watch Om Nom","url":"https:\/\/html5.gamemonetize.com\/0queambt7v5l69uovglv61s2rqazvx5v\/","category":"Soccer","tags":"Animal, Arcade, Cat","thumb":"https:\/\/img.gamemonetize.com\/0queambt7v5l69uovglv61s2rqazvx5v\/512x384.jpg","width":"600","height":"960"},{"id":"11779","title":"Basket Ball Hoops Shoot","description":"Smash the rim and shoot hoops from the free throwing line. How many triples in a row can you get? Slam dunk the hoop, get a 3-point shooting streak and became a basketball star! Join the free throw competition, shoot the hoops and try to get as many points as you can from the free throw line. Get on a roll in the best basket game!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/kysvrdjxv9c5slpxbppl1go9ui0iy6rj\/","category":"Sports","tags":"1 Player, Ball, Basketball, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/kysvrdjxv9c5slpxbppl1go9ui0iy6rj\/512x384.jpg","width":"600","height":"960"},{"id":"12013","title":"mental arithmetic math practice","description":"WELCOME TO THE SWEETEST mental arithmetic math practice mental arithmetic math practice A fun educational game that improves elementary math skills including addition & subtraction, multiplication and division. With daily practice in Math Dojo, you can boost your logical thinking and arithmetic while enjoying an anime Tap! Collapse! Blast!! Enjoy the best puzzle game! Play now for free!","instructions":" mental arithmetic math practice","url":"https:\/\/html5.gamemonetize.com\/917unyt3pt6tti7g63xi0r9ucwpnd5cn\/","category":"Soccer","tags":"Math, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/917unyt3pt6tti7g63xi0r9ucwpnd5cn\/512x384.jpg","width":"600","height":"960"},{"id":"11074","title":"Parkour Superhero Game: City Ninja Robot Street Fi","description":"Dash from rooftop to rooftop. Flip, jump, fall and vault over obstacles to set all new records. Join other guys and compete to win the daily race for special rewards! Scale buildings around the city and land tricks to gain extra speed. Leave your opponents to rage as you take home the win!","instructions":"One-Touch To controll","url":"https:\/\/html5.gamemonetize.com\/gdo6md8s3dalbbif927b5meqi3jnk8k0\/","category":"Sports","tags":"Game, Jumping, Parking, Race, Simulation, Simulator, Sports, Superhero","thumb":"https:\/\/img.gamemonetize.com\/gdo6md8s3dalbbif927b5meqi3jnk8k0\/512x384.jpg","width":"960","height":"600"},{"id":"11450","title":"Shot Them All","description":"Sort all color balls in the tubes, How far can you go? Sort it Puzzle is a fun and addictive puzzle game! Try to sort the colored balls in the tubes until all balls with the same color stay in the same tube. A challenging yet refreshing game to exercise your brain!","instructions":" FEATURES One finger control NO penalty time limit you can enjoy Ball Sort Puzzle at your own pace NO WIFI No problem You can enjoy the game anytime anywhere ","url":"https:\/\/html5.gamemonetize.com\/infzr3gab8pouaqzntw10fwpm1i2blxt\/","category":"Soccer","tags":"3D Games, 8 Ball Pool, Adventure, Baby, Ball, Boys, Girls, Kiss, Minecraft, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/infzr3gab8pouaqzntw10fwpm1i2blxt\/512x384.jpg","width":"800","height":"600"},{"id":"11952","title":"Candy 2021 :game 2021 gratuit","description":"Candy 2021 : jeux 2021 gratuit is a sweet match 3 puzzle game.Start exploring your Candy 2021 : jeux 2021 gratuit adventure today, match yummy candies","instructions":"Candy 2021 jeux 2021 gratuit is a sweet match 3 puzzle game Start exploring your Candy 2021 jeux 2021 gratuit adventure today match yummy candies","url":"https:\/\/html5.gamemonetize.com\/sbhh5jndck6kb1959ktqqa7d9ta4kn2d\/","category":"Soccer","tags":"2 Player Games, 8 Ball Pool, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/sbhh5jndck6kb1959ktqqa7d9ta4kn2d\/512x384.jpg","width":"800","height":"600"},{"id":"11696","title":"Gumball Soccer Game","description":"The atmosphere of real football euphoria reigns in the Cartoon Network. The entire stadium is packed with fans, and the stands are thundering with chants and ecstatic hum. The legendary cartoon football duel among the Cartoon Network is about to begin. Everyone is looking forward to a cool competition! Do you want to become one of the tournament participants and play on the side of your favorite character? Then welcome to Cartoon Network Football Duel!","instructions":"use your finger or computer mouse to control the ball the character ","url":"https:\/\/html5.gamemonetize.com\/4p7pnsyr2965ykjkgxoliox46wpwippm\/","category":"Sports","tags":"Adventure, Anime, Boy, Boys, Candy, Cartoon, Cartoon Network, Girl, Girls, Matching, Soccer","thumb":"https:\/\/img.gamemonetize.com\/4p7pnsyr2965ykjkgxoliox46wpwippm\/512x384.jpg","width":"800","height":"600"},{"id":"8440","title":"Minicars Soccer","description":"There are seven different car models inside of the game the speed and controlling of the car changes according to car model Besides of that you can make choice of ball size as large medium or small During the game by taking the three different bonuses which appears in the field you can have the advantage The player who does five scores in the game wins the game","instructions":"Player 1 W A S D Player 2 ARROW KEYS ","url":"https:\/\/html5.gamemonetize.com\/tzfymaoee50ay1wrh7uxycwsd4bbq6gk\/","category":"Soccer","tags":"2 Player, 2 Player Games, Arcade, Funny, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/tzfymaoee50ay1wrh7uxycwsd4bbq6gk\/512x384.jpg","width":"800","height":"500"},{"id":"8697","title":"Ragdoll Soccer","description":"Ragdoll Soccer is a physics based soccer game. You can play the game in 1 player puzzle mode or in a 2 player match. Try to stay one piece and score goals to win the game.","instructions":"1st Player Move W A S D Release launch rope with SPACE BAR 2nd Player Move ARROW KEYS Release launch rope with L ","url":"https:\/\/html5.gamemonetize.com\/blrxbxslxo4ohohqq7upeog1i4kejjxv\/","category":"Soccer","tags":"2 Player, 2 Player Games, Boy, Boys, Fun, Funny, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/blrxbxslxo4ohohqq7upeog1i4kejjxv\/512x384.jpg","width":"800","height":"450"},{"id":"8759","title":"Game Penalty Kicks","description":"Penalty Kicks is an HTML sports game. Your team has chosen you to score the decisive goal that will lead you to victory. Aim the ball and kick it past the goalkeeper.","instructions":"Move your mouse or finger on the ball to simulate a hit","url":"https:\/\/html5.gamemonetize.com\/tzvoybc5guau14mv4k852s9sshins9cm\/","category":"Soccer","tags":"1 Player, Football, HTML5, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/tzvoybc5guau14mv4k852s9sshins9cm\/512x384.jpg","width":"1360","height":"640"},{"id":"8530","title":"Dribble King","description":"Association football, more commonly known as football or soccer (originally also spelled foot-ball), is a team sport played with a spherical ball between two teams of 11 players. It is played by approximately 250 million players in over 200 countries and dependencies, making it the world’s most popular sport. The game is played on a rectangular field called a pitch with a goal at each end. The object of the game is to outscore the opposition by moving the ball beyond the goal line into the opposing goal. The team with the higher number of goals wins the game.","instructions":"Drag to play","url":"https:\/\/html5.gamemonetize.com\/7r74pq3lrzb6curwjapt7gj91zpnu1r1\/","category":"Sports","tags":"Football, Game, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/7r74pq3lrzb6curwjapt7gj91zpnu1r1\/512x384.jpg","width":"800","height":"600"},{"id":"5611","title":"Punch the ball!","description":"Punch the ball is 2d sport game similar to aerohockey but instead of puck you can choose any ball.","instructions":"Touch OR Keyboard A and D OR left arrow and right arrow ","url":"https:\/\/html5.gamemonetize.com\/ry2phdhnxze3v59iawous89fnqzeqvhi\/","category":"Sports","tags":"2D, Action, Ball, Basketball, hockey","thumb":"https:\/\/img.gamemonetize.com\/ry2phdhnxze3v59iawous89fnqzeqvhi\/512x384.jpg","width":"360","height":"640"},{"id":"7628","title":"Keepy Ups Soccer","description":"Keepy Ups Soccer is a fun soccer game from sportsheadsgames.com to practice your ball control. The objective here is to make as many kick ups as possible. You can get good at the basics first, solidify your skills and style, and then focus yourself for the win. Share your best score with your friends!","instructions":"Tap or click or the ball to keep it in the air ","url":"https:\/\/html5.gamemonetize.com\/fm7fw92puedvmeqrhnet1pxpvc93o734\/","category":"Sports","tags":"Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/fm7fw92puedvmeqrhnet1pxpvc93o734\/512x384.jpg","width":"960","height":"1280"},{"id":"7534","title":"Fish Soccer","description":"Two Player & One Player Fish Soccer Games","instructions":"P1 Wasd Keys -- Bonus Press T P2 Arrow Keys -- Bonus Press P","url":"https:\/\/html5.gamemonetize.com\/evt8qhk383bkkn9u09w8kwoj3hj5xf5b\/","category":"Soccer","tags":"2 Player, 2 Player Games, 2D, Animal, Cartoon, Cute, Fish, Football, Soccer","thumb":"https:\/\/img.gamemonetize.com\/evt8qhk383bkkn9u09w8kwoj3hj5xf5b\/512x384.jpg","width":"800","height":"600"},{"id":"7428","title":"Fanatical Basketball","description":"Dribble, shoot, score! Hit the court with Fanatical Basketball, the world’s #1 stunningly immersive basketball game! Grab the ball, shoot from the downtown or perform spectacular dunks, and rise to the challenge with Fanatical Basketball! Build and manage your team, go head to head in 5-on-5 action and dominate your opponents in nba style matches. Win or go home with lethal shot in playoff seasons. KABOOM!","instructions":"Please follow the screen instructions","url":"https:\/\/html5.gamemonetize.com\/iu1l7omq4dg83lrqfkwzb9amwj819v1r\/","category":"Sports","tags":"Basketball, Bubble, Game","thumb":"https:\/\/img.gamemonetize.com\/iu1l7omq4dg83lrqfkwzb9amwj819v1r\/512x384.jpg","width":"480","height":"854"},{"id":"7402","title":"European Cup Champion","description":"Kick, strike and score using your hero. Use your feet, head, and superpowers to score goals. Simplistic gameplay that can be quickly transformed into action-packed and exciting games. Features -5 unique competitive soccer leagues with 15 brackets to play through. -Hundreds of accessories to improve your soccer hero!","instructions":"Press the space bar to kick the ball Arrow keys to control forward and backward and jump","url":"https:\/\/html5.gamemonetize.com\/wru6sji6rk6oxwwukehty9uvjeqcs3cp\/","category":"Sports","tags":"Football, Matching, Racing, Soccer, Sport, Sports, World","thumb":"https:\/\/img.gamemonetize.com\/wru6sji6rk6oxwwukehty9uvjeqcs3cp\/512x384.jpg","width":"800","height":"600"},{"id":"7086","title":"Soccer Caps Halloween","description":"Welcome to the international Halloween World Cup of soccer caps\/table game. Choose your desired team, and control your players to score goals. It's time to fight and win the Halloween champion cup. Happy Halloween!","instructions":"Tap the caps players and drag to adjust the direction and shooting power ","url":"https:\/\/html5.gamemonetize.com\/mxbda1qtrjbr5p0pwz24tr9lu6ac8jcu\/","category":"Sports","tags":"Best, Football, Halloween, Holiday, HTML, Mobile, Simulation, Sport","thumb":"https:\/\/img.gamemonetize.com\/mxbda1qtrjbr5p0pwz24tr9lu6ac8jcu\/512x384.jpg","width":"800","height":"450"},{"id":"6962","title":"Fun Soccer 3D","description":"This is physics based 3D funny cool soccer game. It is very easy to play. Experience full of soccer and pure fun. Playable with 2 3 4 players. It is also playable with local 2 3 4 Players at the same time. There is available 4 buttons mode in settings. Very simple and fun gameplay here. You can make crazy goals and you can play it with just one finger!","instructions":"Please follow the screen instructions","url":"https:\/\/html5.gamemonetize.com\/1bmbopy09ddmwmrn2b07ttiy3yc60761\/","category":"Sports","tags":"3D, Adventure, Anime, Football, World","thumb":"https:\/\/img.gamemonetize.com\/1bmbopy09ddmwmrn2b07ttiy3yc60761\/512x384.jpg","width":"480","height":"854"},{"id":"6434","title":"Soccer Caps Game","description":"Welcome to the international World Cup of soccer caps\/table game. Choose your desired team, and control your players to score goals. It's time to fight and win the champion cup. PLAY NOW!","instructions":"Tap the cap player and drag to adjust the direction and shooting power ","url":"https:\/\/html5.gamemonetize.com\/pxwnh4s07zoursw8gwp4cjj0lvuuo5vd\/","category":"Sports","tags":"Best, Football, Games, HTML5, Mobile, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/pxwnh4s07zoursw8gwp4cjj0lvuuo5vd\/512x384.jpg","width":"800","height":"450"},{"id":"6152","title":"Foot!","description":"Play soccer. Control your 2D players and hit the ball!","instructions":"Mouse","url":"https:\/\/html5.gamemonetize.com\/jesltsxcpvrz6vchhcsbwdvsmojmyx0h\/","category":"Sports","tags":"2 Player, Football, Skill, Soccer","thumb":"https:\/\/img.gamemonetize.com\/jesltsxcpvrz6vchhcsbwdvsmojmyx0h\/512x384.jpg","width":"800","height":"600"},{"id":"6067","title":"Head Football","description":"Head Football is a fun head soccer game with great graphics and a good AI opponent.","instructions":"AD or left right arrows to move W or up arrow to jump Space to shoot","url":"https:\/\/html5.gamemonetize.com\/ke8olfu3h7bhruohqipn7z5schm7fq70\/","category":"Sports","tags":"2D, Arcade, Mobile, WebGL","thumb":"https:\/\/img.gamemonetize.com\/ke8olfu3h7bhruohqipn7z5schm7fq70\/512x384.jpg","width":"960","height":"600"},{"id":"5973","title":"Pinball Football","description":"Pinball Football is a great soccer game. 20 levels you need to beat engine. Score 4 goals per level and go to the higher level. Good luck!","instructions":"mouse or touch screen","url":"https:\/\/html5.gamemonetize.com\/609r6sb9zesptzae9jmzn7tf1hwu2oz8\/","category":"Sports","tags":"Football, Pinball, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/609r6sb9zesptzae9jmzn7tf1hwu2oz8\/512x384.jpg","width":"720","height":"1280"},{"id":"5940","title":"Soccer Online","description":"Soccer Online is an interesting football game. In the game, you can play with your friends. The goal of this game is making a great strategy against your opponent. In a limited time, the best one wins the game. Have fun and good luck.","instructions":"Use mouse or touch the screen ","url":"https:\/\/html5.gamemonetize.com\/dde48ttk9pmk53o8q8t7mc0b3cjr3ftg\/","category":"Sports","tags":"Arcade, Football, Fun, HTML5, Mobile, Skill","thumb":"https:\/\/img.gamemonetize.com\/dde48ttk9pmk53o8q8t7mc0b3cjr3ftg\/512x384.jpg","width":"1280","height":"720"},{"id":"240","title":"World Cup 2020 Soccer","description":"World Cup 2020 Soccer Games : Real Football Games","instructions":"","url":"https:\/\/html5.gamemonetize.com\/5ce7bpap88hctyap0c062crr9rr9pm3v\/","category":"Sports","tags":"Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/5ce7bpap88hctyap0c062crr9rr9pm3v\/512x384.jpg","width":"800","height":"600"},{"id":"5194","title":"Head Soccer Football Game","description":"This soccer game consists of four game modes, each one more challenging than the previous one, so you can experience soccer from beginner and novice to Champion and Legend, until you become the God of the Big Head Soccer world.","instructions":"Use keyboard arrows to control the player","url":"https:\/\/html5.gamemonetize.com\/w4yrkybkptgn3aufegjhj10sxbgigeic\/","category":"Soccer","tags":"Ball, Football, Games, HTML5, Match 3, Multiplayer, Soccer","thumb":"https:\/\/img.gamemonetize.com\/w4yrkybkptgn3aufegjhj10sxbgigeic\/512x384.jpg","width":"800","height":"600"},{"id":"4947","title":"Spider man Football Game","description":"Do you lie spider man? then you are very right place Spider man Football Game is specially design for spider man lovers.Play beautiful football games with a newer, better, and faster free football world cup game experience. World Cup 2020 is the best football fun soccer game,","instructions":"Use Arrow key to move player Letters Z for hit X for pass the football","url":"https:\/\/html5.gamemonetize.com\/0343fgqcz5dy51xgi75k2hs5dfr6qo6r\/","category":"Sports","tags":"1 Player, Android, Ball, Football, Soccer, Spiderman","thumb":"https:\/\/img.gamemonetize.com\/0343fgqcz5dy51xgi75k2hs5dfr6qo6r\/512x384.jpg","width":"1280","height":"800"},{"id":"4983","title":"REAL FOOTBALL CHAMPIONS LEAGUE Football Strike","description":"Play beautiful football games with a newer, better, and faster free football worldcup game experience. World Cup 2020 is the best football fun soccer game, bringing football to a new era! And it’s better than ever. It is one of the most intense and addictive soccer game livescore or football games on the play market with smooth gameplay,","instructions":"Use keyboard arrow to control the player Use Z for hit Use X for pass","url":"https:\/\/html5.gamemonetize.com\/w21x5jncw29eo0yjbnpy6wcbux6yxxyu\/","category":"Sports","tags":"3D Games, Android, Boys, Football, Match3, World","thumb":"https:\/\/img.gamemonetize.com\/w21x5jncw29eo0yjbnpy6wcbux6yxxyu\/512x384.jpg","width":"900","height":"600"},{"id":"4680","title":"Stormy Kicker","description":"Who's the best football striker in the world? You could be the one if you take your team to the World cup title.","instructions":"It s simple - all you need to do is to tap at the right moment and kick the ball right into the net Extremely simple gameplay one touch is all is needed But is it easy ","url":"https:\/\/html5.gamemonetize.com\/m2e7nrrhrkjbwgda64o4wtpee4n07gst\/","category":"Sports","tags":"Football, Soccer, World","thumb":"https:\/\/img.gamemonetize.com\/m2e7nrrhrkjbwgda64o4wtpee4n07gst\/512x384.jpg","width":"800","height":"450"},{"id":"2867","title":"Goal Keeper","description":"Goalkeeper is in the goal that he should not allow the ball to enter the goal to get points, in the start screen. He should not lose more than three balls. Gradually, the speed of the game is increased to make you confused. Heave fun.","instructions":"Use your mouse to play the game or tap on the screen ","url":"https:\/\/html5.gamemonetize.com\/uwwsqj9kxgb00zar7hv0jz4vclko365y\/","category":"Sports","tags":"Football, Fun, HTML5, Kids, Mobile, Skill, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/uwwsqj9kxgb00zar7hv0jz4vclko365y\/512x384.jpg","width":"1280","height":"720"},{"id":"4370","title":"Pong Soccer","description":"Pong Soccer is a fun and addictive sports game. In this game, you have to hit the football into the opponent goal. You can start with normal level and after that use hard level. Good luck!","instructions":"arrows or touch control","url":"https:\/\/html5.gamemonetize.com\/iwnlw793ep92dkc0ovktztq7vhi09fcr\/","category":"Sports","tags":"Ball, Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/iwnlw793ep92dkc0ovktztq7vhi09fcr\/512x384.jpg","width":"960","height":"1280"},{"id":"3661","title":"Super Shooter","description":"To be a professional football player and enjoy the fun of the stadium. Let's try the cool football game! Beat all 12 levels and become a famous soccer player!","instructions":"mouse or touch screen","url":"https:\/\/html5.gamemonetize.com\/z3joeqjat47tn9llzqrhq46z0p5ben0e\/","category":"Sports","tags":"Ball, Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/z3joeqjat47tn9llzqrhq46z0p5ben0e\/512x384.jpg","width":"1280","height":"720"},{"id":"3002","title":"Flat Crossbar Challenge","description":"Flat Crossbar Challenge Arcade Free Game HTML5","instructions":"Mouse or touch","url":"https:\/\/html5.gamemonetize.com\/q6ws1i6r367spdq853m2b017tj1fkg4b\/","category":"Soccer","tags":"Arcade, Soccer","thumb":"https:\/\/img.gamemonetize.com\/q6ws1i6r367spdq853m2b017tj1fkg4b\/512x384.jpg","width":"1136","height":"640"},{"id":"2810","title":"Pill Soccer","description":"Get ready for the most challenging soccer matches with Pill Soccer. Play against dozens of real players or challenge your friends on “2 Player” mode. On Google Play Store https:\/\/play.google.com\/store\/apps\/details?id=com.hihoygames.PillSoccer","instructions":"2 Player Mode Player 1 Jump Up Arrow Left Left Arrow Right Right Arrow Kick P or Down Arrow Super Bonus K Player 2 Jump W Left D Right A Kick S","url":"https:\/\/html5.gamemonetize.com\/ow6fhg7fh9hy8t4plmlf760y2tzh6kqv\/","category":"Soccer","tags":"Ball, Football, Soccer, Sport","thumb":"https:\/\/img.gamemonetize.com\/ow6fhg7fh9hy8t4plmlf760y2tzh6kqv\/512x384.jpg","width":"800","height":"450"},{"id":"2222","title":"Football Soccer World Cup","description":"The whole stadium is looking at you, it all comes down to one kick. Your team is depending on you. Pick your favorite team and see if you can lead them all the way to the final victory. Get a kick out of this fun sports game now.","instructions":" WASD to move character Space or X to shoot ball E or Z to pass ball","url":"https:\/\/html5.gamemonetize.com\/9usvzqu6z2g7r1ym8g0layskj5oixk46\/","category":"Sports","tags":"3D Games, Soccer, Sport, Sports, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/9usvzqu6z2g7r1ym8g0layskj5oixk46\/512x384.jpg","width":"960","height":"540"},{"id":"2100","title":"Monster Truck Soccer","description":"How about a great football game with your monster truck? If you're ready, jump into your truck and start an action-packed football game! Have fun!","instructions":"Game Controls SPACE Fire MOVE Arrow Keys","url":"https:\/\/html5.gamemonetize.com\/sngc6s9q5cf983jdn4u88nd02m7ovzxo\/","category":"Sports","tags":"Ball, Football, Fun, Funny, Game, Games, HTML, HTML5, Monster, New, Soccer, Sport, Sports, Truck","thumb":"https:\/\/img.gamemonetize.com\/sngc6s9q5cf983jdn4u88nd02m7ovzxo\/512x384.jpg","width":"800","height":"450"},{"id":"1424","title":"Finger Soccer HD","description":"Finger Soccer features: - fun gameplay - multiple game modes","instructions":"Use mouse to play","url":"https:\/\/html5.gamemonetize.com\/86kbn5nq7jhzzkkxp1camtsg78gkvqy4\/","category":"Soccer","tags":"2D, Soccer, WebGL","thumb":"https:\/\/img.gamemonetize.com\/86kbn5nq7jhzzkkxp1camtsg78gkvqy4\/512x384.jpg","width":"960","height":"600"},{"id":"1377","title":"European Football","description":"Soccer Simulator features: - 2 game modes - fun simulation gameplay","instructions":"WASD - move X Space - shoot Z E - pass Tab Escape - Pause","url":"https:\/\/html5.gamemonetize.com\/avbwl97t4aupzxi433vl0i7ivx9jhofr\/","category":"Soccer","tags":"3D Games, Soccer, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/avbwl97t4aupzxi433vl0i7ivx9jhofr\/512x384.jpg","width":"960","height":"540"},{"id":"1326","title":"Soccer Physics Online","description":"Challenge an online player or a friend in two player mode in this fun 3D online soccer game.","instructions":"W or tap to jump and kick","url":"https:\/\/html5.gamemonetize.com\/dq2rg4zptft7an13oyo8pj4mx5rwpq23\/","category":"Soccer","tags":".io, .io Games, 3D, Funny, Physics, Sports","thumb":"https:\/\/img.gamemonetize.com\/dq2rg4zptft7an13oyo8pj4mx5rwpq23\/512x384.jpg","width":"800","height":"600"},{"id":"832","title":"Penalty Challenge Multiplayer","description":"Penalty Challenge Multiplayer is a HTML5 Sport Game. Select between 32 different team your favorite one. You have 5 attempts to pass the goalie and other 5 to save your opponent’s kicks! It’s all in your hands and feet! 3 Game’s Mode: - Multiplayer mode - Play against the pc - Challenge a friend playing on the same device","instructions":"Swipe with your finger to kick a penalty and move the mouse or your finger to move keeper gloves ","url":"https:\/\/html5.gamemonetize.com\/czy29ldafw7pdecjo7irqipcld83ovn1\/","category":"Sports","tags":"Football","thumb":"https:\/\/img.gamemonetize.com\/czy29ldafw7pdecjo7irqipcld83ovn1\/512x384.jpg","width":"1280","height":"640"},{"id":"823","title":"Crossbar Challenge","description":"Crossbar Challenge is a HTML5 Sport Game. If you are a fun of Penalty Games you must try this challenging variation. Your aim is to hit the crossbar, not scoring a goal. There is no Goalkeeper to defeat, it’s only you and the crossbar. Do you think it’s easier? Try it now!","instructions":"Swipe to kick the ball ","url":"https:\/\/html5.gamemonetize.com\/57b3u5s0l0ig28ps6dy5ppaeipf9u9gz\/","category":"Sports","tags":"3D, Football, Skill","thumb":"https:\/\/img.gamemonetize.com\/57b3u5s0l0ig28ps6dy5ppaeipf9u9gz\/512x384.jpg","width":"1920","height":"1080"},{"id":"633","title":"Soccer Match 3","description":"Soccer Match 3 is a free online game three in a row, in which you have to put the blocks of the same color in a series of three pieces or more to achieve the highest possible score, be careful to account the scale to the left did not fall too low, otherwise the game will be over. The game is done to a beautiful colorful style! Enjoy the game!","instructions":"Use mouse or tap to screen to play this game ","url":"https:\/\/html5.gamemonetize.com\/p6pbvd1vvpsufpjvpgpurz6vrgm2ovad\/","category":"Soccer","tags":"Fun, HTML5, Kids, Match 3, Match-3, Match3, Skill","thumb":"https:\/\/img.gamemonetize.com\/p6pbvd1vvpsufpjvpgpurz6vrgm2ovad\/512x384.jpg","width":"1280","height":"720"},{"id":"414","title":"Multiplayer Pong Time","description":"Multiplayer Pong Time is fun sport game suitable for all ages. Type your nick name wait for your opponent and start playing. Have fun!","instructions":"Mouse or tap to play ","url":"https:\/\/html5.gamemonetize.com\/krl6g7pxkwbbvw49g355zqgwdk36eplz\/","category":"Soccer","tags":"Android, Ball, Boys, Football, Fun, HTML5, Hypercasual, Kids, Multiplayer, Online, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/krl6g7pxkwbbvw49g355zqgwdk36eplz\/512x384.jpg","width":"854","height":"480"},{"id":"360","title":"FootyZag","description":"Pass the ball to your teammate and score! Complete challenging levels and unlock crazier and stronger teams. Make sure not to pass the ball to the opponent team!","instructions":"Click left or right side of the screen or press left or right arrow key to pass the ball or kick ","url":"https:\/\/html5.gamemonetize.com\/v0re5iv7fc887jwvc5lb22ni5pv05hb0\/","category":"Soccer","tags":"Cartoon, Football, Soccer, Sports","thumb":"https:\/\/img.gamemonetize.com\/v0re5iv7fc887jwvc5lb22ni5pv05hb0\/512x384.jpg","width":"450","height":"800"}]