[{"id":"65686","title":"Draw Weapon Fight Party","description":"In Draw Weapon - Fight Party, you can draw your own weapons. Feel free to write your weapon, but keep an eye on the amount of ink left. Your creativity determines your combat style. Enter the 3D battle arena and fight against other opponents in an action-packed showdown. Draw precisely, craft the ultimate weapon, and crush your opponents to become the ultimate warrior.","instructions":"Mouse click or tap to play ","url":"https:\/\/html5.gamemonetize.com\/mdigfdn6gh844cm4u2xwauqu6cm02vi4\/","category":"Stickman","tags":"Battle, Draw, Fight, weapons","thumb":"https:\/\/img.gamemonetize.com\/mdigfdn6gh844cm4u2xwauqu6cm02vi4\/512x384.jpg","width":"1280","height":"720"},{"id":"65921","title":"Italian Brainrot Hangman","description":"Your friends tung tung tung sahur, tralaleo tralala, and more need your help to solve these fun, engaging Hangman puzzles! Guess what Italian brainrot character by guessing letters! Will you guess em all, or will the man be the hanged? Find out today by playing our free online Italian brainrot hangman puzzle! Its fun for everyone!","instructions":"Click or tap the letters to solve the Hangman puzzle Can you guess em all ","url":"https:\/\/html5.gamemonetize.com\/sobqjvkty29son7ydz6w63m8g3ws6zmz\/","category":"Stickman","tags":"Clicker, Fun, Memory","thumb":"https:\/\/img.gamemonetize.com\/sobqjvkty29son7ydz6w63m8g3ws6zmz\/512x384.jpg","width":"800","height":"600"},{"id":"65065","title":"KingdomsRise","description":"The kingdom guarded by the player is facing attacks from all directions. As a mission commander, players must use wisdom and strategy to lead their troops in a tenacious resistance and defend the peace of this land. The enemies will become increasingly powerful, and players need to constantly upgrade their units. By clicking on the upgrade option at the bottom of the screen and spending coins to enhance the swordsmans attack power, they can more effectively kill enemies; Enhance the archers range and firing rate. good luck","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/kmrzeqw5hgzthgs5l9n4r09ohyixkvsn\/","category":"Stickman","tags":"Defense, Fight, Fighting, Tower Defense","thumb":"https:\/\/img.gamemonetize.com\/kmrzeqw5hgzthgs5l9n4r09ohyixkvsn\/512x384.jpg","width":"1280","height":"720"},{"id":"64793","title":"Smoke man runner 2d ","description":"Smoke Man Runner 2D is an action-packed endless runner game where every jump counts. With clean visuals, catchy music, and simple controls, its a fun and addictive game for players of all ages.","instructions":"TOUCH CONTROLLER ","url":"https:\/\/html5.gamemonetize.com\/xo9i2yudr053uwqatdlmzm0z7b8q22x4\/","category":"Stickman","tags":"1 Player, 2 Player Games, Action, Adventure, Android, Arena, atv, Baby Games, Best, blocky, Bridge, Collecting","thumb":"https:\/\/img.gamemonetize.com\/xo9i2yudr053uwqatdlmzm0z7b8q22x4\/512x384.jpg","width":"1152","height":"648"},{"id":"64747","title":"Fireboy And Watergirl Online","description":"Join an exciting 2-player adventure in Fireboy And Watergirl Online. Begin the mysterious Forest Temple. Work together, solve puzzles, and overcome obstacles in this action-packed casual game. You can choose different modes to experience. Collect gems with your friends in Breakout mode to unlock the temple, push the chests and open the doors. In Super Adventure King, you need to solve puzzles with your strategy.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/1msc3emdw1a5nc6m5zkzmxzogbe66mm2\/","category":"Stickman","tags":"Adventure, Fire, Forest, water","thumb":"https:\/\/img.gamemonetize.com\/1msc3emdw1a5nc6m5zkzmxzogbe66mm2\/512x384.jpg","width":"1280","height":"720"},{"id":"64465","title":"Human Stickman Gun","description":"In Human Stickman Gun game, you start as a small, simple gun. As you move forward, you collect stickmen who join your gun and help it grow stronger. Each stickman takes a spot to build a bigger and better gun. Shoot barrels to earn money, dodge obstacles, and keep upgrading your gun. There are lots of cool and tricky levels to explore. Have fun and good luck!","instructions":"Tap or mouse click to play ","url":"https:\/\/html5.gamemonetize.com\/qqyvna26o4q93x26lper17puv5hl6t1j\/","category":"Stickman","tags":"Gun, Hypercasual, Stickman","thumb":"https:\/\/img.gamemonetize.com\/qqyvna26o4q93x26lper17puv5hl6t1j\/512x384.jpg","width":"350","height":"600"},{"id":"16104","title":"Karate Fighter","description":"Play as a shadow karate master. Use all the Karate's katas, the KARATE-DO in this ultimate fighting game. Boxe and battle your enemies, and they will do it. You must become a fighting tiger to survive.","instructions":"Play as a shadow karate master Use all the Karate s katas the KARATE-DO in this ultimate fighting game Boxe and battle your enemies and they will do it You must become a fighting tiger to survive ","url":"https:\/\/html5.gamemonetize.com\/tk6dz0c1ihttthdqqhm1g5r56n60bbf5\/","category":"Stickman","tags":"Classic, Fight, Fighting, Gun, Kart, Kid, Kids, Kill, Killing, Ninja, Ninjago, Punch, Skill, Skills, Street Fighting, Zombie","thumb":"https:\/\/img.gamemonetize.com\/tk6dz0c1ihttthdqqhm1g5r56n60bbf5\/512x384.jpg","width":"800","height":"600"},{"id":"63334","title":"One2One","description":"Tap numbers or letters on the grid in ascending order (1&rarr;2&rarr;3&hellip; or A&rarr;B&rarr;C&hellip;) as quickly as possible. Choose a grid size and mode (numbers or letters). Start the timer, then tap tiles sequentially. Correct taps turn green and lock; wrong taps flash red. The timer stops when the last tile is tapped, displaying your completion time. Challenge yourself to beat your best record! This game trains focus, visual perception, and cognitive agility, making it perfect for brain training. Practice daily to improve speed and concentration. Enjoy the challenge!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/vbwwmujt01ywuyt77w11a5elbsiv80tf\/","category":"Stickman","tags":"Matching","thumb":"https:\/\/img.gamemonetize.com\/vbwwmujt01ywuyt77w11a5elbsiv80tf\/512x384.jpg","width":"1080","height":"1920"},{"id":"62751","title":"Draw War","description":"Unleash your creativity in Draw War. This is a wonderful strategy game. Here drawing meets battles. Build a hero lineup, draw your legions, then unleash the power of your army. The numbers show the soldiers summoned. Click to send Shielded Soldiers, Soldiers on Horseback, or Super Beasts.","instructions":"Mouse click or tap to play ","url":"https:\/\/html5.gamemonetize.com\/gggjzdrli2wklz90wyv09vtd1bjrwl3t\/","category":"Stickman","tags":"Army, Battle, Draw, Strategy","thumb":"https:\/\/img.gamemonetize.com\/gggjzdrli2wklz90wyv09vtd1bjrwl3t\/512x384.jpg","width":"750","height":"1334"},{"id":"60367","title":"Assassin Knight","description":"Step into the thrilling world of Hunter Knight a fast-paced online game for stealthy and strategic players that takes you on a wild adventure as a hunter with a deadly knife. With multiple enemies to kill, challenging missions to complete and rewards to collect, this game will test your skills and keep you on the edge of your seat.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ksq2yt870myyw9a0bzk6spzdxqzew0nv\/","category":"Stickman","tags":"assassin","thumb":"https:\/\/img.gamemonetize.com\/ksq2yt870myyw9a0bzk6spzdxqzew0nv\/512x384.jpg","width":"1280","height":"720"},{"id":"61439","title":"Castle Wars: Cell Battle","description":"Dive into an exciting strategy game! You will find a map divided into segments, full of obstacles and enemies of different levels. Use coins to place your heroes: warriors, mages, archers, dragons or catapults. Each character has unique abilities that will help in the fight against opponents. Earn coins by destroying enemies and barriers to buy new heroes and strengthen your army. The games special feature is the ability to combine characters of the same level, creating stronger fighters to defeat powerful opponents.","instructions":"Start by choosing a hero use coins to place warriors mages archers dragons or catapults on the map Drag characters to empty segments to block enemies and destroy obstacles ","url":"https:\/\/html5.gamemonetize.com\/gq4qclr7cm0m08dakx3i7arzw5caq9tb\/","category":"Stickman","tags":"1 Player, 3D, amazing, Battle, Castle, Casual, Dragon, free html5 games for your website, Levels, Magic, unity, War, Warrior, Wizard","thumb":"https:\/\/img.gamemonetize.com\/gq4qclr7cm0m08dakx3i7arzw5caq9tb\/512x384.jpg","width":"1080","height":"1920"},{"id":"61184","title":"Draw Save Puzzles","description":"Draw Save Puzzles is a fun and creative game where you solve puzzles by drawing lines or shapes to guide the Stickman to safety. Each level offers new challenges, testing your logic and problem-solving skills! Explore tons of amazing &amp; challenging levels and try to complete them all. Good luck!","instructions":"Tap or mouse click to play ","url":"https:\/\/html5.gamemonetize.com\/bl9mbkidqt65a2zi3akccumx2irkes65\/","category":"Stickman","tags":"Draw, Puzzle, Stickman","thumb":"https:\/\/img.gamemonetize.com\/bl9mbkidqt65a2zi3akccumx2irkes65\/512x384.jpg","width":"350","height":"600"},{"id":"60942","title":"Sprunki Master","description":"Sprunki Master is an exciting Stickman Music game inspired by the popular music-mixing game Incredibox. It builds on the original games creative foundation with fresh soundscapes, visuals, and interactive elements. Created by VodoGame, Sprunki Master introduces new characters, beats, rhythms, and melodies, offering music lovers and gamers a vibrant platform to explore their creativity.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/d81gftv0bjirnvsqazb705woirohi6id\/","category":"Stickman","tags":"Music, Sprunki, Stickman","thumb":"https:\/\/img.gamemonetize.com\/d81gftv0bjirnvsqazb705woirohi6id\/512x384.jpg","width":"1280","height":"720"},{"id":"60154","title":"Sprunki Rage Stickman Incredibox","description":"Sprunki Rage Stickman Incredibox is fun and addictive beatemup game with realistic physics and hardcore gameplay. With simple controls you can perform amazing stunts and blows to defeat your opponents. Unknown enemies emerge in the city! Sprunki hero continues to fight them off with a wide array of deadly weapons as well as helicopters and robots, who can devastate all enemies at once! The followers of Stickman games still have not forgotten the feeling of tight guillotine and ecstatic graphics of Stickman Brawl of Rage. And what would you expect in a recent version of Stickman fight and this revenge? Whether this revenge will end or not?","instructions":"Arrow keys - move space - jump Z X - attack C - defend","url":"https:\/\/html5.gamemonetize.com\/m8x6penzlmav9y79ypzlw9i10usli9ld\/","category":"Stickman","tags":"Action, Arcade, Sprunki, Stickman","thumb":"https:\/\/img.gamemonetize.com\/m8x6penzlmav9y79ypzlw9i10usli9ld\/512x384.jpg","width":"960","height":"600"},{"id":"60341","title":"Tall Boss Run","description":"The parkour game Tall Boss Run is fun to play! To defeat the robots and finish the levels, make your tall man as tall and wide as possible. Guide him through the right gates to grow bigger and taller. Watch out for obstacles, if you hit them, your tall man will fall apart. It&rsquo;s the best parkour game ever have fun!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/skiossve1c9yi6q6lewmovlmntq35iis\/","category":"Stickman","tags":"Hypercasual, running, Sprunki, Stickman","thumb":"https:\/\/img.gamemonetize.com\/skiossve1c9yi6q6lewmovlmntq35iis\/512x384.jpg","width":"350","height":"600"},{"id":"59119","title":"Santa Stick","description":"Join Santa in Santa Stick, an exciting HTML5 game where precision is key! Help Santa cross from one platform to another by stretching his magical stick to the perfect length. Be careful if the stick is too short or too long, Santa will tumble into the abyss, and the journey ends! This endless challenge gets harder with every step, testing your timing and skill. Earn points for each successful crossing and aim for the highest score. How far can you go? Play Santa Stick and find out in this fun, addictive game for all ages!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/08g52hfq31xhdc73b4dr3zm6254ci1lq\/","category":"Stickman","tags":"Arcade, HTML, HTML5, mapi games, Santa, Santa Claus","thumb":"https:\/\/img.gamemonetize.com\/08g52hfq31xhdc73b4dr3zm6254ci1lq\/512x384.jpg","width":"1024","height":"600"},{"id":"58086","title":"Mob Control Shoot","description":"Mob Control Shoot is an exciting arcade shooter where you can have endless shooting fun in fast-paced combat! You will control a cannonball firing hordes of heroic characters, facing many enemies. A quick click to launch more heroes and help you generate more heroes through the digital gate.","instructions":"Mouse click or tap to play ","url":"https:\/\/html5.gamemonetize.com\/mak258eeak9s5x0um9vjkb0zqgx4m3pv\/","category":"Stickman","tags":"Battle, Fight, Funny","thumb":"https:\/\/img.gamemonetize.com\/mak258eeak9s5x0um9vjkb0zqgx4m3pv\/512x384.jpg","width":"720","height":"1280"},{"id":"58065","title":"Stick Archer Champion","description":"Defeat other stick figures and show the world whos the finest archer in Stick Archer Champion, an action game. Delve into the realm of stick figures and unearth their secret meanings. Arm yourself with better bows, arrows, quivers, and shields. Learn new talents and unlock new effects to unlock more arrows. Add personality to your stickman by letting him wear a variety of caps, masks, hairdos, beards, and animations. Add more stickers to the stickman flag collection.","instructions":"Instructions Move from side to side to better aim at your enemy and avoid enemy arrows You can collect many coins with each completed level and with those coins improve your arrows unlock new skin and powers Controls Mouse click to select Keys A D a","url":"https:\/\/html5.gamemonetize.com\/sau8efctplff566hb06hzx5jyhgu6xyd\/","category":"Stickman","tags":"arrows, kiz10, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/sau8efctplff566hb06hzx5jyhgu6xyd\/512x384.jpg","width":"900","height":"600"},{"id":"56881","title":"Draw Save Puzzle","description":"Draw Save Puzzle - draw one line to save Stickman from the threat! Are you a good artist or Do you want to test your creative skills? Are you a fan of puzzles? Now you have a good chance! Draw a line to help the little man and protect him from swords, bullets, bombs.... and many other life-threatening attacks! You are free to draw any cover and protection to help the little man survive. Learn to draw lines creatively, develop logic and grow your brain! GAME FEATURES + Lots of levels and endless fun! + Never be bored again! + Simple but amazing physics system! + Improve your brain! + Exciting and relaxing gameplay.","instructions":" Draw only one continuous line to complete the level task Make sure your line does not damage the Stickman you need to protect There can be more than one answer Draw any thing you want as each one can be a solution to the challenge ","url":"https:\/\/html5.gamemonetize.com\/76kn0zqb9ti95c31997em839qaaq0bj2\/","category":"Stickman","tags":"1 Player, 2D, Arcade, Best Games, Bird, Brain, Casual, Game, Games, Puzzle, Stickman","thumb":"https:\/\/img.gamemonetize.com\/76kn0zqb9ti95c31997em839qaaq0bj2\/512x384.jpg","width":"800","height":"600"},{"id":"57468","title":"Stick Man Battle Fighting","description":"Enter the world of Stick Man Battle Fighting and every move matters! This casual fighting game lets you unleash your skills in dynamic stickman battles against enemies. Master various fighting styles and begin exciting single-mode combat. Choose a weapon and customize your hero.","instructions":"Mouse click or tap to play ","url":"https:\/\/html5.gamemonetize.com\/lyqrzmhsa4gdejjhe2c1fadi6uw6gaen\/","category":"Stickman","tags":"Battle, Fight, Superhero","thumb":"https:\/\/img.gamemonetize.com\/lyqrzmhsa4gdejjhe2c1fadi6uw6gaen\/512x384.jpg","width":"1920","height":"1080"},{"id":"57309","title":"Dont be angry with match man","description":"This is a match man character game. Each level we have prepared unexpected traps for everyone, the trap layout in the game is the need to experience the game to clear, the game needs to have patience to go through","instructions":"The main controls of the game are forward backward and jumping","url":"https:\/\/html5.gamemonetize.com\/ab073sarz93hhpqep83h98auqq9o4yyf\/","category":"Stickman","tags":"1 Player, Interactive, Rescue, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ab073sarz93hhpqep83h98auqq9o4yyf\/512x384.jpg","width":"1920","height":"1080"},{"id":"55958","title":"Stickman vs Zombies Minecraft","description":"Stickman vs Zombies Minecraft is an action-adventure platform game in which you can play as a brave stick ninja. When you play as a stickman hero, eliminate all the craft zombies and collect coins with each eliminated sombie so you can unlock new skins. Move around the map and look for all the zombies before they find you and run to catch you or shoot at your position. Dont leave even one alive, dont stop moving or all the zombie craft will try to catch you.","instructions":"Instructions Search and eliminate all the craft zombies in each level to emerge alive and move on to another level WASD to move and jumpSpacebar and Click mouse to attackE ShieldUse the game buttons for touch devices ","url":"https:\/\/html5.gamemonetize.com\/bztju5apx957kapkxnzocq3au3f8kq3y\/","category":"Stickman","tags":"Fighting, kiz10, Minecraft, Zombie","thumb":"https:\/\/img.gamemonetize.com\/bztju5apx957kapkxnzocq3au3f8kq3y\/512x384.jpg","width":"900","height":"600"},{"id":"55254","title":"Zombie Royale Io","description":"Zombie Royale io is a collecting survival arcade IO game. With 3D cartoon survivors, you need to help them rescue more survivors and shoot down as many zombies as you can. As the time goes on, you will meet more and more strong zombies. They will come and chase the last survivors randomly. You can summon more soldiers and bombs in the game. After each round, you can use the gold coins to upgrade your survivors.","instructions":"Mouse click or tap to play ","url":"https:\/\/html5.gamemonetize.com\/d3zex3l2rordlog1xeiq4id7521xskby\/","category":"Stickman","tags":".io Games, 1 Player, Stickman","thumb":"https:\/\/img.gamemonetize.com\/d3zex3l2rordlog1xeiq4id7521xskby\/512x384.jpg","width":"720","height":"1280"},{"id":"55590","title":"City Run.io","description":"In this fast-paced game, youll find yourself hurtling through bustling cities, dodging pedestrians and obstacles as you go. Your goal is to collect grey pedestrians and merge them into a single, giant entity, allowing you to take on other opponents and compete for dominance. As you progress, youll need to navigate increasingly crowded streets and challenging terrain to emerge victorious. Can you outrun and outmaneuver your opponents to be crowned the ultimate winner?","instructions":"Slide your finger to play or mouse click ","url":"https:\/\/html5.gamemonetize.com\/yffqin0i6g8wp9s0d2ceppd0nafsp15m\/","category":"Stickman","tags":".io, .io Games, 2 Player, 2 Player Games, 3D, 3D Games, Multiplayer, Stickman, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/yffqin0i6g8wp9s0d2ceppd0nafsp15m\/512x384.jpg","width":"350","height":"600"},{"id":"55186","title":"Stickman The Flash","description":"Stickman The Flash is a fighting RPG arcade game with 2D stickman warriors. In the Survival Mode, you need to survive as long as you can by dodging red areas and killing incoming enemies. You can collect different weapons when you kill the corresponding enemies. When you earn enough gems, you can unlock and equip them in the Equipment Store, and they will increase your full abilities. Keep calm and slaughter them all!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/qfh8jceadtfl6m0ilctnpy6elqpdp04p\/","category":"Stickman","tags":"1 Player, Action, Stickman","thumb":"https:\/\/img.gamemonetize.com\/qfh8jceadtfl6m0ilctnpy6elqpdp04p\/512x384.jpg","width":"1440","height":"640"},{"id":"55692","title":"Wood Man Cutter","description":"Welcome to Wood Man Cutter 3D Game! Tap and hold to start walking, rotating with an elastic rope. Begin cutting wood from trees, but be careful to avoid metal objects and rocks. Can you pass the level 3? Enjoy this game on gamemonetize.com","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/9dn6qz1nr6ldwr082r4t7o55aeyo3owt\/","category":"Stickman","tags":"3D, 3D Games, Adventure, cut, Forest, Hypercasual, Relaxation, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/9dn6qz1nr6ldwr082r4t7o55aeyo3owt\/512x384.jpg","width":"350","height":"600"},{"id":"55249","title":"Javelin Battle","description":"Javelin Battle is a spear-throwing physics puzzle game with 2D stickman models. We need you to eliminate all incoming enemies at each level in the Normal Mode. When you destroy enemy infantrys shields, they will run to you quickly. I strongly suggest you destroy the enemy spearmen on the platforms first. Dont forget to choose skills to increase your abilities and power. Keep calm and aim carefully.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/a006nqrea1p11ps579qsfeljddvark7m\/","category":"Stickman","tags":"1 Player, Battle","thumb":"https:\/\/img.gamemonetize.com\/a006nqrea1p11ps579qsfeljddvark7m\/512x384.jpg","width":"1136","height":"640"},{"id":"55192","title":"Party Games Mini Shooter Battle","description":"Party Games: Mini Shooter Battle is a battle-royale shoot-em-up game with 2D cartoon models. In 4 modes, you can shoot other players to earn scores for coins and gems. Then you can buy more roles and guns in the Shop. Your character can aim at the closest target automatically so that you only need to fire and dodge bullets from enemies. More kills and less death will make you claim more coin and gem rewards. Good luck!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/ss99whqqix1wim1twd1aq59xtdqw8iu5\/","category":"Stickman","tags":".io Games, Battle","thumb":"https:\/\/img.gamemonetize.com\/ss99whqqix1wim1twd1aq59xtdqw8iu5\/512x384.jpg","width":"1280","height":"720"},{"id":"54779","title":"Princess Fashion Makeover","description":"Princess Fashion Makeover is a dress up game. If you own many beautiful princess dresses,there are many beautiful tiaras, bracelets, high heels, magic wands, necklaces and earrings. What a happy little princess you will be! This game provides you with many gorgeous princess clothes and princess accessories. You can match as you like. Fulfill all your princess fantasies. After finishing dressing up, remember to choose a fashionable pose and let the camera record this unforgettable moment.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/sc9ejt7r48hraoupnzd2kw0smy7j8wvu\/","category":"Stickman","tags":"Makeover","thumb":"https:\/\/img.gamemonetize.com\/sc9ejt7r48hraoupnzd2kw0smy7j8wvu\/512x384.jpg","width":"768","height":"1280"},{"id":"54747","title":"Desert Jump","description":"ChatGPT Desert Jump is an engaging and challenging game set in a vast, arid desert landscape. Players use the mouse click to leap from one cube to the next, navigating a path through the sandy terrain. Timing and precision are crucial as each jump requires careful calculation to avoid falling. With stunning desert visuals and progressively difficult levels, Desert Jump offers an addictive and immersive experience for all ages.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/i3ki8ewmijq0g4lwi8u8wstx5toljd0c\/","category":"Stickman","tags":"Adventure, Crazy, jump, Jumping, Stickman","thumb":"https:\/\/img.gamemonetize.com\/i3ki8ewmijq0g4lwi8u8wstx5toljd0c\/512x384.jpg","width":"800","height":"600"},{"id":"54155","title":"Count Escape Rush","description":"Count Escape Rush plays like a 3D stickman running arcade game. Different from traditional running arcade games, your members will run backward and shoot the chasing enemies. With 3D stickman soldiers, you need to collect more members and weapons to fight incoming red enemies before you arrive at the finish line. Any obstacles will decrease your members or make you lose directly. Dont forget to pass the green numbered walls and collect weapons to increase your firepower.","instructions":"Mouse click or tap to play ","url":"https:\/\/html5.gamemonetize.com\/f09c7w9y94ke2bn2nlisnx1l7ad1mc23\/","category":"Stickman","tags":"Stickman","thumb":"https:\/\/img.gamemonetize.com\/f09c7w9y94ke2bn2nlisnx1l7ad1mc23\/512x384.jpg","width":"720","height":"1280"},{"id":"53794","title":"Figher Stick Hero","description":"Welcome to Figher Stick Hero Stickman, an exhilarating 2D stickman game that will test your dueling skills. Whether youre playing in an arcade or survival mode, get ready to engage in intense battles against your opponents. Choose from a variety of weapons, character colors, and character decorations to customize your stickman. Remember to attack while moving to gain an advantage and earn higher scores by defeating other stickmen.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/6is41jnk4xgxy8n18o6fkto7vasca5yj\/","category":"Stickman","tags":"1 Player, Fight","thumb":"https:\/\/img.gamemonetize.com\/6is41jnk4xgxy8n18o6fkto7vasca5yj\/512x384.jpg","width":"1334","height":"750"},{"id":"54709","title":"Pop It 3D Fidget Toy Maker","description":"Pop It 3D Fidget Toy Maker Online is a relaxing game on Yiv.com. This game has 2 main parts. Each part has 3 mini-games. You can customize your own Pop It toys. You can spray various paints on pop-it toys and put your favorite stickers on them. This game not only has soothing sound effects but also bright colors and smooth animations. This game can definitely make you feel relaxed and happy after a day of hard work. If you are interested in this game, come and enjoy it. Have fun.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/1n2sqpxhwi08qaxtp8fu8tcpagguqu3y\/","category":"Stickman","tags":"Relaxation","thumb":"https:\/\/img.gamemonetize.com\/1n2sqpxhwi08qaxtp8fu8tcpagguqu3y\/512x384.jpg","width":"1080","height":"1920"},{"id":"53925","title":"Hex Planet Idle","description":"Hex Planet Idle is both an RPG adventure game and a survival idle game with 3D models. You can control a stickman warrior to discover the whole universe by collecting resources and unlocking new areas. When you step on the white lighting areas, you will know the resource request of the next area. Get close to any items to collect them automatically. If I were you, I would unlock all areas because of the plentiful resources.","instructions":"Mouse click or tap to play ","url":"https:\/\/html5.gamemonetize.com\/ov7ym4r295rq63tgqhkchxj6mh13832b\/","category":"Stickman","tags":"1 Player, Stickman, Strategy","thumb":"https:\/\/img.gamemonetize.com\/ov7ym4r295rq63tgqhkchxj6mh13832b\/512x384.jpg","width":"720","height":"1280"},{"id":"54577","title":"Crazy 3","description":"Crazy Three is a unique puzzle game that combines stickman fights, battles, and wars with physics-based mechanics, where all objects are affected by gravity. With over 200 challenging levels and multiple solutions for each puzzle, the game caters to different playstyles. Featuring stunning cartoon graphics, It&rsquo;s a fun way to improve your problem-solving and stickman drawing skills. Play it now and start your stickman adventure!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/2enjk01rxovd1dm7hov47xcp1och196x\/","category":"Stickman","tags":"Draw, Physics, Puzzle, Stickman","thumb":"https:\/\/img.gamemonetize.com\/2enjk01rxovd1dm7hov47xcp1och196x\/512x384.jpg","width":"1280","height":"720"},{"id":"53855","title":"Royal Elite Archer Defense","description":"Archery Bastions: Castle War plays like a team archery arrow launch puzzle strategy game with 3D stickman archers and castles. Your target is to eliminate all enemy archers before they eliminate yours. Be aware of the enemy melee troops, they will crash your tower if you cant shoot them down before they get close to your castle. For skins, they will only change the shape of your arrows rather than power. Use the coins to upgrade your Team and Castle first!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/t6s0l5zzll8dwu50dgsi037o7sj9cga6\/","category":"Stickman","tags":"arrow, Strategy","thumb":"https:\/\/img.gamemonetize.com\/t6s0l5zzll8dwu50dgsi037o7sj9cga6\/512x384.jpg","width":"750","height":"1334"},{"id":"51738","title":"stickman base defense","description":"Welcome to stickman base defense - the ultimate arcade idler browser game! Immerse yourself in the world of stickman heroes, where you must protect the base from hordes of attacking enemies. Your mission: Collect resources, build protective walls and towers, and upgrade your hero to create the ultimate defense!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/10jlapj6zx3rwude8qk6mc0xhze2f5bf\/","category":"Stickman","tags":"Action, Defense, Stickman, Tower Defense","thumb":"https:\/\/img.gamemonetize.com\/10jlapj6zx3rwude8qk6mc0xhze2f5bf\/512x384.jpg","width":"1080","height":"720"},{"id":"51145","title":"Stretch huggy Monster","description":"Navigate through the levels by extending the limbs of the character while steering clear of obstacles. Be cautious not to overstretch, as it may lead to tearing! Stretch Man offers an enjoyable and addictive puzzle gaming experience suitable for all. Whether youre looking for casual entertainment or a way to pass the time during moments of leisure, its perfect for any occasion.","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/wy6cwdoxnvmfqcu4cipvvvd755vvvgj2\/","category":"Stickman","tags":"Boys, Monster, Puzzle, Quiz, Skibidi Toilet","thumb":"https:\/\/img.gamemonetize.com\/wy6cwdoxnvmfqcu4cipvvvd755vvvgj2\/512x384.jpg","width":"600","height":"800"},{"id":"51471","title":"Stick Run Parkour","description":"Single player infinity Run Funny Arcade Stickman Parkour Game by Baran Yel Super Cluster Hub . Coming Soon; Market Costumes Effects New Regions New Objectiles","instructions":"W A S D - Movement P - Pause Space - Start","url":"https:\/\/html5.gamemonetize.com\/vlget2spakvpr60kgec5oup19mdex93p\/","category":"Stickman","tags":"Arcade, Stickman","thumb":"https:\/\/img.gamemonetize.com\/vlget2spakvpr60kgec5oup19mdex93p\/512x384.jpg","width":"800","height":"600"},{"id":"51359","title":"Shadow Stickman Fight","description":"Shadow Stickman Fight is an awesome and intense 2D ninja survival arcade game. You have to survive the endless waves of enemies with stickman ninjas. Every time you pass a belt exam, you get the examiner&rsquo;s hat and weapon. You can use souls to trade items or earn gifts. You have to follow the white dots and hit the enemies. You have to time your attack when enemies are in your attack distance. You can also enter the arsenal and choose different equipment, like helmets and weapons.","instructions":"On PC A move left D move right On Mobile Swipe or tap","url":"https:\/\/html5.gamemonetize.com\/wu5idx0ik1b7xyqv9k7a003a71f5kf6d\/","category":"Stickman","tags":"2D, Boys, Fighting, Girls, Kids, Ninja, onetouch, Stickman","thumb":"https:\/\/img.gamemonetize.com\/wu5idx0ik1b7xyqv9k7a003a71f5kf6d\/512x384.jpg","width":"1334","height":"750"},{"id":"50907","title":"Stickman Merge Battle: Arena","description":"An exciting strategic merge game where you have to demonstrate your advantage over the red stickman invaders. Create your army of stickmen, show your wit in the formation of troops and defeat all bosses. Less than 1% percent of players are able to unlock all stickmen and complete the game. - 3D stickmen - Each level is harder than the previous one - Intuitive controls - Boss difficulty every ten levels - Tactical game for all ages","instructions":"- Click Sword and arrow button to purchase units - Click Tile button to purchase tiles - Drag units between tiles to improve your strategic positioning - Merge two units of the same type to get the next tier unit","url":"https:\/\/html5.gamemonetize.com\/obyhafhugknxn37yy4vsed6yknb9d6rl\/","category":"Stickman","tags":"1 Player, 3D, Action, Arena, Army, Battle, Bow, Clash, Enemy, Fight, Hypercasual, Management, Stickman, Strategy","thumb":"https:\/\/img.gamemonetize.com\/obyhafhugknxn37yy4vsed6yknb9d6rl\/512x384.jpg","width":"1920","height":"1080"},{"id":"50462","title":"Z Stick Duel Fighting","description":"Join the ultimate stickman battle in Z Stick Duel Fighting, a game that will make you fight for glory. You will play as a stickman warrior who must face other stickmen from across the universe. You will use various skills and techniques to defeat them in a duel. You will also have to manage your mana, dodge their attacks, and strike them with a fatal blow. You will have the chance to try different skills and styles. You will also have to prove yourself as the stickman fighting king of the universe. Z Stick Duel Fighting is a game that will test your speed and strategy. Don&rsquo;t miss this exciting game!","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/o7tw740jgsxamrx0frgto50sxzl3w79r\/","category":"Stickman","tags":"2D, Avoid, Boys, Kids, Magic, Skill, Stickman","thumb":"https:\/\/img.gamemonetize.com\/o7tw740jgsxamrx0frgto50sxzl3w79r\/512x384.jpg","width":"1334","height":"750"},{"id":"50617","title":"Stickman Miner","description":"Embark on a lucrative journey beneath the earth in Stickman Idle Miner, a captivating mining simulator. Start with a humble pickaxe, chip away at mineral-rich veins, and uncover a variety of ores including coal, iron, gold, and diamonds. Sell the resources to make money.. Refine raw minerals into valuable products to sell at peak prices. Expand your empire, upgrade your tools, grow your facilities, and transform your small enterprise into a global mining powerhouse.","instructions":"Movement AWSD Arrow Keys Joystick","url":"https:\/\/html5.gamemonetize.com\/bhyewxjcbnyu7f32233fmpk6z7kaj9n6\/","category":"Stickman","tags":"Crafting, Minecraft, Miner","thumb":"https:\/\/img.gamemonetize.com\/bhyewxjcbnyu7f32233fmpk6z7kaj9n6\/512x384.jpg","width":"800","height":"600"},{"id":"47841","title":"Stickman Hot Potato","description":"This is a pretty simple game: Throw a flaming hot potato to burn your opponents&rsquo; hands instead of yours! It&rsquo;s like playing catch, but with a fiery twist. Just don&rsquo;t get caught holding the potato when the timer reaches 0, or you&rsquo;ll be feeling the heat! Four fast modes await you, two of which are 2-player. Compete against friends or family, or take on the CPU if you&rsquo;re flying solo. First to 1,000 points wins! For a unique challenge, try Hot Rings mode and race to destroy your opponent&rsquo;s rings. Use the four unique power-ups - cloak, freeze, clone, and slow motion - but remember to use them wisely!","instructions":"Use arrow keys to move to the potato and toss it off your court If it stays in your court for over 3 seconds you rsquo ll be scored on ","url":"https:\/\/html5.gamemonetize.com\/ohvhay9yre82sin5djnn1tpddc4dqamp\/","category":"Stickman","tags":".io, 1 Player, 2D, Highscore, Hypercasual, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ohvhay9yre82sin5djnn1tpddc4dqamp\/512x384.jpg","width":"1280","height":"480"},{"id":"50007","title":"My Farm Empire","description":"My Farm Empire is a fun and relaxing game that lets you create your own farm paradise on a beautiful island. You will become a farmer and grow various crops, from fruits and vegetables to flowers and herbs. You will also enjoy the stunning graphics, the smooth gameplay, and the rewarding progression system that will make you feel like a real farmer. My Farm Empire is more than just a game, it&rsquo;s a lifestyle. Join the My Farm Empire today and start your farming adventure.","instructions":"Drag and swipe move ","url":"https:\/\/html5.gamemonetize.com\/jvki4swvrqyby0veutogi7b2bpx57c6u\/","category":"Stickman","tags":"Boys, Casual, Collecting, Farm, Food, Fruit, Girls, Kids, Stickman","thumb":"https:\/\/img.gamemonetize.com\/jvki4swvrqyby0veutogi7b2bpx57c6u\/512x384.jpg","width":"1334","height":"750"},{"id":"49283","title":"Stickman Ninja Way of the Shinobi","description":"Stickman - Ninja from the clan of Black Panthers enters the battle. Help him drive the invaders out of his house! Defeat your enemies with lightning strikes and combo attacks. Dodge enemy attacks with a roll. Upgrade your character so that you have the strength to defeat all enemies and free your house.","instructions":"Control - Movement WASD - Roll Space - Sword Strike Left mouse click - Combo Attack Right mouse click Phone Tablet Use interface buttons ","url":"https:\/\/html5.gamemonetize.com\/bbvs6yc7da25q92ogll0m4cfmuo4ymox\/","category":"Stickman","tags":"Action, Adventure, Battle, Best Games, Ninja, Stickman","thumb":"https:\/\/img.gamemonetize.com\/bbvs6yc7da25q92ogll0m4cfmuo4ymox\/512x384.jpg","width":"1280","height":"720"},{"id":"49274","title":"Stickman fall","description":"Hang between two pillars with plungers on a bar. When you press space, the plungers touch the pillars, halting your descent. Navigate a path filled with obstacles, ensuring you dont collide. Your goal? See how far you can descend without hitting any barriers. Ready to take the challenge?","instructions":"1 Attach to the bar Space on the keyboard Left Mouse Click or Long Press on mobile devices 2 Descend while avoiding obstacles 3 Upon reaching the finish stop within the marked area ","url":"https:\/\/html5.gamemonetize.com\/4nsbkbsthace3imqxe11zdymbiwnc2bg\/","category":"Stickman","tags":".io, 3D, 3D Games, Action, Casual, Fall Guys, Hypercasual, Stickman","thumb":"https:\/\/img.gamemonetize.com\/4nsbkbsthace3imqxe11zdymbiwnc2bg\/512x384.jpg","width":"1280","height":"720"},{"id":"20654","title":"Crowd Stack Race 3D","description":"Introducing the captivating and addictive Crowd Stack Race 3D, an enthralling new arcade game. Your objective is to gather individuals of identical skin tones across the entire platform. In this trending and highly sought-after game, your goal is two-fold: continue running and partake in a historical and poetic running competition. Time your jumps flawlessly and strive to reach higher levels. Accumulate as many individuals as possible, evading both collisions with persons of other ethnicities and various obstacles to prevent losing a life by falling from the edifice. Stay vigilant in collecting rewards and stars embellishing each platform.","instructions":"Slide to play","url":"https:\/\/html5.gamemonetize.com\/xpfnix9kopuvgjltnh68zj6ce4gzip0g\/","category":"Stickman","tags":"3D, Avoid, Casual, Collecting, Girl, Kid, running, Simulation, Stickman","thumb":"https:\/\/img.gamemonetize.com\/xpfnix9kopuvgjltnh68zj6ce4gzip0g\/512x384.jpg","width":"440","height":"750"},{"id":"48429","title":"Skibidi Stick","description":"Stretch the stick the more you can to reach and walk on the platforms. Beware! If the stick is not long enough, Skibidi will fall down! Get yourself in the ninja action! How far can you go?","instructions":"Mouse click or tap to play","url":"https:\/\/html5.gamemonetize.com\/5zkgqwll2oosqwi47higgp0eogc03dmm\/","category":"Stickman","tags":"Casual, HTML, Mobile, Puzzle, Skibidi, Skibidi Toilet, Stickman","thumb":"https:\/\/img.gamemonetize.com\/5zkgqwll2oosqwi47higgp0eogc03dmm\/512x384.jpg","width":"1024","height":"600"},{"id":"46927","title":"Silly Dancer","description":"Get ready to bust a move and show off your dance skills in this high-energy hypercasual game! Tap to the rhythm and keep up with the catchy beats as you navigate through a variety of vibrant and visually stunning dance environments. With its addictive gameplay and lively music, this game will have you grooving and striving to achieve the highest score on the dancefloor","instructions":"press keyboard arrow buttons when ui arrow in circle ","url":"https:\/\/html5.gamemonetize.com\/zhthunzg2jyv86mnhyfqdbqj3n11v5wc\/","category":"Stickman","tags":"Dancing, Music","thumb":"https:\/\/img.gamemonetize.com\/zhthunzg2jyv86mnhyfqdbqj3n11v5wc\/512x384.jpg","width":"540","height":"960"},{"id":"47033","title":"Burger Race","description":"Pick ingredients and make Hamburgers, receive money and build the bridge to go to next stage! Customize Character: You can choose from over 30 colors! Unlockables: Unlock all colors for your character and more!","instructions":"Move character using WASD or drag mouse to desired direction ","url":"https:\/\/html5.gamemonetize.com\/wb48m837hvo0z4h19nznefuz0plmh3ry\/","category":"Stickman","tags":".io Games, 3D, Burger, Casual, Collecting, Collection, Color, Cooking, Hypercasual, Race, Racing, Stickman, WebGL","thumb":"https:\/\/img.gamemonetize.com\/wb48m837hvo0z4h19nznefuz0plmh3ry\/512x384.jpg","width":"540","height":"960"},{"id":"46963","title":"Parkour Skyblock","description":"Complete levels and do parkour tricks in Parkour Skyblock. Jump over obstacles, climb ledges, reach the portal! Jump on the slugs to fly higher. Run through a variety of blocks and have fun! Dont let the obstacles take you down and make you fall to the depths.","instructions":"To move around the map you will have to use the scroll keys the space bar to jump as much as you can use it to move from left to right and the arrow to move forward ","url":"https:\/\/html5.gamemonetize.com\/lvhxedowv54gpv02o3nxqcujsa6xzrlw\/","category":"Stickman","tags":"1 Player, Block, Game, unity","thumb":"https:\/\/img.gamemonetize.com\/lvhxedowv54gpv02o3nxqcujsa6xzrlw\/512x384.jpg","width":"960","height":"600"},{"id":"46708","title":"Stickman Rope Heroes","description":"Have you ever seen a stickman throwing a web before? yes he is throwing net and trying to reach the finish line to fulfill his mission. Net and jump at all marked locations. Help him as a stickman superhero and network together. Reach the finish line without falling off the cliff in different difficulty levels.","instructions":" Click or tap to rope 20 different challenging levels ","url":"https:\/\/html5.gamemonetize.com\/eqxf0v60oye38q5x3rdcf54caej8xwc6\/","category":"Stickman","tags":"1 Player, 2D, Action, Adventure, Click, Stickman, Superhero","thumb":"https:\/\/img.gamemonetize.com\/eqxf0v60oye38q5x3rdcf54caej8xwc6\/512x384.jpg","width":"800","height":"600"},{"id":"44315","title":"Castle Blaster 2D! (mobile)","description":"Play as the Kings greatest soldier to defend your King and his Castle from his greatest arch enemy! Your Kings arch enemys castle is slowly starting to wear down due to damage from previous battles. This has made him pick on even weaker Kingdoms than before, so that he can maintain his large Castle by stealing their gold and defeating them. Your Kings precious Castle took 19 years to build and he has you equipped with the most powerful futuristic weapons on Earth. Dont let your king down!","instructions":"Click onto the 3 weapon icons at the top left of the screen to swap they all have their own uses and strengths The HMG is your main weapon and should be used to shred bullets at a distance Stop the Blue Bullets from coming close with the bow ","url":"https:\/\/html5.gamemonetize.com\/04sdx7rn8ka3vfbsu5o5m2jbddcwo9gm\/","category":"Stickman","tags":"2D, Action, Android, Bomb, Castle, Defense, Fun, Game, Games, HTML5, Hypercasual, Planet, Play, Point And Click, Shoot, Shoot 'Em Up, Shooter, Shooting, Stickman, Tower Defense, War, weapons","thumb":"https:\/\/img.gamemonetize.com\/04sdx7rn8ka3vfbsu5o5m2jbddcwo9gm\/512x384.jpg","width":"1280","height":"480"},{"id":"45691","title":"Stickman Races 3D","description":"Stickman Race 3D is New Race 3D Game with Opponent Stickman Players , Run , Jump, Race, Perform Stunts to Won the Race with Stickman Never stop running! Jump and flip over obstacles, climb over ladder, swim in the pool , Stunts and make sure you avoid all the obstacles and reach the finish line safely.","instructions":"Tap to Run ","url":"https:\/\/html5.gamemonetize.com\/85mh5d73g2oawupffxxh83qw1vn1v0b1\/","category":"Stickman","tags":"3D, 3D Games, Boy, Boys, Casual, Funny, Game, Games, Girl, Girls, Hypercasual, jump, Jumping, Kid, Kids, run, running, Stickman, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/85mh5d73g2oawupffxxh83qw1vn1v0b1\/512x384.jpg","width":"600","height":"960"},{"id":"45532","title":"Carton Home Defense","description":"Fight off waves of enemies! Enemies are attacking your house, and every day they will grow stronger and stronger if you do not stop them! Defend the fortress so that they cannot go further into our land!","instructions":" bull Click or use the mouse to shoot at enemies bull Hold out until the end of the day until the sun has passed its full path bull Buy improvements in the store bull Use available boosters ","url":"https:\/\/html5.gamemonetize.com\/f1pch2a1jalzr97o4vdwq0ml3nx582x6\/","category":"Stickman","tags":"Clicker, Shooter, Stickman, Tower Defense","thumb":"https:\/\/img.gamemonetize.com\/f1pch2a1jalzr97o4vdwq0ml3nx582x6\/512x384.jpg","width":"800","height":"600"},{"id":"45742","title":"Stickman Brothers Nether Parkour","description":"4 stickman brothers survival battle. 4 must survive in front of him. You have to help them in the nether world full of obstacles. Help them by playing with your friends. Hurry up and join this adventure. everywhere is full of danger. Be careful and never, ever fall down. 4 must reach the portal in front of him. There are tasks to be done in each section and they must be fulfilled.","instructions":"4 players are played in 2 groups Use WASD Arrow keys to play players Use the button in the game to activate group transitions Each player can collect the box of his own color collect the boxes and reach the door mobile play is available ","url":"https:\/\/html5.gamemonetize.com\/2hn3nxkg226d5rhz34w1l9xpww3nqxqb\/","category":"Stickman","tags":"1 Player, 2 Player, 2 Player Games, 2D, Adventure, Android, Arcade, Stickman","thumb":"https:\/\/img.gamemonetize.com\/2hn3nxkg226d5rhz34w1l9xpww3nqxqb\/512x384.jpg","width":"800","height":"600"},{"id":"38043","title":"Free Rider HD","description":"The OFFICIAL hit web game with over ONE BILLION PLAYS and MILLIONS OF TRACKS is coming to Android! Race bikes on tracks designed by other players! Collect all the stars to complete a track. ALL tracks have been drawn by players. Come across a track you don't like? Skip it and make your way! This game has INFINITE CONTENT!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/r4n3fj7vabu6r7lq074lbmv08dwxzn5s\/","category":"Stickman","tags":"Adventure, Games, Stickman","thumb":"https:\/\/img.gamemonetize.com\/r4n3fj7vabu6r7lq074lbmv08dwxzn5s\/512x384.jpg","width":"800","height":"600"},{"id":"45149","title":"Stickman Picker Master","description":"Stickman Picker Master is a stickman running game where you try to collect balls of the same color while speeding on a track above the sea. If you collect identical color balls, your stickman character will grow, but if you collect different color balls, your stickman character will shrink.","instructions":"PC MOVE LEFT-RIGHT SWIPE MOUSE MOBILE MOVE LEFT-RIGHT SWIPE FINGER","url":"https:\/\/html5.gamemonetize.com\/7gixrhuo4ds5dwvzbq0kba17tmyzvu5i\/","category":"Stickman","tags":"3D, Collection, Hypercasual, Mobile, Platform, Stickman","thumb":"https:\/\/img.gamemonetize.com\/7gixrhuo4ds5dwvzbq0kba17tmyzvu5i\/512x384.jpg","width":"1280","height":"720"},{"id":"43375","title":"Electric Man","description":"Electric Man is an awesome stickman fighter Flash game in which you must fight against a range of opponents using a variety of different punch and kick combos. Before you enter the game, you can choose the name and color of your stickman, and also the difficulty level (easy, normal or pro). Once you have chosen your character you can then complete a tutorial that shows you the basic game mechanics and move sets.","instructions":"Arrow keys to move your character Quick moves A S D Slow Motion moves Q W E","url":"https:\/\/html5.gamemonetize.com\/6j4l38n2p7dvoa2e7vpnaq18bd5l2dn9\/","category":"Stickman","tags":"Fighting","thumb":"https:\/\/img.gamemonetize.com\/6j4l38n2p7dvoa2e7vpnaq18bd5l2dn9\/512x384.jpg","width":"800","height":"600"},{"id":"43895","title":"Stick Hero Mighty Tower Wars","description":"Prepare yourself to fight top battles, defeat monsters and enemies. Calculate and defeat enemies with less power, power-up and eliminating them all. Build tower as high as you can. A princess needs your help, a treasure awaits... Calculate your move to wipe out the enemies in the war of heroes, level up to unlock variable new characters.","instructions":"- Hold and drag to move your hero wisely to defeat enemies - Upgrade weapons to become a strong hero in this puzzle game - Come up with the perfect strategy to win in stick war","url":"https:\/\/html5.gamemonetize.com\/bool4l7blab69un3vnflwmazr8l5i31t\/","category":"Stickman","tags":"2D, Arcade, Battle, Boy, Casual, Girl, Hypercasual, Puzzle, Skills, Stickman","thumb":"https:\/\/img.gamemonetize.com\/bool4l7blab69un3vnflwmazr8l5i31t\/512x384.jpg","width":"1080","height":"1920"},{"id":"42798","title":"Stickman Wick","description":"The ruthless Stickman Wick must get his best friend back! To do this, he is ready to use his entire arsenal and brutal fighting techniques! Stickman will have to overcome 30 floors of a building filled with enemies to overtake his sworn enemy. Stickman has a whole arsenal of weapons and fighting techniques with which he will break through crowds of enemies. Stickman is dangerous both in close combat and at a distance. Defeated enemies give rage points, which are necessary to defeat the boss. The closer you attack ordinary enemies, the more rage points you will get. Enemies will try to stop you by all available means. Cold and firearms are used, as well as bombs.","instructions":"Tap or click on the screen in front of an obstacle jump Tap or click on the screen in front of the enemy attack ","url":"https:\/\/html5.gamemonetize.com\/g6jvlpv08fpnk5eqzbm8l9vzga5foo6u\/","category":"Stickman","tags":"2D, Action, Click, Gun, HTML5, jump, Jumping, Mobile, New, running, weapons, WebGL","thumb":"https:\/\/img.gamemonetize.com\/g6jvlpv08fpnk5eqzbm8l9vzga5foo6u\/512x384.jpg","width":"960","height":"600"},{"id":"42679","title":"Fruits Ninja Hero","description":"Fruits Ninja Hero is an action ninja game. Aim and release the slingshot to release the green ninja hero. Release the ninja and slice Fruits. Avoid enemies like the spider and snakes. enjoy!","instructions":"Aim and release to Launch the ninja","url":"https:\/\/html5.gamemonetize.com\/7begeu56olpka4kaqzioeq7wok1m90ip\/","category":"Stickman","tags":"Action, Adventure, Boy, Fruits, Ninja","thumb":"https:\/\/img.gamemonetize.com\/7begeu56olpka4kaqzioeq7wok1m90ip\/512x384.jpg","width":"720","height":"1280"},{"id":"43084","title":"Stick Defenders: Merge Game","description":"Stick Defenders is an action and merging game where you combine stickman units into stronger ones, so that they can protect your base from phases of enemies. Merge identical gunmen, enhance your offensive abilities, improve your walls, and much more. There are fun side activities like \"spin the wheel\" where you can get surprising items to help you become stronger and unlock new possibilities. Make sure to use your skills on the oncoming horde of enemies as soon as their cooldown's over, so you don't get overwhelmed by them. How long can you hold down the fort in Stick Defenders?","instructions":"Tap or click","url":"https:\/\/html5.gamemonetize.com\/p4k54xth404myufwjrrjdm769zici6i4\/","category":"Stickman","tags":"Action, Boys, Fun, Skills, Stickman","thumb":"https:\/\/img.gamemonetize.com\/p4k54xth404myufwjrrjdm769zici6i4\/512x384.jpg","width":"1280","height":"720"},{"id":"28799","title":"STICK DEFENDERS","description":"In Stick Defenders, merge stickman units to form stronger defenders to protect your base from waves of enemies. Merge gunmen, upgrade offense, fortify walls, and more. Enjoy bonus activities like \"spin the wheel\" to win helpful items and unlock new options. Quickly use your skills when enemy cooldown ends to avoid being overrun. How long can you survive in Stick Defenders?","instructions":"Use your left mouse button or finger to select and drag units Drag one unit and drop it on top of an identical one to merge them ","url":"https:\/\/html5.gamemonetize.com\/zzkyrdhl0zf2qhzpm314c2cqet5tt2ck\/","category":"Stickman","tags":"Action, Adventure, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/zzkyrdhl0zf2qhzpm314c2cqet5tt2ck\/512x384.jpg","width":"800","height":"600"},{"id":"41779","title":"Stickman Bullets Ragdoll","description":"Stickman with a bazooka blows up his enemies and destroys their bases. - Full possibility of destruction of everything around - Multiple bullets for stickman weapons - Physical enemies and crazy explosions - Levels with exciting challenges Enjoy addictive gameplay with amazing destruction! Choose bullets for weapons and destroy everything around. Destroy ragdoll enemies. Explode bombs, shoot rockets and make your enemies fly away from the explosions, destroying their bases and crushing their buildings! Fun physical enemies and crazy explosions with amazing content and challenges Help Stickman destroy all enemies to win!","instructions":"PC - Mouse left-click to aim aiming and release to shoot Mobile - hold your finger at the screen to aim release to sh","url":"https:\/\/html5.gamemonetize.com\/qjyw0g6oc9e8v8dsawxkupjoqe3liu62\/","category":"Stickman","tags":"Bomb, Shoot, Stickman","thumb":"https:\/\/img.gamemonetize.com\/qjyw0g6oc9e8v8dsawxkupjoqe3liu62\/512x384.jpg","width":"1920","height":"1080"},{"id":"41635","title":"Crazy Stickman Escape","description":"Crazy Stickman Escape is a puzzle-platform game in which you control two stickman characters who are trying to break out of a facility in which they are being held. The objective is to control the blue stickman to collect the blue key and then switch to the red stickman to collect the red key. Sounds easy? Not so fast. The facility is filled with security guards, cameras, drones, lasers, acid vats, and other obstacles. Along the way, you can also rescue other prisoners and unlock new costumes and skins to customize your characters. Additionally, there are various accessories you can obtain to keep the game interesting. Play the Lucky Wheel to earn free cash and show us that you have the skill and determination to escape.","instructions":"Move - WASD or Arrow keys Interact Use - G Switch character - F Zoom out - Z Pause - ESC","url":"https:\/\/html5.gamemonetize.com\/7ki9efve23zgbq5uyr8m2zcobmfihnhx\/","category":"Stickman","tags":"Adventure, Escape, New, Platform, Stickman","thumb":"https:\/\/img.gamemonetize.com\/7ki9efve23zgbq5uyr8m2zcobmfihnhx\/512x384.jpg","width":"800","height":"600"},{"id":"41948","title":"alpha pusher","description":"Welcome to the Runner Pusher, one of the world-class enjoyable games! Looking for some fun? You are in the right place! Best run-ner game! Runner Pusher is a dynamic race based on solving math equations, where you progress by earning coins. Don't let the crowd clash scare you! Lead the stickmen and look for ways to succeed.","instructions":"Drag the screen and start running Choose the right path necessary to become the greatest number of people Think and make the right moves Your choices are your destiny Collect the most gold and gems ","url":"https:\/\/html5.gamemonetize.com\/8sgag4s2ofnzk597n4oywb8jt0vsne8h\/","category":"Stickman","tags":"1 Player, 3D, Hypercasual, Stickman","thumb":"https:\/\/img.gamemonetize.com\/8sgag4s2ofnzk597n4oywb8jt0vsne8h\/512x384.jpg","width":"1080","height":"1920"},{"id":"41768","title":"Stickman Hero","description":"Swing your way to the finish line! Avoid all the obstacle. There are twenty challenging stages. Finish them all and be the Stickman Hero!","instructions":" Avoid all the obstacle","url":"https:\/\/html5.gamemonetize.com\/imwsoj6dod2izstzsmsr9uu0asegbc8k\/","category":"Stickman","tags":"Adventure, Arcade, Hypercasual, Puzzle, Spiderman, Stickman, Super, Superhero","thumb":"https:\/\/img.gamemonetize.com\/imwsoj6dod2izstzsmsr9uu0asegbc8k\/512x384.jpg","width":"720","height":"1280"},{"id":"43217","title":"Troll Thief","description":"Troll Thief – Stickman Puzzle is a funny puzzle game template where you stretch and bend your character’s arms to reach various objects and solve puzzles set in hilarious scenarios.","instructions":"Stretch and bend your character s arms to reach various objects ","url":"https:\/\/html5.gamemonetize.com\/3hju9vjcgd7lhodz6sibdcclmiwdv7qw\/","category":"Stickman","tags":"Puzzle, Stickman","thumb":"https:\/\/img.gamemonetize.com\/3hju9vjcgd7lhodz6sibdcclmiwdv7qw\/512x384.jpg","width":"750","height":"1334"},{"id":"37562","title":"Stick Merge Battle","description":"Stick Merge is a simple action and merging game. You aim to combine various weapons to create more powerful guns, and ultimately use them on the moving stick figures in the shooting range. Prepare your arsenal, upgrade your pistol, explore all the power-ups and become the best shooter in town. How powerful can you get in Stick Merge? Stick around to find out!","instructions":"Tap or click ","url":"https:\/\/html5.gamemonetize.com\/u6of6a36ydxbzdowpmfz4qyzmkrg7yi1\/","category":"Stickman","tags":"Battle, Boy, Boys, Fun, H5, HTML5, Kid, Kids, Stickman, Strategy, War","thumb":"https:\/\/img.gamemonetize.com\/u6of6a36ydxbzdowpmfz4qyzmkrg7yi1\/512x384.jpg","width":"1280","height":"720"},{"id":"42544","title":"Math Gates","description":"Your mission in this game; It is to find the answer to the math question you have been told in a short time and to pass the correct answer on the gate that will appear in front of you as you move forward. You will see the math operation at the bottom of the screen. To get through the gate in front of you, you have to go through the gate with the correct answer. If you pass through the gate with the wrong answer, the game will be over somehow. You succeed when you pass through the gate with the correct answer.","instructions":"MOVE LEFT-RIGHT SWIPE MOUSE","url":"https:\/\/html5.gamemonetize.com\/yxxc09r13wh203oqegyfcqqjp96en6bg\/","category":"Stickman","tags":"Educational, Kids, Math, running","thumb":"https:\/\/img.gamemonetize.com\/yxxc09r13wh203oqegyfcqqjp96en6bg\/512x384.jpg","width":"1280","height":"720"},{"id":"41497","title":"Stickman Archer 5","description":"Enhance your stickman shooting skills with our newest game featuring three exciting modes. In the first mode, test your aim by shooting at moving and stationary targets with a limited supply of arrows. In the second mode, engage in a thrilling stickman duel. And in the third mode, clear a multi-level building with a gun. Collect emeralds as you play to exchange for new weapons and skins. Try our stickman shooting game now!","instructions":"You need to shoot from a bow at moving and static targets ","url":"https:\/\/html5.gamemonetize.com\/sn2uell0ms2xn1vlo9enfpcone7oxbjz\/","category":"Stickman","tags":"Action, Arcade, Stickman, Superhero","thumb":"https:\/\/img.gamemonetize.com\/sn2uell0ms2xn1vlo9enfpcone7oxbjz\/512x384.jpg","width":"800","height":"600"},{"id":"40683","title":"Stickman parkour craft","description":"Stickman will have to go through parkour skyblock, and overcome all obstacles on his way! Each level complicates this task, but can you? Collect gold along the way and buy various skins!","instructions":"Use the W A D or virtual buttons to run and the space bar or the button on the right to jump Get to the flag to complete the level ","url":"https:\/\/html5.gamemonetize.com\/6dy2yj5e4n8bufx8dx6n13nf5go8vfsz\/","category":"Stickman","tags":"1 Player, 2D, Adventure, Craft, Minecraft, Platform, Stickman","thumb":"https:\/\/img.gamemonetize.com\/6dy2yj5e4n8bufx8dx6n13nf5go8vfsz\/512x384.jpg","width":"1920","height":"1080"},{"id":"40456","title":"Fight StickMan","description":"Stick Fighter is a fighting game where you take control of one six characters, all of whom have completely different move sets! Run the gauntlet in the single player mode taking on each of the other characters in an attempt to prove yourself as the ultimate Stick Fighter!","instructions":"Move Jump - A D or Left Right arrow keys Attack 1 - A A or Left Left Attack 2 - D D or Right Right Double Jump 1 - A D or Left Right Double Jump 2 - D A or Right Left Attack 3 - While double-jumping A or Left Atta","url":"https:\/\/html5.gamemonetize.com\/35vohyrh9uqn09vtuneui4q71htmc8p2\/","category":"Stickman","tags":"Fight","thumb":"https:\/\/img.gamemonetize.com\/35vohyrh9uqn09vtuneui4q71htmc8p2\/512x384.jpg","width":"800","height":"600"},{"id":"41503","title":"Stick Duel: Battle Hero","description":"On the battle arena of Stick Duelists, a new battle is beginning with the new hero costumes. These super characters are ready to fight each other using fire guns or fists or kicks. The main goal of this game is to score five by destroying your opponent. You can use any character costume for free. During the battle, you will have various weapons, shields, and health power-ups. You can switch your weapons if you don't like them. Play this game against a friend in 2 player mode and double the fun!","instructions":"Player 1 Move ARROW KEYS Shoot L Drop weapon O Player 2 Move WASD Shoot F Drop weapon R ","url":"https:\/\/html5.gamemonetize.com\/x35agfe0skor40ub8c9u6d7gl8z8wou8\/","category":"Stickman","tags":"2 Player, 2 Player Games, Arena, Battle, Shooting, Skill, Stickman, Superhero, War","thumb":"https:\/\/img.gamemonetize.com\/x35agfe0skor40ub8c9u6d7gl8z8wou8\/512x384.jpg","width":"800","height":"600"},{"id":"37558","title":"Stick Wars 3D","description":"Stick Wars 3D is a 3D platform game. Fight against enemy Stickman! Have powerful weapons, open the doors of all levels!","instructions":"Move LEFT and RIGHT ARROW KEYS Jump UP ARROW KEY Shoot LEFT CLICK","url":"https:\/\/html5.gamemonetize.com\/ary35ruz1suwitgap7mbnhwjwmwg00ld\/","category":"Stickman","tags":"3D, 3D Games, Action, Adventure, Best, Boy, Clicker, Escape, Shooter, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ary35ruz1suwitgap7mbnhwjwmwg00ld\/512x384.jpg","width":"800","height":"450"},{"id":"40080","title":"Stickman Idle Clicker Miner: Imposter among us","description":"This is a unique relaxing idle miner game. It is based on the stickman universe. Build units, make upgrades, and try to reach a final goal! Stickmen want freedom - help them to get out. But an imposter is among us so be aware. - Create more Stickman's; - Make Upgrades; - Earn more ore; - Dig deeper until You earn enough money; - Buy all train parts, so Stickman can move on; - Be careful - an imposter is among us!","instructions":"Left Mouse Button or Touch","url":"https:\/\/html5.gamemonetize.com\/wm39u7ou2xd1bhemxh1953aw109nxlh2\/","category":"Stickman","tags":"Farm, Miner, Stickman, Strategy","thumb":"https:\/\/img.gamemonetize.com\/wm39u7ou2xd1bhemxh1953aw109nxlh2\/512x384.jpg","width":"1024","height":"576"},{"id":"39609","title":"Huggy Wuggy Archer","description":"Welcome to a new Archery stickman game! in this game you are the blue huggy wuggy and you have to throw arrows on the black stickman oponnent to destroy him! Aim well to get a head-shot to eliminate your enemy. Good luck!","instructions":"Slide your finger or hold mouse click to shoot","url":"https:\/\/html5.gamemonetize.com\/ee8heo4jj52c4qa5bdtyz947py3cfluf\/","category":"Stickman","tags":"Arcade, Hypercasual, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ee8heo4jj52c4qa5bdtyz947py3cfluf\/512x384.jpg","width":"720","height":"1200"},{"id":"39623","title":"Draw and Save Stickman","description":"Want to test your IQ, creativity or drawing skills? Looking for a new, unique puzzle game? Draw and Save Stickman is the game you need! Make drawings to keep various dangers and traps away from Stickman. You will need to think differently in each level. Let's guess where the danger will come from and start drawing the shield!","instructions":"Create a protection shield by making drawings using MOUSE ","url":"https:\/\/html5.gamemonetize.com\/fei5ffz1h2tgtxaijdmfcd8gk0puw7ia\/","category":"Stickman","tags":"Brain, Draw, Drawing, Puzzle, Stickman","thumb":"https:\/\/img.gamemonetize.com\/fei5ffz1h2tgtxaijdmfcd8gk0puw7ia\/512x384.jpg","width":"800","height":"450"},{"id":"40901","title":"Stick Duel Battle","description":"Stick Duel Battle is a funny and crazy stickman battle game! You can fight with realistic weapons and physics on many maps. Each different map requires different tactics. Stick Battle Duel can be played with both 1 player and 2 players. The one who reaches 5 score first, wins the game.","instructions":"PLAYER 1 ARROW KEYS and L PLAYER 2 WASD and F ","url":"https:\/\/html5.gamemonetize.com\/dm15vv1aak9c1asfg49ji8s7iosbl6tu\/","category":"Stickman","tags":"2 Player, 2 Player Games, Battle, Shoot 'Em Up, Shooting, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/dm15vv1aak9c1asfg49ji8s7iosbl6tu\/512x384.jpg","width":"900","height":"500"},{"id":"40904","title":"Drunken Spin Punch","description":"The new challenge of Drunken Stickmans, spinning punches begins! Swing your fists and try to stay balanced and don't forget to control your energy! Drunken Spin Punch game has 1P and 2P modes. You can play the game from both PC and mobile devices. The first to reach a score of 5 in the game wins the match!","instructions":"PLAYER 1 ARROW KEYS PLAYER 2 W A S D You can use the left and right sides on touch screens ","url":"https:\/\/html5.gamemonetize.com\/5q7tgblx6krhhrop9cvvo4wwxj82w0ta\/","category":"Stickman","tags":"2 Player, 2 Player Games, Action, Battle, Boxing, Fight, Fighting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/5q7tgblx6krhhrop9cvvo4wwxj82w0ta\/512x384.jpg","width":"800","height":"600"},{"id":"40305","title":"Egg head","description":"Egg Head ou Cabeça de Ovo é um Pequeno Jogo que pode lhe dar um Susto, Mate os Zumbis e Chegue até a Fase Final.","instructions":"A use para andar para Esquerda D Use para andar para Direita Barra de espa o Use para Pular Bot o esquerdo do Mouse Para A o ","url":"https:\/\/html5.gamemonetize.com\/amgd5209h9vibi1rwxnafyu31fwma7wp\/","category":"Stickman","tags":"1 Player, 2D, Zombie","thumb":"https:\/\/img.gamemonetize.com\/amgd5209h9vibi1rwxnafyu31fwma7wp\/512x384.jpg","width":"2000","height":"960"},{"id":"40522","title":"Stickman Bunny Hop Tricks","description":"Complete levels and do parkour tricks in Stickman Bunny Hop Tricks. Jump over obstacles, climb ledges, get to the portal! Jump on the slugs to fly higher. Run through a variety of biomes and have fun! Stickman Bunny Hop Tricks - game with stickman. Skyblock runner and parkour tricks. Skyblock survivor mode in skyland world with stick war animation. Stickman in minecraft and terraria: parkour and traps floor is lava and stickman supreme duelist.","instructions":"Use W A D or virtual buttons to run and spacebar or right button to jump Get to the portal to complete the level ","url":"https:\/\/html5.gamemonetize.com\/6o5quqwsbfcns5n9u1pm91ywlci6py63\/","category":"Stickman","tags":"1 Player, 2D, Action, Adventure, Block, Craft, Crafting, Crazy, Fight, Fighting, Fun, Funny, Ice, Mine, Minecraft, Miner, Red, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/6o5quqwsbfcns5n9u1pm91ywlci6py63\/512x384.jpg","width":"1280","height":"720"},{"id":"40551","title":"Red Stickman vs Monster School","description":"Perfect news for the lovers of Red And Blue Stickman Adventure! The sequel to the series has been completed as Red Stickman vs Monster School. The Stick Adventure is an addictive platform puzzle game, where you have to control characters. Participate in the Monster School challenge together with the Red Stickman.","instructions":"Use arrows or WAD to move arround E Space or virtual button to fight","url":"https:\/\/html5.gamemonetize.com\/k2ksa2oskzf1xohh0f2snosfigwx5zwy\/","category":"Stickman","tags":"Block, Boxing, Craft, Crafting, Crazy, Fight, Fighting, Fun, Funny, Mine, Minecraft, Miner, Monster, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/k2ksa2oskzf1xohh0f2snosfigwx5zwy\/512x384.jpg","width":"1280","height":"720"},{"id":"40577","title":"Stickman Archero Fight","description":"Upgrade your stickman, fight enemies in the Stickman Archero game. Create cool and dynamic fatalities. Lots of magic and battles! The game is similar to SupremeDuelistStickman. Fights in the village with other stickman.","instructions":"Press W A S D keys to move around Press E to interact with items Press Left Mouse Button to hit Or virtual buttons ","url":"https:\/\/html5.gamemonetize.com\/olq15f2zemu1f6gto35fd13pmxnzqilm\/","category":"Stickman","tags":"1 Player, 2D, Action, Adventure, Arcade, Arena, Army, Avoid, Battle, Battlegrounds, Best, Brawl, Cartoon, Castle, Casual, Clash, Craft, Crafting, Crazy, Escape, Fantasy, Fight, Fighting, Game, Games, Hot, Interactive, Magic, Minecraft, Ninja, Platform, Play, Rescue, Samurai, Side Scrolling, Simulation, Simulator, Stickman, Street Fighting, Sword, Violence, War, weapons, Wizard","thumb":"https:\/\/img.gamemonetize.com\/olq15f2zemu1f6gto35fd13pmxnzqilm\/512x384.jpg","width":"1280","height":"720"},{"id":"40398","title":"Squid Game Deadflip","description":"You must be careful to land safely on the ground. Make the Squid Game character somersault and land carefully on the ground. Rescue the character who is bored and wants to escape from challenging Squid Game games! Enjoy comprehensive levels by improving your intelligence while having fun. Start the challenge right now with 25+ different level designs!","instructions":"Hold and release the left mouse button ","url":"https:\/\/html5.gamemonetize.com\/0f3p3y9hmos3rs2swmktzq3dz0kh9l9x\/","category":"Stickman","tags":"3D, Action, Android, Battle, Best, Casual, Escape, Fun, Hypercasual, Mobile, Platform, Puzzle, Strategy, WebGL","thumb":"https:\/\/img.gamemonetize.com\/0f3p3y9hmos3rs2swmktzq3dz0kh9l9x\/512x384.jpg","width":"900","height":"506"},{"id":"38620","title":"Imposter Smasher IO amusants","description":"Imposter Smashers - Fun io game is a super cool, easy and relaxing game. To win this, your mission is simple: crush another teammate with a huge hammer, consume his power to become bigger and stronger, be the only Imposter survival on the battlefield. However, be careful and try to run into other difficult impostors, otherwise you will be crushed.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/5bgkn3c1izt5dnf3cyqcqhat79c6bfgc\/","category":"Stickman","tags":".io, .io Games, Game, Games, Simpson, Stickman","thumb":"https:\/\/img.gamemonetize.com\/5bgkn3c1izt5dnf3cyqcqhat79c6bfgc\/512x384.jpg","width":"800","height":"600"},{"id":"39874","title":"Stickman Climber","description":"Stickman Climber is an amazing stickman game! The rules are very simple. just press the \"Up\" button to jump from side to side, and press \"Turn\" button to flip and avoid the bomb. Can you get a high score?","instructions":"Follow the game instructions","url":"https:\/\/html5.gamemonetize.com\/r6h0rueubew554237k9nr5v6n0jaorkd\/","category":"Stickman","tags":"Arcade, Clicker, Stickman","thumb":"https:\/\/img.gamemonetize.com\/r6h0rueubew554237k9nr5v6n0jaorkd\/512x384.jpg","width":"720","height":"1280"},{"id":"39655","title":"Prison Gates","description":"Prison Gates is a stickman running game where you try to pass through gates while avoiding criminals. Your mission in this game; is to pass through the right one of the 2 gates that will appear in front of you while running. One of these passages will be open and the other will be closed. If you try to pass through the closed gate, the criminals will catch you and the game will be over. When you pass through the right gate, the criminals chasing after you will not catch you and you will succeed.","instructions":"PC MOVE LEFT-RIGHT ARROW KEYS MOBILE MOVE LEFT-RIGHT SWIPE FINGER","url":"https:\/\/html5.gamemonetize.com\/sl4b1jft5toksui8ogwb80a76xofkevt\/","category":"Stickman","tags":"Avoid, Best, Casual, Escape, Hot, Hypercasual, Mobile, Obstacle, Platform, Rescue, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/sl4b1jft5toksui8ogwb80a76xofkevt\/512x384.jpg","width":"800","height":"450"},{"id":"39649","title":"HyperDoll","description":"Super stickman battle is waiting for you with HyperDoll. You have to destroy the enemies with the superhero who can use the sword. In this game that can be played with one finger, you control the stickman character and try to destroy the enemies by hitting them. Do you want to experience the exciting stickman battle with HyperDoll?","instructions":"PC Give direction by scrolling with the mouse Mobile Give direction by sliding with the finger ","url":"https:\/\/html5.gamemonetize.com\/tm8sqyo84qlrk7fjnihg6tvx1pr41cnr\/","category":"Stickman","tags":"Best, Fight, Hot, Kids, Kill, Mobile, Platform, Stickman","thumb":"https:\/\/img.gamemonetize.com\/tm8sqyo84qlrk7fjnihg6tvx1pr41cnr\/512x384.jpg","width":"800","height":"450"},{"id":"39019","title":"Stick Duel: The War","description":"Stick Duel series continues with The War episode. Brand new physics, weapons and levels are ready in the new game. Whether you play against the CPU or against your friend, the goal is to win the game by taking 5 rounds. Play by considering the advantages and disadvantages of weapons and the designs of 20 different maps. Stay away from fire pools and traps!","instructions":"Player 1 Move ARROW KEYS Double Jump UP UP Hit L Player 2 Move W A S D Double Jump W W Hit F ","url":"https:\/\/html5.gamemonetize.com\/m1rme0e7z361bte5hid3bf2mnlodqfwa\/","category":"Stickman","tags":"2 Player, 2 Player Games, 3D, Arena, Battle, Battlegrounds, Shooting, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/m1rme0e7z361bte5hid3bf2mnlodqfwa\/512x384.jpg","width":"900","height":"500"},{"id":"38893","title":"Stick Warrior Hero Battle","description":"The battle of the Stick Ragdolls is beginning in the various dangerous arenas with the Stick Warriors Hero Battle game! These stickmen are the heroes of the stickman community. Each of them has its own weapon and different fighting abilities. The modes will take you on various adventures in either single player or two player. During the game, don't forget to take power-ups that spawn around the map. Some power-ups are good but some power-ups are bad. Make sure you pick the good one. Call a friend and enjoy this fun stick battle together!","instructions":"Player 1 W A S D or ARROW KEYS Player 2 ARROW KEYS ","url":"https:\/\/html5.gamemonetize.com\/bg00n551jqiaopwgoxl94cb7ump6p2lf\/","category":"Stickman","tags":"2 Player, 2 Player Games, Action, Fight, Fighting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/bg00n551jqiaopwgoxl94cb7ump6p2lf\/512x384.jpg","width":"900","height":"500"},{"id":"38629","title":"Squid Drunk 3D","description":"Try to balance your self with physics and to be to catches by the doll! like in the squid game challenge. you can move when the doll is looking for you.","instructions":"try to balance the player via WASD and don t move when the doll looking ","url":"https:\/\/html5.gamemonetize.com\/ddkkbn4xx6qohy8jemwxw59w19m7rce6\/","category":"Stickman","tags":"1 Player, 3D, 3D Games, Adventure, Arcade, Battle, Best, Boy, Boys, Casual, city, Crazy, Kids","thumb":"https:\/\/img.gamemonetize.com\/ddkkbn4xx6qohy8jemwxw59w19m7rce6\/512x384.jpg","width":"1920","height":"1080"},{"id":"38165","title":"Stickman Hook Animation","description":"Stickman Hook is a fun game where you can test your skills. You play as a swinging stickman through hundreds of challenging levels. This fun, colorful stickman game offers over 100 challenging levels. Unlock unique characters along the way to switch things up while you swing. Pay attention to the angle and direction of your swing to make it to the finish line! Can you control your swing? In this game, embody the spider stickman. Finish all the levels with the same agility as a spider. For that, you just have to: - Tap to hook and make incredible jumps - Press your screen to hook your stickman with your grapnel and release to let go - Avoid every obstacle that stands in your way - Swing from hook to hook to pass all the levels","instructions":"Tap to hook and make incredible jumps Avoid every obstacle that stands in your way Can you execute all these acrobatic tricks in a row like a boss ","url":"https:\/\/html5.gamemonetize.com\/4c8hos7j7bg1tehtpkl4e8j7jk15487m\/","category":"Stickman","tags":"Adventure, Barbie, Click, Clicker, HTML, HTML5, Hypercasual, Mind, Stickman","thumb":"https:\/\/img.gamemonetize.com\/4c8hos7j7bg1tehtpkl4e8j7jk15487m\/512x384.jpg","width":"720","height":"1280"},{"id":"37348","title":"Stickman Hook Rescue","description":"We all know the stickman as an excellent warrior, a good friend and a generally positive character, which in itself already allows him to become a superhero. Well, why not, here, for example, he is impressed by the spider-man, perhaps the stickman would have come out no worse than a spider?","instructions":"Tap to hook and make incredible jumps Avoid every obstacle that stands in your way Can you execute all these acrobatic tricks in a row like a boss ","url":"https:\/\/html5.gamemonetize.com\/5xz3xp3p7trgm8yjbzputnalfnnefmx0\/","category":"Stickman","tags":"Adventure, Arcade, Hypercasual, Spiderman, Stickman, Super, Superhero","thumb":"https:\/\/img.gamemonetize.com\/5xz3xp3p7trgm8yjbzputnalfnnefmx0\/512x384.jpg","width":"720","height":"1280"},{"id":"36626","title":"Shoot Z","description":"If you want to hone your accuracy and shooting skills, or just like to spend time playing exciting games, fiercely engage in virtual shooting at various targets. This is a great way to spend your free time having fun and at the same time benefit from pumping your accuracy.","instructions":"hold your finger on the screen and hold to kill red person ","url":"https:\/\/html5.gamemonetize.com\/tjxmsgjnys0ydxs9100dpqy9pt672aeo\/","category":"Stickman","tags":"3D, 3D Games, Gun, Kid, Kids, Kill, Killing, Shoot, Shooting, Sniper, Stickman, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/tjxmsgjnys0ydxs9100dpqy9pt672aeo\/512x384.jpg","width":"800","height":"600"},{"id":"30986","title":"Classic Hangman","description":"You’ve got five minutes in the subway but you don’t know what you should do to occupy your hands? You like doodles, scrawls and you’re a huge fan of the game of the Hangman? If that’s the case, you stopped at the exact right place! Classic Hangman is an adaptation of a great classic game supported by the presence of the little Hangman whose adorable expression are going to put a smile on your face! You should seriously play it!","instructions":"You must find a hidden word about which you only know the number of letters At each turn you must choose a letter that you think is in the word If you re right the letter appears in the word but if you re wrong you lose a live Make too many mista","url":"https:\/\/html5.gamemonetize.com\/0spxplc5t4uznpcsitu3oqj6drqqnzh5\/","category":"Stickman","tags":"Boy, Brain, Casual, Educational, Family, Girl, School, Stickman","thumb":"https:\/\/img.gamemonetize.com\/0spxplc5t4uznpcsitu3oqj6drqqnzh5\/512x384.jpg","width":"600","height":"800"},{"id":"37243","title":"Matchman PUBG","description":"The game is divided into 3 modes: 1 is normal mode, 2 countdown simple mode, and 3 is countdown hard mode. The rules of the game are that you can jump in the air up to twice in a row, and you can use a balloon floating in the air between land and land, and if you fall, you will fall to your death. Keep it a little mysterious and explore the rest on your ownThe game is divided into 3 modes: 1 is normal mode, 2 countdown simple mode, and 3 is countdown hard mode. The rules of the game are that you can jump in the air up to twice in a row, and you can use a balloon floating in the air between land and land, and if you fall, you will fall to your death. Keep it a little mysterious and explore the rest on your ownThe game is divided into 3 modes: 1 is normal mode, 2 countdown simple mode, and 3 is countdown hard mode. The rules of the game are that you can jump in the air up to twice in a row, and you can use a balloon floating in the air between land and land, and if you fall, you will fall to your death. Keep it a little mysterious and explore the rest on your own","instructions":"wasd Tap the screen to make the character jump up to two times in a row","url":"https:\/\/html5.gamemonetize.com\/yazg95e824szfygrsoa73p70p59jurx0\/","category":"Stickman","tags":"2D, Action, Air, Avoid, Ballon, endless, Funny, Google, Highscore, HTML5","thumb":"https:\/\/img.gamemonetize.com\/yazg95e824szfygrsoa73p70p59jurx0\/512x384.jpg","width":"750","height":"1334"},{"id":"36243","title":"Stickman Golf Super","description":"Enjoy this wonderful golf game! Calculate the angle and power of your shots in order to get a hole in one. Good luck, player!","instructions":"Mouse","url":"https:\/\/html5.gamemonetize.com\/tb8uo3r41mz8nhc3kh7puaegc7k65185\/","category":"Stickman","tags":"1 Player, 2D, Game, Golf, Stickman","thumb":"https:\/\/img.gamemonetize.com\/tb8uo3r41mz8nhc3kh7puaegc7k65185\/512x384.jpg","width":"800","height":"600"},{"id":"34794","title":"FNF: Pico VS Tankman","description":"It's Pico and Tankman from Week \"3\" and Week \"7\" from Friday Night Funkin Pico and Tankman! Go crazy with his beeps and bops! Play on the web here on a PC\/Mobile devices! If you want, if you have a windows computer, you can also download it with the download button below!","instructions":"To switch to touch control touch the toggle in game Arrow keys to play the sounds For mobile press D-pad button Hold Space and arrow keys for secondary sound Hope you like it Hold any of the buttons to hold a pose ","url":"https:\/\/html5.gamemonetize.com\/hgyefbfwu3nhqy76p5f4g6v7nsas4nph\/","category":"Stickman","tags":"Baby, Drawing, Robot, Stickman","thumb":"https:\/\/img.gamemonetize.com\/hgyefbfwu3nhqy76p5f4g6v7nsas4nph\/512x384.jpg","width":"800","height":"600"},{"id":"34633","title":"Curvy Punch","description":"Are you ready for the adventure full of punches and tricks? Curvy Punch! Yes, that’s the name of our game! You have the chance to throw punches like you’ve never done before! Punch the enemies and knock them out! Solve the puzzling challenges. Open store and buy characters and punches skins","instructions":"Follow the game instructions","url":"https:\/\/html5.gamemonetize.com\/fi43x6z1fap8mlplh1vdpod0ivf693fj\/","category":"Stickman","tags":"Arcade, Hypercasual, Punch, Stickman","thumb":"https:\/\/img.gamemonetize.com\/fi43x6z1fap8mlplh1vdpod0ivf693fj\/512x384.jpg","width":"720","height":"1280"},{"id":"34771","title":"Stickman Fight","description":"Do you like fighter games? Do you enjoy stickman games? Are you ready for the stick fight extreme Stickman Fight?? The hero of the casual stickman Stick Fight games is returning. The fight game with endless waves of ninja enemies hordes will test your brawl and survival skills. Become the ultimate stickman warrior boss in this free funny and hypercasual battle royale game. Have fun. Play stickman games on iyigames.com. Stick fight the endless horde of stickmen to break your own records or until your perish in the survival arena. Hit with your fist but also","instructions":"Keyboard","url":"https:\/\/html5.gamemonetize.com\/vqlbeetbbf92vkvo9lho6g7mc5dnn6oi\/","category":"Stickman","tags":"Action, Adventure, Best, Fight, Fighting, Fun, HTML5, Mobile, Stickman, WebGL","thumb":"https:\/\/img.gamemonetize.com\/vqlbeetbbf92vkvo9lho6g7mc5dnn6oi\/512x384.jpg","width":"800","height":"600"},{"id":"33676","title":"Stick To It!","description":"You will play as a stick figure trying to make their way through various levels scribbled in a notebook.","instructions":"- WASD to move - Space to jump - Mouse to draw - P to reset current Phase - L to reset current Level - 1 2 3 4 to view the corresponding phase s map","url":"https:\/\/html5.gamemonetize.com\/gex4b6b3as69hgv3bsmdf2vlqdddukj2\/","category":"Stickman","tags":"Stickman","thumb":"https:\/\/img.gamemonetize.com\/gex4b6b3as69hgv3bsmdf2vlqdddukj2\/512x384.jpg","width":"800","height":"600"},{"id":"31736","title":"Stickman Bridge Constructor","description":"You like construction games and stickman games? This game is made for you ! Play as an heroic stickman worker that build bridge after brige. You now want to become the most famous Stickman Bridge Constructor Stickman Bridge Constructor is a fun game easy to play... but dificult to master","instructions":"Touch the screen to build the perfect size bridge not to long not to short If your bridge is too long your stickman fall If your bridge is too short your stickman fall How far do you think you can go ","url":"https:\/\/html5.gamemonetize.com\/yhxbomastpavyk2shmrp2pdo3wpsxoea\/","category":"Stickman","tags":"Arcade, Bridge, Stickman","thumb":"https:\/\/img.gamemonetize.com\/yhxbomastpavyk2shmrp2pdo3wpsxoea\/512x384.jpg","width":"600","height":"800"},{"id":"34929","title":"Stickman Duel Battle","description":"A fun war game begins with Stick War: Infinity Duel. Grab the gun falling from the air, aim and kill the enemy stickman. Weapons will fall on the field at certain intervals during the game. Grab someone right away, hurry up to disarm your enemy. Some tracks are moving, keep your balance and try not to fall. Focus your attention and let your only goal be to collect weapons and kill your enemy. You can also play the Stick war game with your friends at school with the 2-player option. You will love this game with its brand new and vivid appearance. Hihoy Games wishes you good fun!","instructions":"Player 1 Move - Arrow Keys Shoot - L Key Player 2 Move - WASD Keys Shoot - F Key ","url":"https:\/\/html5.gamemonetize.com\/3rk4otwaf8um65l46h1w1ot6s3jw9n9u\/","category":"Stickman","tags":"2 Player, 2 Player Games, 2D, Action, Battle, Fight, Fighting, Physics, Stickman","thumb":"https:\/\/img.gamemonetize.com\/3rk4otwaf8um65l46h1w1ot6s3jw9n9u\/512x384.jpg","width":"800","height":"450"},{"id":"31743","title":"Stickman Sniper : Tap To Kill","description":"Do you like FPS and other shooting games? This game is for you! Take the identity of a secret agent and take your sniper. You have precise orders! The identity of each one of your targets is given to you at the beginning of the level. Concentrate and succeed in all your missions.","instructions":"Read your assignment find your targets then shoot accurately On mobile devices use the crosshair button to aim and shoot On desktop right-click to aim left click to shoot ","url":"https:\/\/html5.gamemonetize.com\/t2rb13zf55lngb76b1xbqrk9164xzkci\/","category":"Stickman","tags":"Kill, Shooter, Shooting, Stickman, War, weapons","thumb":"https:\/\/img.gamemonetize.com\/t2rb13zf55lngb76b1xbqrk9164xzkci\/512x384.jpg","width":"800","height":"600"},{"id":"31739","title":"Stickman Killer: Top gun Shots","description":"You like shooting games and you like stickman games? This game is made for you! Enter on the playground and play the best stickman shooter. Are you a Top Gun ?. You must shoot down your opponents. You must have no mercy against them. To win, you have to kill them all. Watch out ... you'll face numerous snipers. Their big boss will not hesitate to shoot you in the head !","instructions":"Stand in front of your opponents and start to shoot Each enemy has its specificity A life bar shows your health You have a limited amount of munitions ","url":"https:\/\/html5.gamemonetize.com\/3iguufxew1w7kbzroz77yv9r2mrap7fe\/","category":"Stickman","tags":"Action, Gun, Kill, Shoot, Shooting, Stickman, War, weapons","thumb":"https:\/\/img.gamemonetize.com\/3iguufxew1w7kbzroz77yv9r2mrap7fe\/512x384.jpg","width":"600","height":"800"},{"id":"32274","title":"Stickman Fighter Training Camp","description":"You like fighting games and stickman games? This game is made for you! Train to be the fastest stickman fighter in the world. Blast away an endless iron column in the fastest game ever. Put your reflexes to the test, unleach your skills and climb the leaderboards for global domination!","instructions":"Move right or left to hit the column Do not touch the obstacles or you will die ","url":"https:\/\/html5.gamemonetize.com\/l32hwgcoe7hwdg7eh4iij67059amfpzg\/","category":"Stickman","tags":"Arcade, Fight, Fighting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/l32hwgcoe7hwdg7eh4iij67059amfpzg\/512x384.jpg","width":"600","height":"800"},{"id":"32272","title":"Stickman Boxing KO Champion","description":"This new boxing game is available for all stickman fans! Fight 4 professionals in intense combat. Fight using a variety of devastating punches and combos. Jab, cross, uppercut, give in all you have, but don’t forget to dodge!. Master jabs, hooks, uppercuts, body punches and combine them with devastating Special Punches.","instructions":"Like in real boxing you can throw many punches uppercut jab cross and dodging Knock-out all your opponents and the victory is yours ","url":"https:\/\/html5.gamemonetize.com\/6tmp9phczxm9yfyona4ntvjrnvd70huc\/","category":"Stickman","tags":"Boxing, Fight, Fighting, Sport, Stickman","thumb":"https:\/\/img.gamemonetize.com\/6tmp9phczxm9yfyona4ntvjrnvd70huc\/512x384.jpg","width":"800","height":"600"},{"id":"30354","title":"Stickman Boxing KO","description":"Welcome to the online game Stickman Boxing KO Champion. This is a free Sport Game. You're not a boxing expert? Don't worry, the boxing game is easy enough to learn. Just press the Space button repeatedly to perform punches and block attacks, and then hit the other boxer with an uppercut, lowercut, or body shot. Once you've completed your round, you can move on to the next round. Stickman Boxing KO Championship unblocked game is an online game that features 4 stickman fighters in intense combat. You'll be able to punch opponents with a variety of devastating punches and combos. Using your mouse or keyboard, you'll be able to navigate the game and perform all of your attacks. The HTML5-based game is also compatible with PCs and mobiles. The game includes many features to make it more enjoyable. It allows you to throw various punches and combs. Depending on your skill level, you can hit your opponents with an uppercut, cross, jab, or even dodge. You'll be able to knock out all of your opponents, which is the goal of the game. As long as all of your opponents are knocked out, you can win.","instructions":"Fight and win","url":"https:\/\/html5.gamemonetize.com\/dmzl9eimmp3oubqzq2ses7kh0rda9sbp\/","category":"Stickman","tags":"Boxing, Boys, Fight, Fighting, Girls, Highscore, HTML5, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/dmzl9eimmp3oubqzq2ses7kh0rda9sbp\/512x384.jpg","width":"800","height":"600"},{"id":"31737","title":"Stickman Fighter: Epic Battle","description":"You like fighting games and stickman games? Then this game was made for you! Enter the arena and play as a heroic Stickman. You must fight against your opponents. You must have no mercy against them. To win, you have to kill them all. But watch out because you'll face numerous warriors.","instructions":"Click touch on the right or the left of the screen or use arrow keys to hit Beat the enemies Stand in front of your opponents and start the combat Each enemy is unique A life bar shows your health ","url":"https:\/\/html5.gamemonetize.com\/p27n60wut6rqymgjr3um08eoy0cg3ru6\/","category":"Stickman","tags":"Action, Battle, Fight, Game, Highscore, Skill, Stickman, Sword, weapons","thumb":"https:\/\/img.gamemonetize.com\/p27n60wut6rqymgjr3um08eoy0cg3ru6\/512x384.jpg","width":"800","height":"600"},{"id":"32445","title":"Ragdoll Heroes War","description":"Prepare for the battle of Ragdoll Heroes. Choose your hero and start the battle right away. At the end of each battle, you will earn mines and diamonds. You can produce new weapons with the mines you earn. Or you can strengthen your weapon. You can get stronger with different characters. You can also gain an advantage in battle by improving your character. Prepare to proclaim your heroism with multiplayer mode, story mode, survival mode and training mode!","instructions":"For PC W A S D or Arrow keys and Mouse For mobile Touch controls and on-screen buttons","url":"https:\/\/html5.gamemonetize.com\/h5e7v7g9nrzukc410sepq1nll5gpvuun\/","category":"Stickman","tags":"Action, Adventure, Arcade, Arena, Battle, Clash, Fighting, Hot, Hypercasual, Mobile, Multiplayer, PvP, Stack, Stickman, Strategy, WebGL","thumb":"https:\/\/img.gamemonetize.com\/h5e7v7g9nrzukc410sepq1nll5gpvuun\/512x384.jpg","width":"900","height":"506"},{"id":"30649","title":"Doddle Warrior 2D","description":"Run, jump, and dash your way through cheerful hand-drawn worlds as you avoid obstacles and chase your own high score!","instructions":"WASD or arrow keys Space bar to attack ","url":"https:\/\/html5.gamemonetize.com\/vspsvzchmktsvp89x26dc7u039cq0hx7\/","category":"Stickman","tags":"Action, Hypercasual, Stickman","thumb":"https:\/\/img.gamemonetize.com\/vspsvzchmktsvp89x26dc7u039cq0hx7\/512x384.jpg","width":"800","height":"600"},{"id":"30546","title":"StickMan Fly","description":"Click on the screen and pull the stickman!","instructions":"Click on the screen and pull ","url":"https:\/\/html5.gamemonetize.com\/4ywlg1t7p7auy29j5340wuqfttu763o0\/","category":"Stickman","tags":"Stickman","thumb":"https:\/\/img.gamemonetize.com\/4ywlg1t7p7auy29j5340wuqfttu763o0\/512x384.jpg","width":"800","height":"600"},{"id":"30542","title":"Serious Stickness","description":"2D Shooter for PC. You have the firepower of an armed stickman, objectives and a lot of enemies to have fun with. Let's get sticky!","instructions":"Use Mouse And Keyboard To Play ","url":"https:\/\/html5.gamemonetize.com\/6ig9ljcov6odvhvd46nbp42bcoq8unfa\/","category":"Stickman","tags":"Stickman","thumb":"https:\/\/img.gamemonetize.com\/6ig9ljcov6odvhvd46nbp42bcoq8unfa\/512x384.jpg","width":"800","height":"600"},{"id":"30325","title":"Stickman Shadow Fighter","description":"Play stickman hero robbing superhero gangster crime city. Tie your shoelaces to become the stickman hero in gangster city. Play as a flying stickman in adventurous superhero game. Mafia city need you to tear apart monsters by fighting gangster mafia in flying superhero game. Become a flying hero in a criminal city of gangsters and fight the murderers for the peace of the locality. Take the challenge as a real stickman hero in gangster mafia and take the lead by eliminating the monster from superhero game.","instructions":"Use Mouse To Play and Keyboard","url":"https:\/\/html5.gamemonetize.com\/r8bnwrkp0ne1lu6nqnc6h0m61gei9ttu\/","category":"Stickman","tags":"Action, Battle, Fighting, H5, Hypercasual, Stickman","thumb":"https:\/\/img.gamemonetize.com\/r8bnwrkp0ne1lu6nqnc6h0m61gei9ttu\/512x384.jpg","width":"800","height":"600"},{"id":"30281","title":"456 Minimal Bubble Shooter","description":"Put your strategy skills to the test! Compete against friends and family and see who can reach the highest score and get 3 stars on every level. Earn coins while you play and use them to get cool boosters. Use your logic and puzzle-solving skills to complete the missions and clear the board, and make sure to collect special daily bonuses.","instructions":"Try the Puzzle Game Mode and Discover the Ultimate Bubble Popping Fun This shooter is a thrilling balloon popper free app with thousands of challenging puzzles to master Shoot the colorful balls to advance to the next amazing puzzle level train","url":"https:\/\/html5.gamemonetize.com\/38mkqmjp4j4dcznqgqs0084iosnvzvcd\/","category":"Stickman","tags":"Bubble, Bubble Shooter, Game, Games, Puzzle, Shoot, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/38mkqmjp4j4dcznqgqs0084iosnvzvcd\/512x384.jpg","width":"800","height":"600"},{"id":"30029","title":"Stickman vs Aliens","description":"Welcome to Stickman vs Aliens, A new Action War game. Slide your finger left, right & Up and down to control you Stickman hero. Shoot your enemy and destroy Tanks and planes. Collect weapons and coins to get a high score. good luck","instructions":"Slide Up Down Left Right","url":"https:\/\/html5.gamemonetize.com\/r7drhkl4vp5ip0107pz9rtd6qgb9hp5t\/","category":"Stickman","tags":"Fighting, Fire, Gun, H5, Highscore, HTML5, Plane, running, Shooting, Stickman, Tank, War","thumb":"https:\/\/img.gamemonetize.com\/r7drhkl4vp5ip0107pz9rtd6qgb9hp5t\/512x384.jpg","width":"720","height":"1280"},{"id":"15569","title":"Stickman Dragon Ball Fight - Super Stick Warriors","description":"You are a fan of role playing games? You like it to be stickman games? Welcome to Stickman Dragon Fight - Super Stick Warriors! You will find it so much fun to experience this simple but interesting gameplay. All you need to do is dodge, jump, power your ki, perform basic and 3 advanced skills, transform your hero into an ultra instinct then fight against invaders. The control is so simple that you will be amazed at how attracting the sound effects and graphics are.","instructions":"MOUSE and ARROWS","url":"https:\/\/html5.gamemonetize.com\/f0hbsg1m7jfual8m1e8gtwqmu286chsr\/","category":"Stickman","tags":"2D, Action, Adventure, Anime, Battle, Best, Cartoon, Cartoon Network, Dragon Ball Z, Fight, Game, Ninja, Punch, Simulator, Street Fighting, weapons","thumb":"https:\/\/img.gamemonetize.com\/f0hbsg1m7jfual8m1e8gtwqmu286chsr\/512x384.jpg","width":"800","height":"600"},{"id":"29454","title":"Spy Shot Laser Bounce","description":"Spy Shot Laser Bounce is a fun game where you put your skills to the test. As a Stickman Spy you have to kill enemies with your cool laser pistol. Every bullet bounces and you can use this as advantage to take down the bad guys! But be careful as you have only 10 bullets each level. There are also obstacles to challenge your skill. Good luck!","instructions":"Use Mouse to aim and Left Click to shoot","url":"https:\/\/html5.gamemonetize.com\/9e2ca7f45zgk7nqcybwxtr771qo0rhgw\/","category":"Stickman","tags":"1 Player, 3D, 3D Games, Action, Android, Arcade, HTML5, Mobile, Shoot, Shooter, Shooting, Skill, Skills, Stickman","thumb":"https:\/\/img.gamemonetize.com\/9e2ca7f45zgk7nqcybwxtr771qo0rhgw\/512x384.jpg","width":"850","height":"600"},{"id":"29217","title":"Stick War Adventure","description":"Start an adventure with the fearless and equipped stickman! Defeat the enemies that come stronger in each level and Upgrade the Stickman by collecting the falling items and golds! At the end of the level, go to the Upgrade section from the game menu and increase the strength of the character and activate special attacks. Get ready for the Bosses that will come in the next chapters. Let the adventure begin!","instructions":"Move LEFT RIGHT ARROWS Jump UP ARROW Punch V Special Attacks D S Z X C ","url":"https:\/\/html5.gamemonetize.com\/47exn8zffr5x2qqbq83ywfcbsk60q4sz\/","category":"Stickman","tags":"1 Player, Action, Adventure, Battle, Boy, Collecting, Fight, Fighting, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/47exn8zffr5x2qqbq83ywfcbsk60q4sz\/512x384.jpg","width":"800","height":"450"},{"id":"28693","title":"Stickman Archer","description":"Stickman decides to test his own skills and pass the tests, consisting in marksmanship, allowing you to hit targets, which are ordinary signs or people armed with a military arsenal. Score as many points as possible for successfully removing targets under different conditions.","instructions":"Score as many points as possible for successfully removing targets under different conditions ","url":"https:\/\/html5.gamemonetize.com\/a4aoxbnnozyaokbtif3wpdaho9ymoe7t\/","category":"Stickman","tags":"Action, Adventure, Arcade, Fight, Fighting, Gun, HTML, HTML5, Kid, Kids, Kill, Killing, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/a4aoxbnnozyaokbtif3wpdaho9ymoe7t\/512x384.jpg","width":"800","height":"600"},{"id":"28462","title":"Stickman City Battle","description":"Enjoy Incredible Monster Stickman Rope hero fantastical massive city destruction with angry stickman incredible monster attack games. Smash cars, attack city people and cause horrific traffic jam with angry stickman incredible monster rampage in stickman incredible monster fighting games. Enjoy stickman funky acts and run as crazy stickman incredible monster escape games. Nonstop thrill of stickman incredible monster attack & escape challenges as king of city who has no limit to smash and thrash anything which comes in stickman incredible monster way in stickman games. Don’t stop the stickman incredible monster revenge. Your aggression for city attack in necessary in stickman incredible monster games. Play as an angry stickman hero incredible monster and make the whole town trample in rampage stickman hero incredible monster city attack stickman incredible monster hero escape games. Stickman police cops and us army stickman are on the roads to stop the in stickman incredible monster from destruction in mighty incredible superhero games. Smash and Crush everything that comes on stickman hero way and become the incredible monster Hero in breaking the stickman police prison superhero games. Defend by superhero fighting skills in stickman hero crime shooting games. Gangster vegas stickman incredible monster fighting makes crime city escape mission difficult in stickman hero incredible monster escape games. Stickman police cops call stickman army fighters for stickman incredible monster haunting. Complete stickman incredible monster attack missions and cause massive crime city destruction, smash and crash the cars and everything in the city escape mission. Attack and act as smasher, and utilize real stickman incredible monster fighting & smashing skills in crime city survival stickman incredible monster rampage simulator. Break, smash, attack, destroy and throw, do whatever you want to do being wild stickman incredible monster fighter. People are afraid & trying to escape from crazy stickman incredible monster attack in city rampage game. Crazy stickman incredible monster is tough to handle in city attack stickman incredible monster simulator! No limit or any boundary will stop stickman incredible monster attack, perform wonder attack for city destruction. Stickman Incredible Monster Hero City Rampage features: Endless stickman monster powers Fantastical missions cause destruction for stickman incredible monster Unlock variant stickman incredible monsters Funky & crazy power shortcuts to destroy city Flexible controls for stickman incredible monster simulation Download now and leave your feedback as suggestive comment so we can make gameplay better for users.","instructions":"MOUSE w q d c espace","url":"https:\/\/html5.gamemonetize.com\/ycr80m0r7urjhq8rnjh6f00oi4s8gvug\/","category":"Stickman","tags":"Action, Adventure, Battle, Battlegrounds, Fight, Fighting, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/ycr80m0r7urjhq8rnjh6f00oi4s8gvug\/512x384.jpg","width":"1024","height":"768"},{"id":"28114","title":"Tactical Squad Stickman","description":"Even kindergarten graduates know what killers do. But the fact that this criminal activity also has its own clear specialization, someone may not even guess. This is often associated with a favorite weapon - someone prefers to use a sniper rifle, others prefer a pistol, explosives or melee weapons. In today's game, you will meet such a professional sniper. It is considered one of the best, so there are always orders. Would you like to see how everything happens and participate in several of his missions?","instructions":"Shoot at the criminal ","url":"https:\/\/html5.gamemonetize.com\/3x78cxj7rteyfv6l4fo0m104tee36dtk\/","category":"Stickman","tags":"Action, Adventure, Battle, Battlegrounds, Click, Clicker, Fight, Fighting, Gun, HTML, HTML5, Shoot, Shoot 'Em Up, Shooting, Sniper, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/3x78cxj7rteyfv6l4fo0m104tee36dtk\/512x384.jpg","width":"800","height":"600"},{"id":"27756","title":"Army The Resistance","description":"Stickman Army The Resistance is a fun game you can play in your web browser for free on Superkidgames.com. Play Stickman Army The Resistance and be prepared to take control of stick figure duo! Your entire area is surrounded by a horde of renegade stickman whose aim is only to kill people. You as the best army team have decided to take care of your region. Grab your weapons and get ready to clear the area from these evil souls! Your team includes two highly skilled and trained soldiers. Plenty of powerful weapons you have to use to stop this mass massacre. Take your position, fight like a pro and tell your enemies that you have decided to fight with the wrong persons this time! Lead your team to the most wanted win in this brand new action game! Choose from different weapon options that include defences turret, sandbags, mines, barbed wire, bombs, the big bertha, shotgun, heavy weapons, rocket launcher, flame thrower, kalashikov, sniper rifle, rifle, bazooka and machine gun! Each weapon has its own specialities and your victory in this HTML5 shooting game depends upon how wisely you use it defeat your enemies. You would die or lose your game if the enemies enter your defense. Plan a strategy to transform your defense into an unbeatable fortress in this cool war game! Do not forget to upgrade your weapons to enhance your power. There are 40 unique and challenging levels to play through, 60 powerful weapons and amazing surprises and bonuses to unlock. Good luck to invite your friends to compete, set your own high score and create a secure place on the leaderboard!","instructions":"Mouse for shooting and Move On Screen ","url":"https:\/\/html5.gamemonetize.com\/z5lfi4ddwo5brn4saghigc5oonpkpktv\/","category":"Stickman","tags":"Action, Adventure, Battle, Battlegrounds, Bomb, Boys, Defense, Gun, HTML5, Mobile, Stickman, Submachine, Tower Defense, War","thumb":"https:\/\/img.gamemonetize.com\/z5lfi4ddwo5brn4saghigc5oonpkpktv\/512x384.jpg","width":"800","height":"600"},{"id":"27541","title":" Stickman Ping Pong Match","description":"Stickman Ping Pong Match is a fast paced realistic tennis game with gorgeous courts and great atmosphere, simple controls and tons of replay value. Good luck!","instructions":"It is played with the mouse ","url":"https:\/\/html5.gamemonetize.com\/nrvq1ezin78m7vtbhiebwlobtbzrwji3\/","category":"Stickman","tags":"Ball, Boys, Matching","thumb":"https:\/\/img.gamemonetize.com\/nrvq1ezin78m7vtbhiebwlobtbzrwji3\/512x384.jpg","width":"720","height":"1280"},{"id":"25147","title":"Avoid You Dying","description":"Welcome to Avoid You Dying game. Hit the target to complete the levels. Sounds fun! right! But not so easy. If you miss you will be hit by massive weight. Play carefully and complete the levels. Share with your friends and have fun!","instructions":"Left Mouse button click","url":"https:\/\/html5.gamemonetize.com\/yizrneany65nygcz9q3f9o25exoa480a\/","category":"Stickman","tags":"Action, Kids, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/yizrneany65nygcz9q3f9o25exoa480a\/512x384.jpg","width":"800","height":"600"},{"id":"26232","title":"Stick Merge","description":"Stick Merge is a casual action and merging game . Your aim is to combine various types of weapons to create more powerful guns, and ultimately use them on the moving stick figures in the shooting range. Prepare your arsenal, upgrade your pistol, explore all the power-ups and become the best shooter in town. How powerful can you get in Stick Merge? Stick around to find out!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/fayy3t63ulyf074trnts40an71cqjcci\/","category":"Stickman","tags":"Action, Christmas, Stickman","thumb":"https:\/\/img.gamemonetize.com\/fayy3t63ulyf074trnts40an71cqjcci\/512x384.jpg","width":"800","height":"600"},{"id":"26552","title":"VexMan Parkour","description":"Welcome to VexMan Parkour, a new stickman adventure Game! Run, Jump and Avoid obstacles to collect golden coins. When you collect all coins the door will open for you to escape! Explore Tons of challenging Levels and try to win them all. Let's go!","instructions":"A and D to move left and right use W to jump ","url":"https:\/\/html5.gamemonetize.com\/jds9ej3vwf8h30jmk1bygwu01piagt63\/","category":"Stickman","tags":"Adventure, Arcade, Best, Casual, Hot, Hypercasual, Jumping, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/jds9ej3vwf8h30jmk1bygwu01piagt63\/512x384.jpg","width":"800","height":"600"},{"id":"26539","title":"StickMan Parkour 2","description":"Here is another Version of Stickman Parkour Games. Your mission is to run and jump to reach the the door to unlock the next level. Be careful to not fall from edges and try to avoid obstacles. Let the adventure begins!","instructions":"A and D to move left and right use W to jump and climb use S and D or A to scroll you can also use arrows","url":"https:\/\/html5.gamemonetize.com\/ybbprvnzp8v7kixeiid7aum3fbxdty96\/","category":"Stickman","tags":"Batman, Best, Hot, Hypercasual, jump, Jumping, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ybbprvnzp8v7kixeiid7aum3fbxdty96\/512x384.jpg","width":"800","height":"600"},{"id":"26535","title":"Stickman Run Parkour","description":"Welcome to Stickman Run, A new Stickman running parkour Game . you'll face challenging levels filled with devious traps once more. Are you ready to take command of this brave stickman and show his acrobatic abilities while earning various achievements and gems? Best of luck!","instructions":"A and D to move left and right use W to jump and climb use S and D or A to scroll you can also use arrows","url":"https:\/\/html5.gamemonetize.com\/p94c6azbdqwpipfht8wp1xtxsc10vcl2\/","category":"Stickman","tags":"Action, Adventure, Best, Hot, jump, Jumping, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/p94c6azbdqwpipfht8wp1xtxsc10vcl2\/512x384.jpg","width":"800","height":"600"},{"id":"21978","title":"Ragdoll Fighter","description":"Get ready for the ragdoll battle! Choose your ragdoll character and start fighting right away. In Ragdoll Fighter, you earn some mines and diamonds at the end of each battle. With these mines, you can produce new weapons or strengthen your current weapon. You can also buy one of many different characters and increase your power. Character abilities are also designed to be upgradeable. You can increase your character's abilities with the diamonds you earn. You will be satisfied with fighting with multiple game modes. Start the battle with multiplayer mode, story mode, survival mode and training mode!","instructions":"For PC W A S D or Arrow keys and Mouse For mobile Touch controls and on-screen buttons","url":"https:\/\/html5.gamemonetize.com\/v72zk9xx8pvkzgdbvlzspqcvmcnawcjl\/","category":"Stickman","tags":"Action, Adventure, Arcade, Arena, Battle, Clash, Fighting, Hot, Hypercasual, Mobile, Multiplayer, PvP, Stack, Stickman, Strategy, WebGL","thumb":"https:\/\/img.gamemonetize.com\/v72zk9xx8pvkzgdbvlzspqcvmcnawcjl\/512x384.jpg","width":"800","height":"600"},{"id":"26547","title":"Stickman Parkour 3","description":"Stickman Parkour Vol3 Your mission is to run , And Climb walls to reach the the door to unlock the next level. Be careful to not fall from edges and try to avoid obstacles. Let the adventure begins!","instructions":"A and D to move left and right use W to jump and climb use S and D or A to scroll you can also use arrows","url":"https:\/\/html5.gamemonetize.com\/0nmaftolhf5awg8o8hobe43pdgw2qogq\/","category":"Stickman","tags":"Action, Adventure, Best, Hot, Hypercasual, jump, Jumping, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/0nmaftolhf5awg8o8hobe43pdgw2qogq\/512x384.jpg","width":"800","height":"600"},{"id":"26377","title":"Stickman Parkours","description":"Welcome to Stickman Parkour, A new Running and jumping Game you'll face challenging levels filled with devious traps once more. Are you ready to take command of this brave stickman and show his acrobatic abilities while earning various achievements and gems? Best of luck! ACTION","instructions":"Arrows to move and jump Or A and D to move S to Jump Press D multiple times to Climb ","url":"https:\/\/html5.gamemonetize.com\/xcepjor1hywkvqoy3vlq7jf46q20zt46\/","category":"Stickman","tags":"Action, Adventure, Arcade, Best, Hot, Hypercasual, Jumping, Stickman","thumb":"https:\/\/img.gamemonetize.com\/xcepjor1hywkvqoy3vlq7jf46q20zt46\/512x384.jpg","width":"800","height":"600"},{"id":"15074","title":"Halloween Piano Tiles","description":"Halloween is coming now! Play Halloween Piano Tiles for FUN and FREE! I hope you enjoy these piano tiles during the Halloween festival. Good luck! Enjoy this spooky Halloween theme and melody piano songs! Happy Halloween! ......","instructions":"HOW TO PLAY Halloween Piano Tiles is very easy to play The rule is simple Push the black piano tracks continuously to play the music Watch for the white tiles and never miss the black piano til","url":"https:\/\/html5.gamemonetize.com\/zua0ivz4wsudhz83qzhkh2sg5r6nh2bh\/","category":"Stickman","tags":"1 Player, Halloween","thumb":"https:\/\/img.gamemonetize.com\/zua0ivz4wsudhz83qzhkh2sg5r6nh2bh\/512x384.jpg","width":"800","height":"600"},{"id":"25447","title":"Stickman Death Run","description":"Everyone's favorite stickman is now on a death run in the pixel world. If you want to achieve victory with him, run. Help him run, be careful, there are many obstacles, you have to watch out for these obstacles.","instructions":" Press WASD keys to move Mobile Touch Control","url":"https:\/\/html5.gamemonetize.com\/rt8qdnl052x3hfr075070frs36kd9tgp\/","category":"Stickman","tags":"1 Player, 2D, Adventure, Arcade, Stickman","thumb":"https:\/\/img.gamemonetize.com\/rt8qdnl052x3hfr075070frs36kd9tgp\/512x384.jpg","width":"800","height":"600"},{"id":"24514","title":"Get To The Choppa","description":"A fun and simple game designed specifically for you to relax and unwind. Enter the online game and get a great opportunity to pass the time by controlling a funny character running through the city streets.","instructions":"Move By click the screen","url":"https:\/\/html5.gamemonetize.com\/7bn3oi32gae156qwy0pkfh66kfkms21d\/","category":"Stickman","tags":"Action, Adventure, city, H5, HTML, HTML5, Kill, Killing, Police, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/7bn3oi32gae156qwy0pkfh66kfkms21d\/512x384.jpg","width":"800","height":"600"},{"id":"24319","title":"Shark World","description":"Welcome to Shark World where you can have different ocean shark species, build underwater home, and build your underwater shark world. Explore the mysterious world of underwater animals. Collect exciting sea sharks like hammerhead shark, Angel sharks and prehistoric ones like Megalodon. Feed, breed and Battle with your sea monsters.","instructions":"- Free to play - Underwater environment - Park building sim game - A wide range of exciting sharks - A wide variety of exciting sea Shark to breed - Fight in underwater battle arena -Make your own team of Sharks and take them to battle ","url":"https:\/\/html5.gamemonetize.com\/h22zpmlgoufkr1k7nw35351ob34cxpzt\/","category":"Stickman","tags":"Action, Game, Games, HTML, HTML5, Shark, World","thumb":"https:\/\/img.gamemonetize.com\/h22zpmlgoufkr1k7nw35351ob34cxpzt\/512x384.jpg","width":"800","height":"600"},{"id":"18155","title":"Stick Fighter 3D","description":"One Player and Two Player Retro Stickman Fight Game.","instructions":"Blue Player Move W A S D Punch F Kick G Bonus R Orange Player Move ARROW KEYS Punch L Kick K Bonus O ","url":"https:\/\/html5.gamemonetize.com\/vlskz7dtsxmpg34pu546de1wjng6ffob\/","category":"Stickman","tags":"2 Player, 2 Player Games, 2D, 3D, Fighting, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/vlskz7dtsxmpg34pu546de1wjng6ffob\/512x384.jpg","width":"800","height":"450"},{"id":"23863","title":"Stick NinjaJump Hero Fun","description":"Use your voice to move and jump between platforms. The more you shout, the higher you jump ! Watch out for pitfalls ! Have a blast with your friends, but don't disturb your neighbour too much!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/v820qo2o4u177mg6xa5v511zpy4hx4sb\/","category":"Stickman","tags":"Adventure, Arcade, jump, Jumping, Ninja, Stickman","thumb":"https:\/\/img.gamemonetize.com\/v820qo2o4u177mg6xa5v511zpy4hx4sb\/512x384.jpg","width":"800","height":"600"},{"id":"23868","title":"Halloween dress up game","description":"You are in front of the mirror. Moonlight around your friend asking you what you would put on this Halloween party. Sounds spooky? Try this spooky dress up tonight with your best friend to be shiny fashion scariest lady. Not in the mood to go full-on vampire for Halloween this year? It's not so scare this year? No! It is even like fun. So try cute fashion dress up game this October, express nice part of yourself. Dress like mysterious shining star for the Halloween party and don't forget to put on lovely horns and bows. Brake the rule, you are lady, and you should look nice even during the Halloween.","instructions":"Sevelina dress up game will teach you the right approach for the perfect Halloween dress up this October Yow will get the most our of you wardrobe for the Halloween party Also the dress up for such a night needs some skill an Sevelina knows how to teach","url":"https:\/\/html5.gamemonetize.com\/1d3prqpobfdc6d0j6e5h3tdb7bu3jfv4\/","category":"Stickman","tags":"Dress Up, Girl, Girls, Halloween, Holiday, Stickman","thumb":"https:\/\/img.gamemonetize.com\/1d3prqpobfdc6d0j6e5h3tdb7bu3jfv4\/512x384.jpg","width":"800","height":"600"},{"id":"23981","title":"Free Rider Jumps","description":"Endless Bike Race is another game from the popular creator of Free Rider HD! Here you will be sitting behind the wheel of a mountain bike and traverse difficult terrain. The bike itself rides forward and you will be trying to stay on track. Drive forward and jump, try to do back and front flips, but be very careful not to fall on your back. If you do, the game will end for you and you will have to start the whole level from the beginning.","instructions":"Move right or left","url":"https:\/\/html5.gamemonetize.com\/w3qdktapi7czrao6th7kpi8gqwxau1e8\/","category":"Stickman","tags":"Best, Bike, H5, Hot, HTML, HTML5, jump, Jumping, Race, Racing, run, running, Sport, Sports, Stickman","thumb":"https:\/\/img.gamemonetize.com\/w3qdktapi7czrao6th7kpi8gqwxau1e8\/512x384.jpg","width":"800","height":"600"},{"id":"24379","title":"Slap Contest","description":"Welcome to Slap Contest Game. Move left and right and double tap to slap your opponent. Get 3 slaps to move to the next level. You can choose to play 2P mode if you want play with your frinds and family. Enjoy","instructions":"Arrows to move and tap right arrow two times to slap","url":"https:\/\/html5.gamemonetize.com\/v7o6s7t59b2672ws7uccn90963zfvgr8\/","category":"Stickman","tags":"Best, Fight, Fighting, Hot, Multiplayer, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/v7o6s7t59b2672ws7uccn90963zfvgr8\/512x384.jpg","width":"800","height":"600"},{"id":"23599","title":"Stickman Fall Guys: Running Race","description":"It is time for some delightfully comical epic run knockout challenge. Enter a challenging dodge and run arena of a huge online party of up to 30 players and attempt everything you can to beat your opponents. The Fall Go – Stickman Obstacle Course Running Race is all about escalating chaos and compelling opponents, which you must overcome to win the fun run levels. Ultimate Physics Based Fun Race Do you think you have got what it takes to defy the physics laws in the middle of chaos? Survive the mayhem of a huge online multiplayer runner party and complete the running games challenges to be the last one to survive and receive the king’s crown. The stickman racer game is an absolute treat for those who like to enjoy physics based fun race challenges in their free time.","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/rxwor4vgwu67uc22758om5297vdmxqv5\/","category":"Stickman","tags":"Batman, Fun, Games, Multiplayer, PacMan, Race, Racing, run, running, Spiderman, Stickman","thumb":"https:\/\/img.gamemonetize.com\/rxwor4vgwu67uc22758om5297vdmxqv5\/512x384.jpg","width":"960","height":"600"},{"id":"23600","title":"Fall Guys Sonic : Knockout Royale","description":"Participate in the ultimate mobile run royale games and rush Sonic Sonic opponents guys or they will knock you over! Challenge a random fall or soda guy & Start playing the most fun and exciting last man standing game where do not fall io is your duty and falling is not an option. Clash with Sonic crowds and run with other guys in a hilarious silly race. Run, race, slide, jump, fall, flip, punch, and blast your way through insane obstacles with dozens of other online mobile opponents. Guys, girls, tall kids, short dudes, funny boys, weird teens, everyone is welcome to fight, run, and have a stupid good time during this knockout race. Run stumble guys VS Sonic is an amazing chaotic obstacle course battle royale game! Knock over your opponents and become the last man standing in this falling guys game. Run stumble guys & dudes looks out for the mobile obstacles moving and other hurdles waiting for you. Sonic us free Sonic opponents and crewmate friends are your biggest enemies in this real play knock over game. They will do whatever it takes to eliminate you to win the free soda run guys race.","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/tcenm9zw11f87yyfylpqay90xewftsd3\/","category":"Stickman","tags":"Action, Adventure, Batman, Hot, New, Prison, Race, Racing, run, running, Spiderman, Stickman","thumb":"https:\/\/img.gamemonetize.com\/tcenm9zw11f87yyfylpqay90xewftsd3\/512x384.jpg","width":"960","height":"600"},{"id":"22852","title":"Flip Master Home","description":"Flip Master is trying to reach it's bed by jumping from the furniture in the house. Characters can go to some furniture once and some with a double jump. Estimate the distance and jump at the right time. You can buy new characters from the market in the following levels.","instructions":"MOUSE ","url":"https:\/\/html5.gamemonetize.com\/f5djho7hqxguavlkrjbklvbmmgy248sg\/","category":"Stickman","tags":"3D, Hypercasual, jump, Jumping, Simulation, Skill, Sport, Sports, WebGL","thumb":"https:\/\/img.gamemonetize.com\/f5djho7hqxguavlkrjbklvbmmgy248sg\/512x384.jpg","width":"800","height":"450"},{"id":"23528","title":"Super Stickman Fight All-Star Hero","description":"A whole new storyline about characters familiar to all of us. A Devil God group capable of bringing all characters from different universes gathered in your world through a space portal. You, along with all your new friends, will have to face the most powerful villains in the multiverse. This war is called Chaos War. Stand side by side with teammates and fight and bring new peace to your world. You can choose their Super Heroes, upgrade the ultimate power, join the tournament of multiverses and climb TOP on worldwide rankings.","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/qbv1ya43ddnt5colk3jmmxwk1qasdi0o\/","category":"Stickman","tags":"Action, Anime, Batman, Battle, Battlegrounds, Fight, Fighting, Management, PacMan, Spiderman, Stickman, Super, Superhero, War","thumb":"https:\/\/img.gamemonetize.com\/qbv1ya43ddnt5colk3jmmxwk1qasdi0o\/512x384.jpg","width":"750","height":"400"},{"id":"23519","title":"Stickman Fight : Dragon Legends Battle","description":"Among all the stickman games, Stickman Fight - Battle Royale is one of the funniest and easiest to play.","instructions":"Being the strongest stickman hero was never be that extremely simple Using only one joystick to beat the stick enemies on body parts such as head arm or leg and avoiding their hits Grab the weapon in the battlefield or take it from your enemies to s","url":"https:\/\/html5.gamemonetize.com\/qsk8nvwgk0cwz4tf6m1q6yo2rodarpdr\/","category":"Stickman","tags":"Action, Adventure, Anime, Arcade, Batman, Battle, Battlegrounds, Cartoon, Cartoon Network, Dragon, Dragon Ball Z, Fight, Multiplayer, PacMan, Simulation, Spiderman, Stickman, Street Fighting, Super, Superhero","thumb":"https:\/\/img.gamemonetize.com\/qsk8nvwgk0cwz4tf6m1q6yo2rodarpdr\/512x384.jpg","width":"750","height":"400"},{"id":"23516","title":"Stickman Fight Battle - Shadow Warriors","description":"Supreme Stick Warriors - Shadow of Legends is a physic-based stickman fighting game. Fighting against other stickmans to become legend in stickman fight and get awesome rewards in stick fight games. Do you want to have exciting times playing stickman fight warriors games & become the supreme stickman fighter? Download Supreme Stick Warriors - Shadow of Legends now and enjoy it!","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/62c3vlawwn62mc8fzlpjc42h9novaq10\/","category":"Stickman","tags":"Anime, Batman, Battle, Battlegrounds, Cartoon, Cartoon Network, Dragon Ball Z, Fight, Fighting, Hypercasual, Multiplayer, PacMan, Spiderman, Stickman, Street Fighting, Super, Superhero, War","thumb":"https:\/\/img.gamemonetize.com\/62c3vlawwn62mc8fzlpjc42h9novaq10\/512x384.jpg","width":"750","height":"400"},{"id":"23518","title":"Stickman Fighter Infinity - Super Action Heroes","description":"Stickman Fighter Infinity - Super Action Heroes is a free-to-play stickman fighting game. All you need to do to role-play as heroes and fight against villains in the universe is cleverly using buttons to move, jump, teleport, block, attack and transform. This extremely simple gameplay, top-notch graphics effect, and vivid sound have attracted many players around the world.","instructions":" Spin the free lucky wheel to get surprising rewards whenever you want Try to complete daily quests and achieve milestones to get lots of rewards Free gifts are available at any time","url":"https:\/\/html5.gamemonetize.com\/pplbybpg1jxrqav6ei9nbstjqnvbp1qz\/","category":"Stickman","tags":"Adventure, Anime, Batman, Cartoon, Cartoon Network, Fight, Fighting, Mobile, PacMan, Spiderman, Stickman, Super, Superhero, War","thumb":"https:\/\/img.gamemonetize.com\/pplbybpg1jxrqav6ei9nbstjqnvbp1qz\/512x384.jpg","width":"750","height":"400"},{"id":"23414","title":"World Cup Penalty Shootout","description":"The World Cup is here now and it’s time to play World Cup Penalty Shootout. Pick your team and play against the rest of the world in this amazing soccer game. World Cup Penalty Shootout has four game modes: Targets, Time Attack, Wall, and Shootout. You can also buy some power-ups to get extra power, extra curve, or a nice score multiplier. Play World Cup Penalty Shootout now and enjoy the fun of scoring lots of goals!","instructions":"- Over 12 teams to choose from - 4 game modes - 3 different power-ups - Intuitive gameplay - Great graphics ","url":"https:\/\/html5.gamemonetize.com\/u2hymlhew0h5h8ba0fy1voy0y9lf17zb\/","category":"Stickman","tags":"Football, Soccer, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/u2hymlhew0h5h8ba0fy1voy0y9lf17zb\/512x384.jpg","width":"800","height":"600"},{"id":"23119","title":"Stickman Shooter 3 Among Monsters","description":"Stickman shooter 3 is back!! The amons us zombies and monsters are attacking the fort and its time to destroy everything again. Be ready for the exciting stickman shooting game. Defend the base against many types of among monsters and dont let reach the base. Improve the parameters of the weapon - accuracy, speed of fire and reload, the number of bullets in the magazine to destroy more powerfull enemies. Survive all levels and be the best stickman soldier.","instructions":"Controls Use the mouse to aim and shootTouch the screen on mobile devices","url":"https:\/\/html5.gamemonetize.com\/2lr8r7zgvsgccdenhk1a62oeuzzz5lqe\/","category":"Stickman","tags":"Action, Defense, Shooter, Stickman","thumb":"https:\/\/img.gamemonetize.com\/2lr8r7zgvsgccdenhk1a62oeuzzz5lqe\/512x384.jpg","width":"800","height":"600"},{"id":"19959","title":"Stickman Climb","description":"You are in charge of a stickman in a box with a pickaxe in its hand, and your objective is to reach the flag at the finish line of every level using the balancing powers of your strong arms and mighty pickaxe! The road to victory is paved with deadly spikes, so utilize every checkpoint to keep your progress. Use the laws of physics to your advantage and you will master this game in no time. Reach the pinnacle of fun with Stickman Climb!","instructions":"Use your axe to move around the stage Move - Left Right arrow keys ","url":"https:\/\/html5.gamemonetize.com\/p119i9rb086uekl7rfh6alonr8o2dyj2\/","category":"Stickman","tags":"Clicker, New, Skills, Stickman","thumb":"https:\/\/img.gamemonetize.com\/p119i9rb086uekl7rfh6alonr8o2dyj2\/512x384.jpg","width":"800","height":"600"},{"id":"22780","title":"Archer Peerless.io","description":"Archer Peerless.io is a Stickman shooting game with different characters including among us and dragonball. Choose your Team Archers and begin the war against enemies. Aim and shoot at the right moment to destroy your enemies. Tap the Shop button and choose you outfits and weapons. Have fun","instructions":"aim to shoot","url":"https:\/\/html5.gamemonetize.com\/m1pic4ayty2tp1p2uyatyrx1e9uesgsg\/","category":"Stickman","tags":".io, .io Games, Action, Adventure, Best, Hot, Hypercasual, Shoot 'Em Up, Shooter, Shooting, Stickman, Strategy","thumb":"https:\/\/img.gamemonetize.com\/m1pic4ayty2tp1p2uyatyrx1e9uesgsg\/512x384.jpg","width":"800","height":"600"},{"id":"22841","title":"Crowd Pull Rope","description":"Control your Crowd and pull all things to your side. Use helpers to help you beat your enemies. Slide right and left to control running people. Avoid obstacles to pull things faster. Good luck","instructions":"swipe right and left","url":"https:\/\/html5.gamemonetize.com\/1mhi67ozg4ycdxwtnr6vpzs46h5caez4\/","category":"Stickman","tags":".io, .io Games, 3D, Action, Best, Hot, HTML5, Hypercasual, Physics","thumb":"https:\/\/img.gamemonetize.com\/1mhi67ozg4ycdxwtnr6vpzs46h5caez4\/512x384.jpg","width":"800","height":"600"},{"id":"17105","title":"Hulk Smash Breaker wall","description":"Welcome to the incredible monster hero fighting city mission of 2021. The concept of this game very unique in which you fight with Super Green monsters as a superhero to save the city from crime enemy hero's games. Unbelievable Green monsters are still ready to destroy the city and spread their terror. The Green Monster thrilling game will show you a brand new amazing city environment, where you battle with the other Different Super monsters in Super hero games. This superhero monster gameplay is specially designed for crazy incredible monsters fighting lovers and green hero games. Here you can see 10 thrilling monster heroes and 15 exciting levels that make you a powerful Incredible monster In Super Hero Games 2021. This Incredible Monster City Hero Battle Mission 2021 have beautiful HD graphics you will see and absorb by playing amaze the gaming features. Incredible Monster City Hero Battle Mission 2021 Huge monster or big man game is full of fun to play with incredible monster hero smashing powers. Incredible Monster City Hero Battle Mission 2021 there is a free mode and mission mode where you will search and fight like a hero monster and complete all the missions get coins to unlock all your favorite incredible monsters and levels in Incredible Monster Superhero City Battle & New Superhero Monster Games 3d 2021.","instructions":"Use Mouse To Play and Follow introduction ","url":"https:\/\/html5.gamemonetize.com\/6e72e041n8nq1biykx2m0ywjte2so8nu\/","category":"Stickman","tags":".io Games, Action, Adventure, Anime, Arcade, Best, Boys, Cartoon, Fun, Girls, HTML5, Kids, Mobile, Super, Superhero","thumb":"https:\/\/img.gamemonetize.com\/6e72e041n8nq1biykx2m0ywjte2so8nu\/512x384.jpg","width":"800","height":"600"},{"id":"22488","title":"Stickman Shadow Hero","description":"Play stickman hero robbing superhero gangster crime city. Tie your shoelaces to become the stickman hero in gangster city. Play as a flying stickman in adventurous superhero game. Mafia city need you to tear apart monsters by fighting gangster mafia in flying superhero game. Become a flying hero in a criminal city of gangsters and fight the murderers for the peace of the locality. Take the challenge as a real stickman hero in gangster mafia and take the lead by eliminating the monster from superhero game.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/vo752qw0gt9a77j0e8sfkm5wso4vun4d\/","category":"Stickman","tags":"Action, Hypercasual, Stickman","thumb":"https:\/\/img.gamemonetize.com\/vo752qw0gt9a77j0e8sfkm5wso4vun4d\/512x384.jpg","width":"800","height":"600"},{"id":"21850","title":"My dolphin show - game","description":"DRESS UP YOUR DOLPHIN! Collect coins as you swim and dive in the pool, and use them to buy new stuff. Have you ever seen a dolphin dressed as a princess, or a cheerleader? How about a fairy, or a bride? There are tons of gorgeous outfits you can choose from to make your new dolphin BFF look fabulous. You can even pick new animals and characters, such as an orca, shark, mermaid, or even a unicorn! With more than 40 options to choose from, you’ll have endless fun!","instructions":"This game for girls and boys of all ages is free to play So are you ready to wow audiences worldwide with the tricks you ve taught your favorite animal Dive straight in ","url":"https:\/\/html5.gamemonetize.com\/30xan59o1vddqirxpux9732ovug7z5az\/","category":"Stickman","tags":".io Games, Game, Games, Hypercasual","thumb":"https:\/\/img.gamemonetize.com\/30xan59o1vddqirxpux9732ovug7z5az\/512x384.jpg","width":"800","height":"600"},{"id":"20070","title":"Stickman Escape Parkour","description":"Scientists produce racers with special abilities to use in running races. Get out of the lab with these racers! There will be many difficult obstacles. Master these obstacles and reach the portal.","instructions":"Player 1 W Player 2 SPACE Player 3 M Player 4 UP ARROW","url":"https:\/\/html5.gamemonetize.com\/ts7y4ik94if0lj7khxbt147a4oihslcl\/","category":"Stickman","tags":"Action, Adventure, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ts7y4ik94if0lj7khxbt147a4oihslcl\/512x384.jpg","width":"800","height":"450"},{"id":"22029","title":"Shadow Archers","description":"Play as the legendary Shadow bow master. Defend yourself and destroy enemies with your bow before they destroy you. If you are a fan of archery games, then this casual game is definitely for you. Choose your game mode from the list of leveld and defend your honor in our casual game!","instructions":"aim to shoot","url":"https:\/\/html5.gamemonetize.com\/4t5ud1unv0v4z6o106i7dk2xrck4prir\/","category":"Stickman","tags":"Bow, Casual, HTML5, Shoot 'Em Up, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/4t5ud1unv0v4z6o106i7dk2xrck4prir\/512x384.jpg","width":"800","height":"600"},{"id":"21719","title":"Bubble Shooter - puzzle","description":"Put your strategy skills to the test! Compete against friends and family and see who can reach the highest score and get 3 stars on every level. Earn coins while you play and use them to get cool boosters. Use your logic and puzzle-solving skills to complete the missions and clear the board, and make sure to collect special daily bonuses.","instructions":"Try the Puzzle Game Mode and Discover the Ultimate Bubble Popping Fun This shooter is a thrilling balloon popper free app with thousands of challenging puzzles to master Shoot the colorful balls to advance to the next amazing puzzle level train","url":"https:\/\/html5.gamemonetize.com\/6lfjdkrujhim8t417hsjv8r9a18f9yfo\/","category":"Stickman","tags":"Bubble Shooter, Game, Games, Puzzle, Shoot, Shooter, Shooting","thumb":"https:\/\/img.gamemonetize.com\/6lfjdkrujhim8t417hsjv8r9a18f9yfo\/512x384.jpg","width":"800","height":"600"},{"id":"21637","title":"Punch Hero Master","description":"Are you ready for the adventure full of punches and tricks? Rocket Punch! Yes, that’s the name of our game! You have the chance to throw punches like you’ve never done before! Punch the enemies and knock them out! Solve the puzzling challenges. Have a look at your surroundings, take advantage of the weapons available so you can kill your enemies at the same time. Break through the wall, dig into the ground, blow up the bomb, do whatever you can to have the enemies defeated. You have so many gloves to be revealed to use against enemies and you don’t want to miss out any single level. Relieve your stress through our punching games. Throw out some curvy punches at those people who annoy you most.","instructions":"mouse","url":"https:\/\/html5.gamemonetize.com\/dk4tz5fcurlt6jecq2m478kmuqbnn4zs\/","category":"Stickman","tags":"Casual, Fight, Hypercasual, Punch, Stickman","thumb":"https:\/\/img.gamemonetize.com\/dk4tz5fcurlt6jecq2m478kmuqbnn4zs\/512x384.jpg","width":"720","height":"1280"},{"id":"21512","title":"Ninja Stick","description":"Ninja Stick is a GREAT game that helps learning mesurement, training your brain to track measurements, sizes and distances.","instructions":"The gameplay is easy use your ninja ladder to cross from platform to platform holding tapping and holding will make a larger ladder and upon release the NINJA STICK will try to cross to meet his destiny ","url":"https:\/\/html5.gamemonetize.com\/ug562lbaywh1th7dwbek2qaxu3hybyal\/","category":"Stickman","tags":"Adventure, jump, Jumping, Ninja, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ug562lbaywh1th7dwbek2qaxu3hybyal\/512x384.jpg","width":"800","height":"600"},{"id":"21636","title":"Stickman Peacekeeper","description":"The main goal of the hero is to kill numerous enemies that attack him, for this, he can use bombs and shoot at them from various weapons. In each subsequent level, you can use a lot of weapons that will help you easily move from level to level without losing your standard of living, which you can see at the bottom of the screen.","instructions":"The more enemies you defeat the more coins you get for it These coins you can spend on improving your weapons ","url":"https:\/\/html5.gamemonetize.com\/xfw5cdy6ksg3r0z9wd54iiyw731mx565\/","category":"Stickman","tags":"Action, Adventure, Fight, Fighting, Gun, H5, HTML, HTML5, Kill, Killing, Stickman","thumb":"https:\/\/img.gamemonetize.com\/xfw5cdy6ksg3r0z9wd54iiyw731mx565\/512x384.jpg","width":"800","height":"600"},{"id":"21357","title":"Mr Stickman","description":"Mr Stickman is a crazy shooting Game. Aim and shoot all your enemies. Explore tons of challenging levels and try to complete them all. Have fun and don't waste your bullets","instructions":"aim to shoot","url":"https:\/\/html5.gamemonetize.com\/jndurw3pmdos9ehy9ca8jmwepxlkh0ja\/","category":"Stickman","tags":"HTML, HTML5, Hypercasual, Shoot, Shooter, Shooting, Sniper, Stickman, weapons","thumb":"https:\/\/img.gamemonetize.com\/jndurw3pmdos9ehy9ca8jmwepxlkh0ja\/512x384.jpg","width":"800","height":"600"},{"id":"21332","title":"Stickman Street Fight","description":"Stickman: Street battle is a rather unusual fighting game in which control is carried out with only two buttons. To pass the level you need to kill all opponents by simply pressing the hit button in time. In between fights, you can improve the main character and his abilities.","instructions":"To pass the level you need to kill all opponents by simply pressing the hit button in time ","url":"https:\/\/html5.gamemonetize.com\/vnl2say6v42wgl1g140h0j9a8aiawe8o\/","category":"Stickman","tags":"Action, Adventure, Arcade, Fight, Fighting, HTML, HTML5, Hypercasual, Kill, Killing, Stickman, Super, Superhero","thumb":"https:\/\/img.gamemonetize.com\/vnl2say6v42wgl1g140h0j9a8aiawe8o\/512x384.jpg","width":"800","height":"600"},{"id":"21333","title":"Stickman Archer 4","description":"Another stickman game in which the player has three game modes. In the first, you need to shoot from a bow at moving and static targets, having a limited number of arrows in stock, in the second mode you will have a duel with another stickman, and in the third you will have to clear a multi-storey building, but using not a bow with arrows, but the most ordinary one gun. In each of the three modes, you have to collect emeralds, this is a currency that can be exchanged for new weapons and skins.","instructions":"You need to shoot from a bow at moving and static targets ","url":"https:\/\/html5.gamemonetize.com\/ygn25doepay8cbhkuqr2wg9xwr9rnyxm\/","category":"Stickman","tags":"Action, Adventure, Arcade, Bow, Fight, Fighting, HTML, HTML5, Hypercasual, Kill, Killing, Stickman, Superhero","thumb":"https:\/\/img.gamemonetize.com\/ygn25doepay8cbhkuqr2wg9xwr9rnyxm\/512x384.jpg","width":"800","height":"600"},{"id":"21016","title":"Sniper Trigger Revenge","description":"Stickman: Snipers Revenge is a small puzzle game. Your task is to kill all opponents with limited ammunition in stock and collect all the stars. The difficulty is that it is not always easy to reach the enemy, you will have to use the ricochet and surrounding objects to achieve the main goal. Also, your hero will receive money for completing levels, which will allow you to buy weapons and skins.","instructions":"kill all opponents with limited ammunition in stock and collect all the stars ","url":"https:\/\/html5.gamemonetize.com\/ypkr83xou762l59mbcuopkxrhwwwulcl\/","category":"Stickman","tags":"Action, Adventure, Arcade, Fight, Fighting, Gun, HTML, HTML5, Hypercasual, Kill, Killing, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ypkr83xou762l59mbcuopkxrhwwwulcl\/512x384.jpg","width":"800","height":"600"},{"id":"21196","title":"Funny Ragdoll Wrestlers","description":"A super fun Ragdoll fighting game is beginning with the Funny Ragdoll Wrestlers game! The game is either played as a single player or two player. That's why what about calling a friend for a two player gaming before starting the game? In each fight, the one who scores 5 wins the game.","instructions":"Player 1 Forward Backward W S Punch A D Head hit E Player 2 Forward Backward UP and DOWN ARROW KEYS Punch LEFT and RIGHT ARROW KEYS Head hit RIGHT SHIFT ","url":"https:\/\/html5.gamemonetize.com\/jds5fxchg40of8edr3ho3qhwpo703p9x\/","category":"Stickman","tags":"2 Player, 2 Player Games, Balance, Boxing, Fight, Fighting, Fun, Funny, Stickman","thumb":"https:\/\/img.gamemonetize.com\/jds5fxchg40of8edr3ho3qhwpo703p9x\/512x384.jpg","width":"800","height":"450"},{"id":"21096","title":"Stickman Gun Battle Simulator","description":"Stickman Gun Battle Simulator is a fun stickman tower defense game. The stickman world is at war! In this game, you have to use your army to destroy the enemy. Become the ultimate stickman commander! - Strategic tower defense gameplay - Build a stickman army - Melee weapons, pistols, machine guns and sci-fi weapons","instructions":"use the mouse ","url":"https:\/\/html5.gamemonetize.com\/vty93a9n4siz0l29etq402p3ktq5zmdj\/","category":"Stickman","tags":"Alien, Battle, Casual, Fantasy, Fighting, Shooting, Sim, Simulation, Stickman, Strategy, Unity3D, Violence","thumb":"https:\/\/img.gamemonetize.com\/vty93a9n4siz0l29etq402p3ktq5zmdj\/512x384.jpg","width":"800","height":"500"},{"id":"20703","title":"Stickman Merge 2","description":"Combine weapons in the action game \"Stickman: Weapon Combination\" and create more powerful guns, and then go to the shooting range against enemy stickmen. Prepare your arsenal, upgrade your pistol, collect all bonuses and become the best shooter in the city. How powerful can you create a weapon in the fight against enemies? Stay here to find out!","instructions":"Control in the game Stickman Weapon Combination on the computer is carried out with the mouse and on the touch screens with the help of taps The goal of Stick Merge is to combine different types of weapons to create more powerful cannons and ultimat","url":"https:\/\/html5.gamemonetize.com\/0enartbxbeoct0y3pt4c3ffy1v5gks1l\/","category":"Stickman","tags":"Gun, Shoot, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/0enartbxbeoct0y3pt4c3ffy1v5gks1l\/512x384.jpg","width":"800","height":"600"},{"id":"20947","title":"Stickman Jigsaw","description":"Stickman Jigsaw is a free online puzzle game. Drag the pieces into right position using mouse. Solving puzzles is relaxing, rewarding, and keeps your brain sharp. You must solve the first picture and win over $1,000 in order to be able to purchase one of the following pictures. You have three modes for each picture from which the hardest mode brings more money. You have a total of 10 pictures.","instructions":"Use mouse or touch the screen ","url":"https:\/\/html5.gamemonetize.com\/fwbs1xo9ta2w0bafkkfppcnds3eq1mns\/","category":"Stickman","tags":"Arcade, Fun, Hypercasual, Jigsaw, Kids, Mobile, Skill","thumb":"https:\/\/img.gamemonetize.com\/fwbs1xo9ta2w0bafkkfppcnds3eq1mns\/512x384.jpg","width":"1280","height":"900"},{"id":"20970","title":"Stickman Tower Defender","description":"Face countless challenging tower defense battles & taste hard earned victory as you shoot enemies. Aim and release the arrow and get a head-shot. Let's have fun","instructions":"aim to shoot","url":"https:\/\/html5.gamemonetize.com\/gtaprsmat7o4o6vkg3unma7vxbw1w7dg\/","category":"Stickman","tags":"3D, 3D Games, Battle, Stickman, Tower Defense, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/gtaprsmat7o4o6vkg3unma7vxbw1w7dg\/512x384.jpg","width":"800","height":"600"},{"id":"21054","title":"Wheelie Ride","description":"Bicycle ride is a simple physics based game make wheels on a BMX bike. The game is to prepare a mechanical bike. The constant horizontal impulse pushes him towards right.","instructions":"Use mouse or touch screen to movie the wheelie ","url":"https:\/\/html5.gamemonetize.com\/brupr143ni1os34nbmk1bgobvwxfpcwv\/","category":"Stickman","tags":"1 Player, 2D, Casual, Hypercasual, Physics, Stickman","thumb":"https:\/\/img.gamemonetize.com\/brupr143ni1os34nbmk1bgobvwxfpcwv\/512x384.jpg","width":"1500","height":"900"},{"id":"21027","title":"Stick Fight The Game","description":"Stick Fight is really easy to play Just aim and tap to release the arrows to kill all enemies and protect your Castle. Use the Arrows boster button to drop Arrows Rain. Let's Shoot All enemies","instructions":"aim and shoot","url":"https:\/\/html5.gamemonetize.com\/hqjf5yakd0qajttjzydupbno3illn68t\/","category":"Stickman","tags":"Action, Adventure, Arcade, Gun, HTML, HTML5, Hypercasual, Kill, Killing, Puzzle, Shooting, Stickman, Street Fighting, War","thumb":"https:\/\/img.gamemonetize.com\/hqjf5yakd0qajttjzydupbno3illn68t\/512x384.jpg","width":"800","height":"600"},{"id":"20971","title":"Stickman Master Bow","description":"Be an Archer Hero (Arc-hero) and join the battle. Fight enemies, shoot 'em up and become an archer legend.","instructions":" Drag and Release the Bow to aim and shoot arrow","url":"https:\/\/html5.gamemonetize.com\/vwygeka3gdnm5ij3rg2801ghy1nutq1y\/","category":"Stickman","tags":"Action, Adventure, Arcade, Bow, Fight, Fighting, HTML, HTML5, Hypercasual, Kill, Killing, Puzzle, Strategy, Street Fighting, Superhero","thumb":"https:\/\/img.gamemonetize.com\/vwygeka3gdnm5ij3rg2801ghy1nutq1y\/512x384.jpg","width":"800","height":"600"},{"id":"20852","title":"Stickman Team Force 2","description":"A new Adventure begins in DobCorp Special ces called Stickman Team Force are recruited to bring order to the world, where an organization with high technology wants to take over the streets of the world helps to end the threat and become a leader.","instructions":"z or Click to Shoot c Change Hero Space to Special","url":"https:\/\/html5.gamemonetize.com\/3pai69edhoh1b0df21v1nblimkrwpdw7\/","category":"Stickman","tags":"Action, Adventure, Arcade, Fight, Fighting, Gun, HTML, HTML5, Hypercasual, Kill, Killing, Puzzle, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/3pai69edhoh1b0df21v1nblimkrwpdw7\/512x384.jpg","width":"800","height":"600"},{"id":"20267","title":"STICKMAN BOXING KO CHAMPIAN","description":"You like boxing games and stickman games? This game is made for you! Enter the ring and play as an heroic Stickman Boxer. This new boxing game is available for all stickman fans! Fight 4 professionals in intense combat. Fight using a variety of devastating punches and combos. Jab, cross, uppercut, give in all you have, but don’t forget to dodge!.","instructions":"Fight using a variety of devastating punches and combos ","url":"https:\/\/html5.gamemonetize.com\/3xilpgzu6khthlqjug0ldfp7ley5mh1p\/","category":"Stickman","tags":"3D, Action, Arcade, Boxing, Fight, Fighting, HTML, HTML5, Stickman","thumb":"https:\/\/img.gamemonetize.com\/3xilpgzu6khthlqjug0ldfp7ley5mh1p\/512x384.jpg","width":"800","height":"600"},{"id":"20115","title":"Stickdoll 2 : Revenge Of Flame","description":"The sequel to stickdoll God Of Archery, this game is about the Fire Kingdom's desire to regain its power with Flame. Flame is planning to collect 5 elemental stones and kneel everyone.Combining the main element stone and other stones on the black magic book will now be invincible. But in this adventure, Gargle betrays him and steals the main element stone, and he goes after the 5 element stones. This is how the adventure begins. In each episode, the guardians of the kingdoms, the guardians of the stones, and challenging platforms await Flame.","instructions":"Use Space to attack Use the Arrow Keys to jump and move ","url":"https:\/\/html5.gamemonetize.com\/qdjanxft2zdc9plo553j6jirnoat1ahs\/","category":"Stickman","tags":"Action, Adventure, Hypercasual, Platform, Stickman","thumb":"https:\/\/img.gamemonetize.com\/qdjanxft2zdc9plo553j6jirnoat1ahs\/512x384.jpg","width":"1280","height":"720"},{"id":"19891","title":"Tie Dying Cloths 3D","description":"Live the hottest fashion summer trend! Tie Dye summer clothes and beach accessories! T-shirts, bikinis, beach bags... you name it! Show off your creative DIY art skills while customizing the Tie Dye clothes to your liking. Get requests from clients and paint clothes to your desire. Being creative isn’t hard: first tie, then dye! Unleash your DIY art skills and let the paint do the work! Let the summer fun begin! How to Play MR Spy 3D Game : Tap to Aim Shoot - Its Super Bullet Time Shoot Best Sniper Spy Shot Fire your sniper gun and be smart be Crazy","instructions":"Just Tie and Dye the Cloths Make Unique Styles ","url":"https:\/\/html5.gamemonetize.com\/tppncb7t3ityie5tx4je7dk33tk376b0\/","category":"Stickman","tags":"Arcade, Army, Hypercasual, Shoot, Shooter, Shooting, Space, Stickman","thumb":"https:\/\/img.gamemonetize.com\/tppncb7t3ityie5tx4je7dk33tk376b0\/512x384.jpg","width":"400","height":"600"},{"id":"19648","title":"Gumball Swing Out","description":"In the crazy world of Gumball everything is possible, like having to swing in an empty space to jump from mound to mound, trying to make the jumper land just above the flag, and take into account its weight and other characteristics such as wind and mood of the beans.","instructions":"Simple gameplay with efficient and easy to learn controls ","url":"https:\/\/html5.gamemonetize.com\/es1gzxzgbul2hy9w2d468rewxoslng11\/","category":"Stickman","tags":"Boys, Cartoon, Cartoon Network, Girls, Kids, Stickman, Sword","thumb":"https:\/\/img.gamemonetize.com\/es1gzxzgbul2hy9w2d468rewxoslng11\/512x384.jpg","width":"600","height":"360"},{"id":"18508","title":"Stickman Fighter Training Camp-3","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/h1pritb3t20xlv5v0qdzqrwb6g1u0evi\/","category":"Stickman","tags":".io, 2D, 3D, Action, Adventure, Animal, Anime, Arcade, Army, Baby, Balance, Ball, Ballon, Barbie, Ben 10, Bike, Bomb, Bounce, Boy, Boys, Bubble, Bubble Shooter, bus, Cake, Car, Cars, Cartoon, Cartoon Network, Cat, city, Classic, Color, Coloring, Crazy, Defense, Design, Dora, Dragon, Dragon Ball Z, Draw, Dress Up, Driving, Family, Fashion, Fight, Fighting, Fire, Flight, Football, Funny, Game, Games, Girl, Girls, gta, Gun, Hello Kitty, hockey, Kid, Kids, Kill, Killing, Love, Mario, Memory, Minion, Monster, Moto, Ninjago","thumb":"https:\/\/img.gamemonetize.com\/h1pritb3t20xlv5v0qdzqrwb6g1u0evi\/512x384.jpg","width":"800","height":"600"},{"id":"18506","title":"Stickman Fighter Mega","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/922kbpt19j0uxvfelvhp10dlrxc1m8ev\/","category":"Stickman","tags":".io, 2D, 3D, Action, Adventure, Animal, Anime, Arcade, Army, Balance, Ballon, Barbie, Ben 10, Bike, Bomb, Bounce, Boy, Boys, Bubble, Bubble Shooter, bus, Cake, Car, Cars, Cartoon, Cartoon Network, Cat, Christmas, city, Classic, Color, Coloring, Crazy, Defense, Design, Dragon, Dragon Ball Z, Draw, Dress Up, Driving, Family, Fight, Fighting, Fire, Flight, Football, Fun, Funny, Game, Games, Girl, gta, Gun, jump, Jumping, Kid, Kids, Kill, Killing, Love, Mario, Memory, Minecraft, Minion, Monster, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/922kbpt19j0uxvfelvhp10dlrxc1m8ev\/512x384.jpg","width":"800","height":"600"},{"id":"18515","title":"Stickman maverick","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/jgay8b10x9uu5q5svqcf9qnky5dipex9\/","category":"Stickman","tags":".io, 2D, 3D, Action, Adventure, Animal, Anime, Arcade, Army, Baby, Balance, Ball, Ballon, Barbie, Ben 10, Bike, Bomb, Boy, Boys, Bubble, Bubble Shooter, bus, Cake, Car, Cars, Cartoon, Cat, city, Classic, Coloring, Crazy, Defense, Dragon, Dragon Ball Z, Draw, Dress Up, Driving, Family, Fashion, Fight, Fighting, Fire, Flight, Funny, Game, Games, Girl, Girls, gta, Gun, Kid, Kids, Kill, Killing, Mario, Memory, Minion, Monster, Moto, Ninjago, run, running, Shoot, Shoot 'Em Up, Shooter, Shooting, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/jgay8b10x9uu5q5svqcf9qnky5dipex9\/512x384.jpg","width":"800","height":"600"},{"id":"18519","title":"StickMan Run 2","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/756x6uxjzr8tcd9fww1lts0b6s2aanri\/","category":"Stickman","tags":".io, 2D, 3D, Action, Adventure, Animal, Anime, Arcade, Army, Baby, Balance, Ball, Ballon, Barbie, Ben 10, Bike, Bomb, Bounce, Boy, Boys, Bubble, bus, Cake, Car, Cars, Cartoon, Cartoon Network, Cat, city, Classic, Color, Coloring, Crazy, Defense, Dora, Dragon, Dragon Ball Z, Draw, Dress Up, Driving, Fashion, Fight, Fighting, Fire, Flight, Football, Fun, Funny, Game, Games, gta, jump, Jumping, Kid, Kids, Kill, Killing, Mario, Memory, Minion, Monster, Moto, run, running, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/756x6uxjzr8tcd9fww1lts0b6s2aanri\/512x384.jpg","width":"800","height":"600"},{"id":"18303","title":"Parkour","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/ixoaeytmcwqaztblvfervx39mtqq9l8r\/","category":"Stickman","tags":".io, 2D, 3D, 8 Ball Pool, Action, Animal, Anime, Arcade, Army, Baby, Baby Hazel, Ball, Ballon, Barbie, Battle, Ben 10, Bike, Blood, Bounce, Boy, Boys, Bubble, Bubble Shooter, bus, Cake, Car, Cars, Cartoon, Cartoon Network, Cat, city, Classic, Color, Crazy, cut, Defense, Disney, Dragon, Dragon Ball Z, Draw, Dress Up, Driving, Fighting, Fire, fly, Game, Girl, Girls, gta, Gun, Hair, jump, Jumping, Kids, Kill, Killing, Magic, Miner, Monkey, Monster, Ninja, Online, PacMan, Police, Race, Racing, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/ixoaeytmcwqaztblvfervx39mtqq9l8r\/512x384.jpg","width":"800","height":"600"},{"id":"17717","title":"Subway Batman Runner","description":"subway Batman Runner for FREE and play the most addictive mobile game ever created! Your objective is to guide Batman along the road and let him jump over the obstacles to avoid hitting them and also avoid being arrested by enemies to score the highest possible score. This is an endless running and jumping game which means you can play as long as you don’t die.","instructions":"Use Mouse Or keyboard To Play","url":"https:\/\/html5.gamemonetize.com\/fas9ohzwnmddmffkzex9u7joujpdaq4q\/","category":"Stickman","tags":"Batman, Boys, Game, Girls, run, running, Shoot, subway, Subway Surfers","thumb":"https:\/\/img.gamemonetize.com\/fas9ohzwnmddmffkzex9u7joujpdaq4q\/512x384.jpg","width":"960","height":"600"},{"id":"19336","title":"Drunken Tug War","description":"The Drunken game series continues with Tug War in its new episode. The aim of the game is to pull the rope as fast as possible and pull your opponent to your side. The green radioactive area in the middle eliminates players. Each time you touch this area, your health bar will drop. Press the keys as fast as you can and pull the opponent.","instructions":"Player 1 W or Touch the screen Player 2 UP ARROW or Touch the screen","url":"https:\/\/html5.gamemonetize.com\/oqtprbfdn87x5o76wavykkrgqewfon3c\/","category":"Stickman","tags":"1 Player, 2 Player, 2 Player Games, Balance, Battle, Fun, Funny, Retro, War","thumb":"https:\/\/img.gamemonetize.com\/oqtprbfdn87x5o76wavykkrgqewfon3c\/512x384.jpg","width":"800","height":"431"},{"id":"18505","title":"Stickman War 2022","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/39cxr2krgimc51vbjdzt24dsf9aefcaj\/","category":"Stickman","tags":".io, 2D, 3D, Action, Adventure, Animal, Anime, Arcade, Army, Baby, Balance, Ball, Ballon, Ben 10, Bike, Bomb, Bounce, Boy, Boys, Bubble, Bubble Shooter, bus, Cake, Car, Cars, Cartoon, Cartoon Network, Cat, city, Classic, Color, Coloring, Crazy, Defense, Design, Dragon, Dragon Ball Z, Draw, Dress Up, Driving, Family, Fashion, Fight, Fighting, Fire, Flight, Football, Funny, Game, Games, gta, Gun, Kid, Kids, Kill, Killing, Love, Mario, Memory, Minion, Monster, Moto, Ninjago, run, running, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/39cxr2krgimc51vbjdzt24dsf9aefcaj\/512x384.jpg","width":"800","height":"600"},{"id":"18829","title":"SrickMan Light It Up","description":"Get ready light it up to jump, flip, light-it up and Neon!!! Light it Up Game is beautifully designed and made with love! Swing, jump, flip and slide your stickman body from one neon color shape to another to make them glow and light-it up. Collect stars as you swing, jump and flip to raise your score and next level, in the funnest of all jumping games. You are color slime in the dark world and have only mission to light up shapes by jumping up from this one to another. We call it is color jump and light game.","instructions":"Mouse Left Click","url":"https:\/\/html5.gamemonetize.com\/2xz68iinajvcvg22u7eqxh0ts73i81ib\/","category":"Stickman","tags":".io Games, 1 Player, Stickman","thumb":"https:\/\/img.gamemonetize.com\/2xz68iinajvcvg22u7eqxh0ts73i81ib\/512x384.jpg","width":"600","height":"900"},{"id":"18176","title":"Sandman Pixel Race 3D","description":"Sandman Pixel Race 3D: Imposter Pixel 3d Man Run Game is a satisfying and entertaining running game, you will enjoy collecting the color boxes in order to use them to get shortcuts to win the race. Become the sand rush master among your friends and enjoy the Imposter run game. Stack the different colors and reach the finish line of the game. Beware of the obstacles facing you during this fun race 3d game. The race line is tricky! Are you ready to win the rush game?","instructions":" Collect the color boxes as much as you can Use these boxes to get shortcuts Control where to put the boxes","url":"https:\/\/html5.gamemonetize.com\/cnx942poptycuevtr2xb14kgecsv64ej\/","category":"Stickman","tags":"3D, Arcade, Color, Coloring, Game, Hypercasual, Online, Pixel, Race, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/cnx942poptycuevtr2xb14kgecsv64ej\/512x384.jpg","width":"400","height":"600"},{"id":"18229","title":"Fail Minecraft Runner","description":"Learn to walk before you run and Minecraft across the finish line. Put one leg in front of the other and try not to fail","instructions":"Tap on time perfectly and reach destination","url":"https:\/\/html5.gamemonetize.com\/0lhw388c6jm1nlfk6yyoe49bg0oobikc\/","category":"Stickman","tags":"Arcade, Casual, Hypercasual, Mine, Minecraft, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/0lhw388c6jm1nlfk6yyoe49bg0oobikc\/512x384.jpg","width":"400","height":"600"},{"id":"18173","title":"stickmen Color Run Switch","description":"Welcome to the Stickman Run! Colorful game that will keep you on your toes till the very end! Grow, Fight, and Win! Switch the Crowd in Colors Have Fun , Best Crowd Run Game - Run in Same Color Crowd and grow as a Big like Giant and Fight win the mission.","instructions":" Swipe to play - Giant Run 3D - Crowd Battle Run Run in Same color and Collect Crowd and Grow like Big Stickman and get more Strength and Power to Win the Flight against Opponent Crowd Battle Run","url":"https:\/\/html5.gamemonetize.com\/rrsnhq3gqodf0rfc59mbxu6hyqg7ls8c\/","category":"Stickman","tags":"3D, Color, Games, Online, run, running, Stickman, Sword","thumb":"https:\/\/img.gamemonetize.com\/rrsnhq3gqodf0rfc59mbxu6hyqg7ls8c\/512x384.jpg","width":"400","height":"600"},{"id":"18118","title":"Stickman Race","description":"Stickman Race 3D is New Race 3D Game with Opponent Stickman Players , Run , Jump, Race, Perform Stunts to Won the Race with Stickman Never stop running! Jump and flip over obstacles, climb over ladder, swim in the pool , Stunts and make sure you avoid all the obstacles and reach the finish line safely.","instructions":"Hold to run release to stop Stickman Games","url":"https:\/\/html5.gamemonetize.com\/1hyp6oziicdyk81dfw2g83xx95x7h29i\/","category":"Stickman","tags":"3D, Casual, Game, Hypercasual, jump, Jumping, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/1hyp6oziicdyk81dfw2g83xx95x7h29i\/512x384.jpg","width":"400","height":"600"},{"id":"17892","title":"Rope Slash : Bow Master","description":"Welcome to the most addictive and fun bow and arrow game you’ve ever played on your Android device. Rope Slash is a free arrow shooting game in which you should cut the ropes by shooting arrows while avoid hitting the hanging men. So, if you are looking for a time killer shooting app to challenge your cut rope archery skills and improve your concentration skills, download Rope Slash for free on your Android device and see how many hanged men you can save by shooting the ropes accurately.","instructions":"Cut Rope main features at a glance Addictive bow and arrow shooting game Endless challenges with different levels of difficulties More than 50 unique levels with constant updates Easy to learn gameplay yet hard to master ","url":"https:\/\/html5.gamemonetize.com\/osp9n3muabru79fygq1l2wu1ngjorp2f\/","category":"Stickman","tags":"Action, Bow, HTML5, Mobile, Shooting","thumb":"https:\/\/img.gamemonetize.com\/osp9n3muabru79fygq1l2wu1ngjorp2f\/512x384.jpg","width":"800","height":"600"},{"id":"6263","title":"Stickman Counter Terror Shooter","description":"Counter terrorist ( swat ) stickmen launch a strike on terror stick forces The terrorist stickman team is in a shooting battle with the swat ( counter terrorist ) stickmen. Become an elite stickman shooter: - Use your main gun (m16, shogun, ak47, machine gun), pistol to launch an assault on the enemy stickman team and strike them where it hurts. - Control the stickman and shoot from a first person ( fps ) perspective. - The game has 2 stickman teams: red ( terror) and blue ( counter terror) - you can play it offline with no internet!","instructions":"WASD - move strafe Arrows - move rotate Mouse - rotate shoot SPACE - shoot F - Grenade P - Pause T - Toggle mobile controls On Off","url":"https:\/\/html5.gamemonetize.com\/yo64nft072vj0fhpg3ft42uvjgtrrxrq\/","category":"Stickman","tags":"3D, 3D Games, Arena, Multiplayer, Online, Shoot, Shooter, Shooting, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/yo64nft072vj0fhpg3ft42uvjgtrrxrq\/512x384.jpg","width":"800","height":"600"},{"id":"17796","title":"Army Stick Soldier","description":"A game in which you are a soldier and you have to run through a path full of obstacles using your stick !","instructions":"Use Mouse Or keyboard To Play","url":"https:\/\/html5.gamemonetize.com\/boinh33lamjqvj38r8e7zbt1qmmwo2e0\/","category":"Stickman","tags":"Army, Game, Online, Solitaire, Stickman","thumb":"https:\/\/img.gamemonetize.com\/boinh33lamjqvj38r8e7zbt1qmmwo2e0\/512x384.jpg","width":"1920","height":"1080"},{"id":"17513","title":"Stickman Shadow Ninja Force","description":"The little ninja is starting his training. Help him to pass 30 levels, one harder than the other. They are thorns, obstacles and some puzzles. Ninja Jump Force is a game with many levels, great graphics and a fun gameplay. Effects are many in a big world. Guarantee hours of fun in this unique arcade style game. Developed with Construct, must have program license to edit, and export to Android, iOS and others.","instructions":"Use Mouse Or keyboard To Play","url":"https:\/\/html5.gamemonetize.com\/dzu7wgkcldljvgh37v2kqqhnjedtu4g7\/","category":"Stickman","tags":"Action, Adventure, Arcade, Best, Boys, Casual, Girls, Hot, HTML5, Hypercasual, Kids, Mobile, Ninja, Online, Platform, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/dzu7wgkcldljvgh37v2kqqhnjedtu4g7\/512x384.jpg","width":"1280","height":"720"},{"id":"16989","title":"Stickman Incredible Monster Hero City Fight","description":"new amazing stickman monster hero game free with various fighting missions, play amazing stickman games and smash all evil stickman superheroes Become stickman hero monster to destroy all baddies or gangster monsters Show your super heroes with amazing skills to crush the city with monster fighting.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/4519hb3heq708m9y2j5yy32qj7xsf74j\/","category":"Stickman","tags":"Battle, Fight, Monster, Stickman, Superhero","thumb":"https:\/\/img.gamemonetize.com\/4519hb3heq708m9y2j5yy32qj7xsf74j\/512x384.jpg","width":"800","height":"600"},{"id":"17347","title":"WATER FLOW","description":"Extremely easy to play yet not that easy to give up.Adjust pins by pulling or dragging them.Make your way trough pipes.If you've been looking for a pull the pin puzzle game for a long time, it's time to explore it.","instructions":"Adjust pins by pulling or dragging them Make your way trough pipes ","url":"https:\/\/html5.gamemonetize.com\/hhnbpg76uvlj0v25b7q8l9tlcrpnbfvt\/","category":"Stickman","tags":".io, .io Games, Game, Games, Mobile","thumb":"https:\/\/img.gamemonetize.com\/hhnbpg76uvlj0v25b7q8l9tlcrpnbfvt\/512x384.jpg","width":"800","height":"600"},{"id":"16979","title":"Classic","description":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"are you ready to play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/b1xhs9srby4hvh2r1kjeh5lns7hhehqp\/","category":"Stickman","tags":"Android, Brain, Classic, Cooking, Fun, Funny, Girl, Girls, Kid, Kids, Kill, Killing, Math, Mind, Mobile, Puzzle, Quiz, Shoot, Shooter, Shooting, Skill, Skills, Stickman","thumb":"https:\/\/img.gamemonetize.com\/b1xhs9srby4hvh2r1kjeh5lns7hhehqp\/512x384.jpg","width":"800","height":"600"},{"id":"17147","title":"Stickman Bike","description":"play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play . are you ready ?","instructions":"play best classic game for kid and family play now with your friends this game she have great graphics and nice sound and very easy to play are you ready ","url":"https:\/\/html5.gamemonetize.com\/oeidb57q5fuk7k4h5eh9wy3ql6e5ru7g\/","category":"Stickman","tags":".io, 2D, Action, Adventure, Aircraft, Android, Animal, Anime, Army, Baby, Barbie, Battle, Ben 10, Best, Bike, Bounce, Boy, Boys, Brain, Bubble, Cake, Candy, Car, Cars, Cartoon, Casual, Cat, Classic, Color, Defense, Difference, Dragon, Dragon Ball Z, Dress Up, Family, Fight, Fire, Frozen, Fruit, Fun, Funny, Game, Girl, Girls, IO, jump, Jumping, Kid, Kids, Kill, King, Mario, Minion, Mobile, Moto, Motorcycle, Ninja, Pixel, Puzzle, run, running, Shoot, Shooter, Shooting, Stickman, subway, Zombie","thumb":"https:\/\/img.gamemonetize.com\/oeidb57q5fuk7k4h5eh9wy3ql6e5ru7g\/512x384.jpg","width":"800","height":"600"},{"id":"13922","title":"ZombieShooter","description":"Zombie Shooter design with well graphics and realistic. It is a super cool game in which you must kill all the zombies, direct hits of bullets, as well as the rebound! Share what you’re capable of and destroy all the zombies as fast as possible! Made in Construct 2. Enjoy the game! It is a super cool game in which you must kill all the zombies, direct hits of bullets, as well as the rebound! Simple-to-play but hard-to-master.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/6xtkqsfxltm8jmkmqnzn65i83iwjb3yh\/","category":"Stickman","tags":"Bubble Shooter, Shooter, Zombie","thumb":"https:\/\/img.gamemonetize.com\/6xtkqsfxltm8jmkmqnzn65i83iwjb3yh\/512x384.jpg","width":"800","height":"600"},{"id":"16809","title":"FNAF piano tiles","description":"Five Nights at Freddy's Piano Tiles 2021 Songs is the best free music game in the world Play songs and become a professional pianist. Five Nights at Freddy's Piano Tiles Songs is: - High quality piano game music - Increase your game speed to earn more points - Improve your reflex level and unlock the other melodies - Create beautiful melodies. Play for free FNAF Piano Tiles 2020 Songs online! This wonderful piano games will keep you challenges and surprises you never imagined. Rule of the game : It's very simple, just tap the black tiles and avoid the white tiles. That's all ! Game features: - Impressive design and graphics - High quality soundtracks for piano - A large collection of piano songs - New gaming experience - Collect diamonds - Get experience, open new levels. - Music game 100% free Try this FOXY MANGLE Piano Tiles Songs game now and improve your reaction speed and musical skills! WARNING: Five Nights at Freddy's Piano Tiles Songs is an unofficial fan app. This app does not include any copyrighted material. Piano melodies are arranged with individual piano notes.","instructions":"-foxy -fnaf","url":"https:\/\/html5.gamemonetize.com\/t0zn7b0ekbzutts01kemoqtzvg8dqodk\/","category":"Stickman","tags":"Cartoon Network, Dragon","thumb":"https:\/\/img.gamemonetize.com\/t0zn7b0ekbzutts01kemoqtzvg8dqodk\/512x384.jpg","width":"600","height":"960"},{"id":"14481","title":"Flip Spider-Man Hero - Spderman Hook Online Games","description":"Spider-Man newest game online free based on the blockbuster games flap flap . Help the cat Flap Cat to go through challenges that are super difficult 30 worlds . The game has Spider-Man setting, vibrant colors and counting score. Flap Cat Spider-Man is a fun game with excellent graphics Spider-Man style, very difficult and choose free one from 40 unlocked ready Spider-Man . Guarantee hours of fun! What is his record?","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/ce9aw4d0l12vp74nwaqcxgr6cfk1a76n\/","category":"Stickman","tags":".io Games, Adventure, Best, Boys, endless, fly, Games, Hot, Online, Simulation, Spiderman, Superhero","thumb":"https:\/\/img.gamemonetize.com\/ce9aw4d0l12vp74nwaqcxgr6cfk1a76n\/512x384.jpg","width":"1280","height":"720"},{"id":"11502","title":"Wingsuit Stickman","description":"Did you ever dream of flying down the highest mountains in the world? Now it's your time, join the completely redesigned Wingsuit Stickman experience, pack your wingsuit and glide through beautiful landscapes, cross the Alps, fly down the Rocky Mountains or enter a deadly volcano while performing insane stunts, scaring birds and plane pilots and simply enjoy the wonderful experience of a perfect wingsuit proximity flight. FEATURES: • Includes more than 30 beautiful designed levels from \"Relaxed gliding\" to \"Jump into a deadly volcano\" • Unique and beautiful graphic style • Fully physics enabled • Various obstacles like Planes, Birds, Wind wheels, Waters, Volcanos, and even Transylvanian death wasps • Agil and fast reacting wingsuit experience using tilt and optional button control • Online and Offline leaderboard • Google Play leader boards and achievements • and many more... All levels can of course be played for free, the optional in-app purchases just allows you to play them immediately instead of having to progress through the game. Feel free to post your ideas, we will try to implement them as soon as possible Thank you very much for all your support and interest in our games! We would love to hear your suggestions!","instructions":"mouse only","url":"https:\/\/html5.gamemonetize.com\/hwbdvp0nmxtqnexdy2n5say08jdj8ldp\/","category":"Stickman","tags":"fly, Fun, Kids, Stickman","thumb":"https:\/\/img.gamemonetize.com\/hwbdvp0nmxtqnexdy2n5say08jdj8ldp\/512x384.jpg","width":"800","height":"600"},{"id":"15213","title":"Fidget Spinner Master Game","description":"Spin fidgets to crash others and stop them to win! Are you ready to be the master of fidget spinners? Clown Games brings the addictive fidget spinner io game played by millions on PC to mobile! Join Fisp.io, the popular fidget spinners io game, to start spinning now! Collect dots to spin faster, become the fastest spinner in the arena and crash others!","instructions":"Tap to Play","url":"https:\/\/html5.gamemonetize.com\/k1z54y1cla9gogv8s6dvh64g5mo0ho62\/","category":"Stickman","tags":"2 Player Games, Baby","thumb":"https:\/\/img.gamemonetize.com\/k1z54y1cla9gogv8s6dvh64g5mo0ho62\/512x384.jpg","width":"800","height":"600"},{"id":"16074","title":"Stack Master!","description":"Keep running against obstacles, traps and gaps with Stack Master! Collect the stacks on the way and build new roads and bridges for yourself! Play in dozens of different levels and try to make the highest scores!","instructions":"MOUSE ","url":"https:\/\/html5.gamemonetize.com\/qpr5whf8qeqad821vbltj7qclfbm38zt\/","category":"Stickman","tags":"3D, Balance, Collecting, Color, Fun, Funny, Hypercasual, Road","thumb":"https:\/\/img.gamemonetize.com\/qpr5whf8qeqad821vbltj7qclfbm38zt\/512x384.jpg","width":"800","height":"450"},{"id":"11566","title":"Draw Rider Free - Top Bike Stickman Racing Games","description":"Draw Rider Free - top bike racing games race arcade racing on Android available completely free! Do you have a Google Play Pass? Download Draw Rider Plus and unlock all plus features with your subscription. Check it out! Can you get to the finish line safely and securely, and not crash? Draw Rider Free - top stickman bike racing games is not an ordinary race, here you will find treacherous trials from many hardcore levels, this is a real trial on a bicycle. Get gold medals, becoming the best racer on each track, to unlock new levels and new characters.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/y3k63kz1i7a09u1elyvul94nwp2sh73f\/","category":"Stickman","tags":"Drawing, HTML5, Race, Racing, Stickman","thumb":"https:\/\/img.gamemonetize.com\/y3k63kz1i7a09u1elyvul94nwp2sh73f\/512x384.jpg","width":"800","height":"600"},{"id":"11356","title":"Sunset Bike Racer - Motocross Game","description":"What better way to celebrate the holidays than with tons of death-defying stunts? Jump on this bike and get ready to dodge gigantic saw blades while you blast your way across a winter wonderland. Can you make it across each finish line without crashing into a dozen boxes of TNT or some other totally insane hazards? This crazy, wintertime racing game could keep you busy until spring or even beyond!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/u9hj2yjkvs8olk7vg4q8gthe98myv56p\/","category":"Stickman","tags":"1 Player, Funny","thumb":"https:\/\/img.gamemonetize.com\/u9hj2yjkvs8olk7vg4q8gthe98myv56p\/512x384.jpg","width":"800","height":"600"},{"id":"15803","title":"Word.Puzzle.Search","description":"Do you like brain games or puzzle games? Word Search Puzzle is a classic word search game! Swipe to match letters. Find the right letters into many different words. Word Search Puzzle Features • Fun to get new words by combining letters • Thousands of levels waiting for you! • Free undo and hints! • Different game modes and varying objectives keep each level sweet and fresh! • Leaderboards to compare best times with friends! • Classical and Cool but so Simple word puzzle game. • Solve the daily puzzles to earn coins. • Totally free for play! • Words can be horizontal, vertical, diagonal and even backwards.","instructions":"Do you like brain games or puzzle games Word Search Puzzle is a classic word search game Swipe to match letters Find the right letters into many different words Word Search Puzzle Features Fun to get","url":"https:\/\/html5.gamemonetize.com\/mjo2zxicdr3hs3w4t95gvx15augt3e8q\/","category":"Stickman","tags":"Kids, Puzzle, Word","thumb":"https:\/\/img.gamemonetize.com\/mjo2zxicdr3hs3w4t95gvx15augt3e8q\/512x384.jpg","width":"800","height":"600"},{"id":"15682","title":"Robin Hook (Spiderman Edition)","description":"Use your ropes to swing a destructible rag doll from one hook to the other. You have full control over your ropes, touch a hook or object to throw your rope into it, touch again to release it and fly through the sky with stunts. complete all levels with the same agility as a spider stunt. To do this, all you need to do is: - Tap to hang and do amazing jumps - Tap your screen to hook your stick man with your grappling hook and release to let go - Avoid all the obstacles that stand in your way - Swing from hook to hook to pass all levels with different stunts Using bumpers and your grappling hook, perform acrobatic figures and show your friends who's the boss! Think you can do better than a stick hero? Prove it! The faster you go, the more amazing your stuff will be.","instructions":"Click using bumpers and your grappling hook perform acrobatic figures and show your friends who s the boss ","url":"https:\/\/html5.gamemonetize.com\/3wcnzdcy1kwntl8v273u65k109psixil\/","category":"Stickman","tags":"Casual, Hypercasual, jump, Stickman","thumb":"https:\/\/img.gamemonetize.com\/3wcnzdcy1kwntl8v273u65k109psixil\/512x384.jpg","width":"600","height":"960"},{"id":"15298","title":"Dentist.Master","description":"Become a dentist and help our friends to have a healthy mouth. Brian, Katie, Frank and Peter have come to the dental clinic for you to help them clean their teeth, put fillings or fix broken teeth. Your children may perform dental treatments and play as experts dentists. Help your kid become a dentist, it's educational and fun. Enjoy our amazing dentists game.","instructions":"Become a dentist and help our friends to have a healthy mouth Brian Katie Frank and Peter have come to the dental clinic for you to help them clean their teeth put fillings or fix broken teeth Your children may perform dental treatments and play as e","url":"https:\/\/html5.gamemonetize.com\/9emeshsq8px3xrnoq674i574uykedu1n\/","category":"Stickman","tags":"Android, Army, Baby Hazel","thumb":"https:\/\/img.gamemonetize.com\/9emeshsq8px3xrnoq674i574uykedu1n\/512x384.jpg","width":"800","height":"600"},{"id":"15071","title":"Hangram","description":"Play classic Hangman puzzles on your device. Suitable for all ages & abilities. How to play: Choose letters to help you guess the hidden word. When you guess a letter correctly it will display above its positioned underscore. The more letters that you guess correctly, the more likely you'll be able to guess the word correctly. Each time you select an incorrect letter, the gallows will be formed, followed by a stickman figure. Once the stickman has been fully constructed, it will be game over. When you successfully guess a word, you will have 1 coin added to your in-game balance. Coins from your balance can be used to reveal letters when you are stuck. Game Features: • Hundreds of words & a wide range of categories. • Perfectly themed to give that classic Hangman feel. • 100% free. All content is available to everyone with no hidden upgrades. • Options to turn sound effects on\/off. • Game progress will always be saved along with your high score. We hope that you enjoy our classic Hangman game & look forward to hearing your feedback.","instructions":"Choose letters to help you guess the hidden word When you guess a letter correctly it will display above its positioned underscore The more letters that you guess correctly the more likely you ll be able to guess the word correctly Each time you selec","url":"https:\/\/html5.gamemonetize.com\/jvwtf6um2neijb9hl7qr9nr3czl3jlh3\/","category":"Stickman","tags":"Brain, Game, Mind, Puzzle, Word","thumb":"https:\/\/img.gamemonetize.com\/jvwtf6um2neijb9hl7qr9nr3czl3jlh3\/512x384.jpg","width":"600","height":"960"},{"id":"15156","title":"Game Clash of Viking","description":"The battlefield is set. It's you versus the other viking kingdom. You have 3 minutes to defeat your enemy. Choose the right battle cards and place your heroes on the battlefield. Defeat the enemy kingdom to win the game! Use different combinations of card decks and strategies to defeat the enemy.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/9etr0k3j53uzn4zekqreddhpcopqns2x\/","category":"Stickman","tags":"Clash, Games, HTML5, Knight, Shoot","thumb":"https:\/\/img.gamemonetize.com\/9etr0k3j53uzn4zekqreddhpcopqns2x\/512x384.jpg","width":"800","height":"600"},{"id":"14994","title":"monster run 2","description":"Evil Pen did it again! He zapped our beloved hero, Square, with his new and powerful evil machine, The Run-O-Matic 2000. And though our hero is bound to a never ending run, he is determined and strong in will and he literally won't rest until he stops Evil Pen... again. Join Square’s epic adventure, run, jump, dive, fly and shoot your way through, but most importantly stop Evil Pen's evil plans!","instructions":"Features Procedurally generated mission levels - game world expands with each level Predesigned castle levels to explore metroidvania style Endless mode and challenges master your skills and get extra bonus coins U","url":"https:\/\/html5.gamemonetize.com\/e92cng1nt012xfpz1vgeyr0hrxww2vkh\/","category":"Stickman","tags":"1 Player, Action, Adventure, Alien, Arcade, Ben 10, Best, Bomb, Cartoon, Cute, Fight, gta, Hypercasual, jump, Jumping","thumb":"https:\/\/img.gamemonetize.com\/e92cng1nt012xfpz1vgeyr0hrxww2vkh\/512x384.jpg","width":"800","height":"600"},{"id":"14869","title":"Light It Up - ninja Jump Up","description":"Light it Up Game is beautifully designed and made with love! Swing, jump, flip and slide your stickman body from one neon color shape to another to make them glow and Light It Up - ninja Jump Up. Light It Up Features: - several levels - High graphics - multiple effects - best pastime - Hyper Casual Game Jump, flip & brighten the world in the awesomest of all stickman jumping games.","instructions":"Light it Up Game is beautifully designed and made with love Swing jump flip and slide your stickman body from one neon color shape to another to make them glow and Light It Up - ninja Jump Up Light It Up Features - several levels - High graphics","url":"https:\/\/html5.gamemonetize.com\/91q2e9v8rszvfwmdnc7re6etgfwfskq1\/","category":"Stickman","tags":"Adventure, jump, Jumping, Ninja, Stickman","thumb":"https:\/\/img.gamemonetize.com\/91q2e9v8rszvfwmdnc7re6etgfwfskq1\/512x384.jpg","width":"800","height":"600"},{"id":"14906","title":"Sanctuary Rescue Plan","description":"This is a secret room rescue game with simple gameplay and multiple levels. In the game, the player needs to help Stickman to rescue him from a closed secret room. There will be some random traps in the secret room. You have to be flexible and use your hand to cut the rope so that Stickman falls to the ground and escape from the secret room.","instructions":"Mouse operation","url":"https:\/\/html5.gamemonetize.com\/27g4fhy0qft8gu9mdgk4p0hp0ez2lg9n\/","category":"Stickman","tags":"Adventure, Brain","thumb":"https:\/\/img.gamemonetize.com\/27g4fhy0qft8gu9mdgk4p0hp0ez2lg9n\/512x384.jpg","width":"880","height":"1566"},{"id":"12712","title":"Super hero hook ","description":"Become the Super Hero in this new open-world adventure full run, swing and non-stop action. The world is under threat from city-wide and Super Heroes can stop it! Standing in his way are Robots, the Goblin. Can you help Hero restore order and safety to your friend Welcome to Stickman Superhero Hook - Super Stick Heroes Swing! Play as the stickman superheroes and flip like a spider against the dark forces in the universe and protect yourself.","instructions":" Tight and fast paced gameplay Amazing looking graphics Realistic physic engine for the player ropes and objects Play in different daytime from Dusk through Night till Dawn Destructible effects Leaderboards Endless pla","url":"https:\/\/html5.gamemonetize.com\/783nkq8duj1b4f5i824ac07q9mizcs0j\/","category":"Stickman","tags":"Stickman, Strategy, subway, Super","thumb":"https:\/\/img.gamemonetize.com\/783nkq8duj1b4f5i824ac07q9mizcs0j\/512x384.jpg","width":"800","height":"600"},{"id":"14483","title":"Naruto Flip Game Adventure - Endless Hook Online","description":"Naruto newest game online free based on the blockbuster games flap flap . Help the Naruto Flap Naruto to go through challenges that are super difficult 30 worlds . The game has Naruto setting, vibrant colors and counting score. Flap Naruto Naruto is a fun game with excellent graphics Naruto style, very difficult and choose free one from 40 unlocked ready Naruto. Guarantee hours of fun! What is his record?","instructions":"Use Mouse To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/trgtsl0el5lz7gyimf550d2bvws2172u\/","category":"Stickman","tags":".io Games, Adventure, Anime, Boy, Boys, endless, fly, Ninja, Ninjago, Online, Race, Simulation, Stickman","thumb":"https:\/\/img.gamemonetize.com\/trgtsl0el5lz7gyimf550d2bvws2172u\/512x384.jpg","width":"1280","height":"720"},{"id":"14485","title":"Naruto: Shippuden Flip Game - Endless Hook Online","description":"naruto shippuden newest game online free based on the blockbuster games flap flap . Help the naruto shippuden Flap naruto shippuden to go through challenges that are super difficult 30 worlds . The game has naruto shippuden setting, vibrant colors and counting score. Flap naruto shippuden is a fun game with excellent graphics naruto shippuden style, very difficult and choose free one from 40 unlocked ready naruto shippuden. Guarantee hours of fun! What is his record?","instructions":"Use Mouse or Keyboard To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/aweys3im1ropdh8fggheiq2sxxvjifgs\/","category":"Stickman","tags":".io Games, Adventure, Anime, Best, endless, fly, Hot, Online, Stickman","thumb":"https:\/\/img.gamemonetize.com\/aweys3im1ropdh8fggheiq2sxxvjifgs\/512x384.jpg","width":"1280","height":"720"},{"id":"14283","title":"Stickman Rope Hook : Catch And Swing","description":"Discover Stickman Rope Hook, the new game. Tap to hook and make a stunts, With your hero avoid all obstacles in your way and finish all levels. Can you execute all these acrobatic tricks in a row like a boss? In this game, embody the stickman Boy. Finish all the levels with the same agility as a Stickman. For that, you just have to: - Press your screen to hook your stickman with your grapnel and release to let go - multiple stickman character - Swing from hook to hook to pass all the levels Thanks to the bumpers and your grapnel, execute acrobatic tricks and show your friends who is the boss! You think you can do better than a stickman? Prove it! The faster you go, the more amazing your tricks will be.","instructions":"Discover Stickman Rope Hook the new game Tap to hook and make a stunts With your hero avoid all obstacles in your way and finish all levels Can you execute all these acrobatic tricks in a row like a boss In this game embody the stickman Boy ","url":"https:\/\/html5.gamemonetize.com\/s0q21zdnyhwjjova6bh4tg53y04xp4yi\/","category":"Stickman","tags":".io Games, Stickman, Strategy","thumb":"https:\/\/img.gamemonetize.com\/s0q21zdnyhwjjova6bh4tg53y04xp4yi\/512x384.jpg","width":"960","height":"600"},{"id":"14475","title":"Batman Ninja Game Adventure - Gotham Knights","description":"Batman will be forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigate uneasy alliances while Bruce Wayne undertakes a perilous series of deceptions. Which of Batman’s new allies will you choose to trust? And how deep into the darkness will you let Bruce descend?","instructions":"Use Mouse or Keyboard To Play and Follow introduction","url":"https:\/\/html5.gamemonetize.com\/hhllsv1o5qiysxq6pbv27jyudqdu475l\/","category":"Stickman","tags":"Adventure, Batman, Battle, Knight, Ninja, Ninjago, run, running, Samurai, Stickman","thumb":"https:\/\/img.gamemonetize.com\/hhllsv1o5qiysxq6pbv27jyudqdu475l\/512x384.jpg","width":"1280","height":"720"},{"id":"14866","title":"hangman questions April","description":"Choose letters to help you guess the hidden word. When you guess a letter correctly it will display above its positioned underscore. The more letters that you guess correctly, the more likely you'll be able to guess the word correctly. Each time you select an incorrect letter, the gallows will be formed, followed by a stickman figure. Once the stickman has been fully constructed, it will be game over.","instructions":"","url":"https:\/\/html5.gamemonetize.com\/sfrac3ii4u0e1jsji4n3xgkosfyvn6rg\/","category":"Stickman","tags":"Halloween, Stickman","thumb":"https:\/\/img.gamemonetize.com\/sfrac3ii4u0e1jsji4n3xgkosfyvn6rg\/512x384.jpg","width":"600","height":"800"},{"id":"13996","title":"stickman vs zombies","description":"Discover the unforgettable stickman anger, how fierce could it be? A new madbox arena. A strange squad of rivals invaded onto the city. Every single person they assault ultimately is turned into zombie. People are going mad. They are fighting for their survival. This epic game of stickman is the only survival kit for their console.","instructions":"touch with mouse","url":"https:\/\/html5.gamemonetize.com\/m7qycrdmphk8170y1gu2piopurle4tiq\/","category":"Stickman","tags":"2D, Adventure, Stickman","thumb":"https:\/\/img.gamemonetize.com\/m7qycrdmphk8170y1gu2piopurle4tiq\/512x384.jpg","width":"800","height":"600"},{"id":"13989","title":"Color Snake 2","description":"Color Snake Switch Game, Switch the color of your snake, slide through your color, avoid the obstacles. Escort the snake as far as you can.It is very easy to play, but very difficult to get high scores. Whatever in this game the color of the snake, you go through the blocks belonging to it and go to the next section. You can easily cross the blocks by making gentle movements.","instructions":"click with mouse","url":"https:\/\/html5.gamemonetize.com\/6fap095wgmipvj0m0j1zryngixb6lces\/","category":"Stickman","tags":".io, Boys, Clicker, Color, Snake","thumb":"https:\/\/img.gamemonetize.com\/6fap095wgmipvj0m0j1zryngixb6lces\/512x384.jpg","width":"800","height":"600"},{"id":"12356","title":"Stickman Dragon Legend Super Battle Fight","description":"◎ Origine Manga Hero. ◎ Remove advertising . ◎ Get more reward , easy to fight and more Powerful Hero Form. ◎◎◎ Stickman Warriors Dragon Legend Super Battle Fight - The best action games and top 1 feature arcade games on mobile. ◎◎◎ Protect Saia Planet, defeat powerful enemies: Lord Pieza, Android Zell, Majin Evil ... Son of Dragon has gradually become SuperHero . Hardworking and perfecting his skills to the \" Ultra instinct \" Hero , Son of Dragon can defeat the gods of supreme destruction.","instructions":" Origine Manga Hero Remove advertising Get more reward easy to fight and more Powerful Hero Form Stickman Warriors Dragon Legend Super Battle Fight - The best action games and top 1 feature arcade games on mobile Protect ","url":"https:\/\/html5.gamemonetize.com\/xgw01prvacl7a2yohfmu0o1c29d51zbz\/","category":"Stickman","tags":"Action, Arcade","thumb":"https:\/\/img.gamemonetize.com\/xgw01prvacl7a2yohfmu0o1c29d51zbz\/512x384.jpg","width":"600","height":"960"},{"id":"14879","title":"Fill Juice Glass","description":"Draw the line and fill the fruit juice glass, initially glass is sad and your task is draw freely line to filled up glass with fruit juice and make happy glass. Its a puzzle game, you can use your logic and fill the glass. Try to find best way and draw a less line to complete each level, you can check our hint option to fill up the glass with a perfect ways and get 3 starts, you can use your mind to fill the glass with best way. There are different fruit juice available such as Orange, Mango, Pomegranate, Watermelon, Pine Apple and Chikoo.","instructions":" filled up glass with different fruit juice and completed level Challenge with fun puzzles challenge level available and coming soon with more hint option for find out the best way to filled fruit juice glass many obs","url":"https:\/\/html5.gamemonetize.com\/7r0lj319t1zkm4733fls9og6xhspxe04\/","category":"Stickman","tags":"1 Player, Girls, Puzzle","thumb":"https:\/\/img.gamemonetize.com\/7r0lj319t1zkm4733fls9og6xhspxe04\/512x384.jpg","width":"800","height":"600"},{"id":"14082","title":"Stickman Rope Hook","description":"Discover Stickman Hook, Tap to hook and make incredible jumps; Avoid every obstacle that stands in your way. Can you execute all these acrobatic tricks in a row like a boss? In this game, embody the spider stickman. Finish all the levels with the same agility as a spider. For that, you just have to: - Tap to hook and make incredible jumps - Press your screen to hook your stickman with your grapnel and release to let go - Avoid every obstacle that stands in your way - Swing from hook to hook to pass all the levels Thanks to the bumpers and your grapnel, execute acrobatic tricks and show your friends who is the boss! You think you can do better than a spider? Prove it! The faster you go, the more amazing your tricks will be. Why is Stickman hook so perfect? - Because you can swing like a spider - Because your stickman dances at the end of each game (We challenge you to reproduce his dance) - Because there is a grappling hook (and grapples are cool, right?)","instructions":"For that you just have to - Tap to hook and make incredible jumps - Press your screen to hook your stickman with your grapnel and release to let go - Avoid every obstacle that stands in your way - Swing fr","url":"https:\/\/html5.gamemonetize.com\/5e84vl1yt3qt1gy57p432a8uos5522o7\/","category":"Stickman","tags":"2D, Adventure, Click, jump, Jumping, Simulation, Stickman","thumb":"https:\/\/img.gamemonetize.com\/5e84vl1yt3qt1gy57p432a8uos5522o7\/512x384.jpg","width":"600","height":"960"},{"id":"13631","title":"Iron Man - Stickman Fight ","description":"Among all the stickman games, Stickman Fight - Battle Royale is one of the funniest and easiest to play. Fighting against other stickmans to become legend in stickman fight and get awesome rewards in stick fight games. In this game, you have to collect the supreme duelist varieties of stick fight weapons to make you stronger and stand out from the rest and become the best stickman legends. Unlock warriors with unique design styles and powerful strengths. There are available a lot of level in each game mode for you to explore, especially we are also make an endless mode for all of you. Watch the wheels of your vehicles flying away from you and just have fun playing Stickman Fight - Royal Blade simulator game made for all tastes and ages! Stickman Fight - Royal Blade Features: - Realistic physics - Dynamic gameplay - 100+ levels - 3 game modes - 50+ characters\/skins dbz styles, super heroes style and more - Various stunts - Blood and slow-motion effects - Collect these kinds of super fighters: dragon ssj2, z ssj3, ssj4, ultra instinct (ui), xeno... to become strongest stickman warrior. Missed interesting crashes to the different objects and dummies? Then you’d totally enjoy this game for every demolition lover! Play Stickman Fight - Royal Blade game and have fun!","instructions":" Among all the stickman games Stickman Fight - Battle Royale is one of the funniest and easiest to play Fighting against other stickmans to become legend in stickman fight and get awesome rewards in stick fight games In this game you have to c","url":"https:\/\/html5.gamemonetize.com\/p09ealu80klnmbghq4kniesy6s71dqk3\/","category":"Stickman","tags":"Stickman, Superhero","thumb":"https:\/\/img.gamemonetize.com\/p09ealu80klnmbghq4kniesy6s71dqk3\/512x384.jpg","width":"600","height":"960"},{"id":"13349","title":"Stickman Backflip Killer","description":"Destroy stickmans using your parkour skill, weapons and epic slowmotion effects Upgrade your outfit and parkour skills, buy weapons, to become the best stickman in the world. Pass cool parkour levels and try out Killer Mode to destroy your enemies. With new stages system new levels will be more exciting and intersting.","instructions":"Searching carefully you could find a weapon to defend yourself ","url":"https:\/\/html5.gamemonetize.com\/98r95qx89742pharpw9k8iseywsnz439\/","category":"Stickman","tags":"3D, Boys, Fight, Fighting, Kill, Killing, Stickman","thumb":"https:\/\/img.gamemonetize.com\/98r95qx89742pharpw9k8iseywsnz439\/512x384.jpg","width":"800","height":"600"},{"id":"13617","title":"slenderman kill 2","description":"The Best Real Slenderman Game. Collect 8 pages \/ Save 8 kids. The Most Recommended Slender Man Game Ever! ********************************************* Install all our Slenderman games: Slender Man Origins 1 (Lost Kids): https:\/\/play.google.com\/store\/apps\/details?id=com.roonto.horror_free Slender Man Origins 2 Saga (Horror Quest): https:\/\/play.google.com\/store\/apps\/details?id=com.bigzur.slendermansaga.free Slender Man Origins 3 (Abandoned School) https:\/\/play.google.com\/store\/apps\/details?id=com.bigzur.slenderiiifree Slender Man Hide & Seek Online Multiplayer Game: https:\/\/play.google.com\/store\/apps\/details?id=com.bigzur.slender4 ********************************************* Slender Man Origins Free - Immerse yourself into the thick atmosphere of mystery and horror! Follow the Slender Man's trail, become a witness to his horrific deeds and save the children from their inevitable doom. Explore, listen and look closely, travel through the dark corridors, damp halls, dense forests and empty streets, among the ancient tombs, old looming trees and abandoned houses. But beware! Slender Man is near! In your journey you will encounter many things without explanation, some even seeking to harm you. Always remember that every step you take may well be your last - for the Slender Man watches you... - Four different, atmospheric locations Each of the locations is unique, complete with a certain theme and filled with detail. - Variable ambience Explore while experiencing different weather conditions, adding a certain feel to each of your journey. - Enviroment The Slender Man isn't the only thing you shall notice out there. While some events may simply be a part of unexplainable, many of them mean danger, some may bar your way, while few others can even prove lethal. Be ready for surprises! - Easy and quick-to-learn controls Move around and explore the way you are most used to - you can always choose a more familiar control scheme from the options menu. Run away from Slender Man easily! - Use the headphones! 3D sound makes the atmosphere even more mysterious, while listening to the directions of noises you can often get a feel of where you should go, or even avoid a hazard. - Smooth, pleasant graphics Fine detail, soft light and lots of objects, as well as shadows from every tree, stone and iron bar in a fence - you are sure to itch for a few screenshots along the way. Best Slender Man Game for Android with over 3M registered players worldwide! Join our Community!","instructions":"The Best Real Slenderman Game Collect 8 pages Save 8 kids The Most Recommended Slender Man Game Ever Install all our Slenderman games Slender Man Origins 1 Lost Kids https play google com","url":"https:\/\/html5.gamemonetize.com\/iz3jcpjihv5w0jjx0psr6jukoehqra6a\/","category":"Stickman","tags":"2 Player Games, Action, Adventure","thumb":"https:\/\/img.gamemonetize.com\/iz3jcpjihv5w0jjx0psr6jukoehqra6a\/512x384.jpg","width":"800","height":"600"},{"id":"13633","title":"Stickman Samurai Katana","description":"⚔️⚔️⚔️ Stickman Katana - The spectacular return in Stickman games series toppled the international game market. The followers of Stickman games still have not forgotten the feeling of tight guillotine and ecstatic graphics of Stickman Legend old version. And what would you expect in a recent version of Stickman fight and this revenge? Whether this revenge will end or not? Stickman Katana will come back with a new look, new Stickman characters, new Stickman skills, new stick pets. Be ready to wipe out the enemy – cruel monster and their obstacles by unprecedented features in Stickman Revenge Stick War deserves as one of the best stickman games worth playing ever.","instructions":"Stick War deserves as one of the best stickman games worth playing ever ","url":"https:\/\/html5.gamemonetize.com\/enq339249k78j14l0uutkbh2q0v4j8ex\/","category":"Stickman","tags":"Stickman, Strategy","thumb":"https:\/\/img.gamemonetize.com\/enq339249k78j14l0uutkbh2q0v4j8ex\/512x384.jpg","width":"600","height":"960"},{"id":"13576","title":"Prison Escape Stickman","description":"Prison Escape Stickman game is a casual game where you have to lead players towards the final destination by digging paths for them. Loot as many items as you can and be the king looter.","instructions":"Touch the path to dig the way out ","url":"https:\/\/html5.gamemonetize.com\/p2lelfgxnuuoeofsvr5s62u969qiu2ej\/","category":"Stickman","tags":"Action, Adventure, Casual, Escape, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/p2lelfgxnuuoeofsvr5s62u969qiu2ej\/512x384.jpg","width":"800","height":"600"},{"id":"14751","title":"Drunken Table Wars ","description":"The Drunken series continues with table wars. Try to draw the table to your area. Play single player mode or 2 player mode! To win, you should defeat your opponent 5 times. Objects falling on the table can affect the matches. Come on, hold the table!","instructions":" W and UP ARROW or Touch Controls possible for mobile devices ","url":"https:\/\/html5.gamemonetize.com\/b21nrk7dyi3zw766vs5bh7rzd8sfmrvx\/","category":"Stickman","tags":"2 Player, 2 Player Games, 2D, Balance, Fighting, Fun, Funny, Physics, War","thumb":"https:\/\/img.gamemonetize.com\/b21nrk7dyi3zw766vs5bh7rzd8sfmrvx\/512x384.jpg","width":"1280","height":"768"},{"id":"13260","title":"Stickman VS StickMan Bullet shooting","description":"Supreme Duelist Stickman is a funny and crazy Stickman mobile game -A lot of map (NEW MAP EDITOR) - With Simple control -Play and unlock new skin -1 player, 2 player and survival mode -Realistic stickman ragdoll -2d physic stick fight battle -create your own stickman wariors Different modes -Gravity (ON\/OFF) -Instant KO (if disable, the water, lava, etc will deal damages on contact) -Energy Shield (if disable, the stickman can bend down) You can choose your character and play with a friend in the 2 Player Mode. RHG stick fighting game","instructions":"","url":"https:\/\/html5.gamemonetize.com\/2qt527t3xctpvcfv0yw2mzibgikhex5h\/","category":"Stickman","tags":"Fighting, Gun, Killing, Shooter, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/2qt527t3xctpvcfv0yw2mzibgikhex5h\/512x384.jpg","width":"800","height":"600"},{"id":"13340","title":"Dragon Shadow Super Hero Legend","description":"Dragon Shadow Battle : Super Hero Legend officially debuted as a major event on the world. The best combat action game will bring player amazing experiences. You will transform into your own superheroes Goku for justice and peace on the planet. The objective of Goku is beating all of the enemies on your way. In this game, you have to transform into hero saiyan. One Saiyan Warrior. Can turn into Super Saiyan. You will transform into your character and adventure though many different planets, learn a lot of martial arts and also versus many legendary characters. The battles are extremely fierce and in order to win the player must have the proper tactics combined with the saiyan skills. ou can play game everywhere, everytime,: you can play when cooking, in office, in the car or bus, plane, train, even when you watching football, anytime you want. Game are made for everybody , all age , boy or girl, children or adult , men or women, under or over 18 age. This game includes Goku with 20 Levels, from 1 to 20 SSJ, it gives you more power and skills that will make you enjoy the ultimate saiyan battle of dragon shadow battle. Some amazing skills like Kamehameha, Dragon Recall, Big Bang Attack, Ki Blast and Monkey King Recall ... may coming very soon. Become super heroes and warrior of legend with full skill of a super hero special. Game features - Tutorial guide player from a to z - Super hero : Goku - Super skills: dragon call, ball blast attack, phoenix recall - 50+ bosses with 100+ skills. - 55 pre-design battles with a lot of challenges - Use god beans to recover health and power. - Use coins or watch video to re-spawn in current place. - Watch video or use coins to avoid downgrade level. - Watch video or use coins to spin lucky wheel. - Watch video or use coins to buy god beans. - Change main character to fight, unlock super sayan levels - Daily reward and lucky spin - Adavance Mode new Download Dragon Shadow Battle : Super Hero Legend and share your funny moment in this popular action game with friends now!","instructions":"Dragon Shadow Battle Super Hero Legend officially debuted as a major event on the world The best combat action game will bring player amazing experiences You will transform into your own superheroes Goku for justice and peace on the planet The obj","url":"https:\/\/html5.gamemonetize.com\/be4zxgtq0m98u4a99gq96a5tvhsc5ufh\/","category":"Stickman","tags":"2D, Action, Adventure, Anime, Battle, Dragon Ball Z, Stickman","thumb":"https:\/\/img.gamemonetize.com\/be4zxgtq0m98u4a99gq96a5tvhsc5ufh\/512x384.jpg","width":"960","height":"600"},{"id":"13320","title":"3 LINK KIDS","description":"In 3 Link, your goal is to remove all the images from the board by connecting 3 identical images. Connect lovely images of cute animals, delicious food, amazing places, and so much more. NOTE! You need to remove all the tiles before the time is up! So warm up your fingers, and it’s game on!","instructions":"remove all the images from the board by connecting 3 identical images","url":"https:\/\/html5.gamemonetize.com\/zylxgr03e2uwz8d8l5zzybjhg50pclac\/","category":"Stickman","tags":"Barbie, Boy, Boys, Candy, Girl, Girls, Kids, Mario","thumb":"https:\/\/img.gamemonetize.com\/zylxgr03e2uwz8d8l5zzybjhg50pclac\/512x384.jpg","width":"800","height":"600"},{"id":"13140","title":"BLOO KID 2","description":"After rescuing his girlfriend from the hands of the evil wizard, Bloo Kid and Pink Girl enjoy life with their newborn \"Pink Kid\". But then, a whole new adventure starts just out of the bloo... Bloo Kid 2 is a classic 2D retro-style platformer experience with lovely designed pixel-graphics and a full chiptune soundtrack. Run, jump and swim your way through FIVE huge worlds with twelve levels each. Master brutal bossfights and discover lots of secrets in the world of Bloo Kid 2.","instructions":" five worlds with twelve levels each handcrafted colorful pixel-graphics a full chiptune soundtrack epic boss battles tons of secrets ultra-precise controls","url":"https:\/\/html5.gamemonetize.com\/yjult3xfcqnd7t6rnqb9z93w9u2101iy\/","category":"Stickman","tags":"Ben 10, Boys, Cartoon, Cartoon Network, Mario","thumb":"https:\/\/img.gamemonetize.com\/yjult3xfcqnd7t6rnqb9z93w9u2101iy\/512x384.jpg","width":"800","height":"600"},{"id":"12876","title":"Super Heroes Finger","description":"super heroes Fighter is the easiest and cheapest fighting game! Challenge your friends and family in the funniest thumbs up war matches! Enjoy the best 2-player matches, tournaments and wacky mini-games! A local against dementia! The original thumbs up game. - 2 player versus mode - Player versus phone - Computer versus computer mode (why not?) - Over 150 crazy XD characters - New products every week! - Lightweight and offline! - New features coming soon! Have fun with its cartoon character style and hilarious fighting. This lightweight game can be played offline and is great to play with friends. Hope you like it! 超级英雄战斗机","instructions":"","url":"https:\/\/html5.gamemonetize.com\/6pgqqpii1mjr34k39obz7n3m6l0qacth\/","category":"Stickman","tags":"Action, Adventure, Fight, Fighting, King, Superhero","thumb":"https:\/\/img.gamemonetize.com\/6pgqqpii1mjr34k39obz7n3m6l0qacth\/512x384.jpg","width":"800","height":"600"},{"id":"12803","title":"Stickman Dragon Ball Archero","description":"Enter a world where existence itself is eliminate you! You are a bowman or a stickman archer, the only force able to resist and defeat the oncoming waves of evil. Take up the bow, aim your arrow and fire away to become the most greatest bowman, greatest stickman archero! Become the legendary archer master, bowmaster and destroy the evil enemy archers. Choose your bowman and destroy the enemy stickman archers in this bow hunting game. Sharpen your archery target and shooting skills and become a champion.","instructions":"Enter a world where existence itself is eliminate you You are a bowman or a stickman archer the only force able to resist and defeat the oncoming waves of evil Take up the bow aim your arrow and fire away to become the most greatest bowman greatest","url":"https:\/\/html5.gamemonetize.com\/lp9n5zkybfgw4rxig707c2z7olvokri6\/","category":"Stickman","tags":"Dragon Ball Z, Stickman","thumb":"https:\/\/img.gamemonetize.com\/lp9n5zkybfgw4rxig707c2z7olvokri6\/512x384.jpg","width":"600","height":"960"},{"id":"12854","title":"Warriror Ragdoll ","description":"Ragdoll Soldiers: The Fight Game - is a striking stickman game, stickman soldiers fight game where you can unleash at waves of enemy stickmen soldiers. In order to survive you will have to fight to the last drop of your blood. Show you soldier skills to become a winner in battles. Ragdoll warriors can carry an attack by different body parts and use various types of weapons. Join the battle and fight with stickman warriors now!","instructions":"Ragdoll Soldiers The Fight Game - is a striking stickman game stickman soldiers fight game where you can unleash at waves of enemy stickmen soldiers In order to survive you will have to fight to the last drop of your blood Show you soldier skills to b","url":"https:\/\/html5.gamemonetize.com\/r80j9flew8xomr0frag50nsw2ewx3pxu\/","category":"Stickman","tags":".io, .io Games, 2D, Action, Adventure","thumb":"https:\/\/img.gamemonetize.com\/r80j9flew8xomr0frag50nsw2ewx3pxu\/512x384.jpg","width":"960","height":"600"},{"id":"13139","title":"Irresponsible Ninja 2","description":"The unreliable ninja, forgot how to fly, can you help him go further?","instructions":"click to play","url":"https:\/\/html5.gamemonetize.com\/vn9ofr5t2r1x7g86pjmvsg9os04iwxls\/","category":"Stickman","tags":"Boy, Ninja, Ninjago, Skill","thumb":"https:\/\/img.gamemonetize.com\/vn9ofr5t2r1x7g86pjmvsg9os04iwxls\/512x384.jpg","width":"800","height":"600"},{"id":"12782","title":"stickman strike: shadow warriors","description":"Stickman Warriors - Super Dragon Shadow Fight best fighting action role-playing game on Google Play. This fighting game will give you a chance to become one of dbz heroes to fight z with enemies and protect everybody on earth. Enter into the arena and fight for the survival. If you love playing games then this is the game which will amaze you with the swift handling and amazing features. With addictive gameplay z fighters, your enemies will upgrade their power and you have to fight for survival. To fight against the most DB Boss likes Ninja Black, Big Thunder lizards..., the shadow stick z fighter may need to upgrade your power to the highest level. We bet you will enjoy the abundant upgrades for and all your stickman heroes in the best action RPG fighting game.","instructions":"Stickman Warriors - Super Dragon Shadow Fight best fighting action role-playing game on Google Play This fighting game will give you a chance to become one of dbz heroes to fight z with enemies and protect everybody on earth Enter into the arena and ","url":"https:\/\/html5.gamemonetize.com\/1w4mzbwicipth2i7sbcao8juxtemt8lv\/","category":"Stickman","tags":"1 Player, Battle, Best, Stickman, Superhero, War","thumb":"https:\/\/img.gamemonetize.com\/1w4mzbwicipth2i7sbcao8juxtemt8lv\/512x384.jpg","width":"800","height":"600"},{"id":"12155","title":"Stick Clash ","description":"Defeat enemies to collect teammates. Attack the monster with a crowd clash. Stick Clash is a fun and addictive stickman game.Start running alone and defeat enemies to tame them as your teammates. Lead your team to defeat all the other mobs and the most important goal is to kill the monster at the bottom of the map. Calculate your moves on the run and collect as many members as possible. Let’s see how far you can get in this crazy survival race! Calculate your own score and that of your opponent to come up with a suitable attack strategy. Features • Easy Controls, just tap with one finger to choose the right direction • Ultra Violent Stickman fighting • There are many beautiful maps, modern colors, high quality graphics • Choose Your Moves, bruise, bash and beat your way to victory • Wield special powers in duels to the death • Exterminate them all, there is no mercy for the Stickman!","instructions":"Defeat enemies to collect teammates Attack the monster with a crowd clash ","url":"https:\/\/html5.gamemonetize.com\/w5rvh1u0djtz335cnu280rpwihvrnw5j\/","category":"Stickman","tags":"Battle, Battlegrounds, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/w5rvh1u0djtz335cnu280rpwihvrnw5j\/512x384.jpg","width":"800","height":"600"},{"id":"11524","title":"Rolly Balls 2021","description":"Rolly Balls is a relaxing casual game you can pick up and play any time! Simply rotate the level by dragging your finger over the screen. Rotate the level in the correct way to get all the balls to fall out of the level! Complete enough levels and you can be awarded more balls to increase your score even furthur!","instructions":"Rolly Balls is a relaxing casual game you can pick up and play any time Simply rotate the level by dragging your finger over the screen Rotate the level in the correct way to get all the balls to fall out of the level Complete enough levels and you can","url":"https:\/\/html5.gamemonetize.com\/gj5kmpm5pfmwhke924hz8ggwv1jie2du\/","category":"Stickman","tags":"1 Player, Aircraft, Android","thumb":"https:\/\/img.gamemonetize.com\/gj5kmpm5pfmwhke924hz8ggwv1jie2du\/512x384.jpg","width":"800","height":"600"},{"id":"11957","title":"Emoji Game","description":"A new imagination game in which you need to connect pairs of emotions by associations. Think and find the idea of each puzzle. Just tap one by one on the elements from different columns to connect them with a line. Or drag to draw a line and connect elements from different columns. If you correctly connect all the elements, you pass the level. Harder than you think!","instructions":"drag to draw a line and connect elements from different columns","url":"https:\/\/html5.gamemonetize.com\/3m7t5ko2qugbnr4y86jawj63hf7ynkhr\/","category":"Stickman","tags":"2 Player, Anime, Drawing","thumb":"https:\/\/img.gamemonetize.com\/3m7t5ko2qugbnr4y86jawj63hf7ynkhr\/512x384.jpg","width":"800","height":"600"},{"id":"12655","title":"Imposter Samurai Among All of Us","description":"Imposter Samurai : You have your swords run around kill all the enemies, spread the blood, avoid being killed.","instructions":"Drag and drop to run and avoid being killed approach the enemy to cut him with the powerful sword ","url":"https:\/\/html5.gamemonetize.com\/3dzg5owhgdnwrvxj8861sb828jtmhvbk\/","category":"Stickman","tags":"2 Player Games, 2D, 3D Games, Animal, Anime, Boxing, Cartoon, Cartoon Network, Crazy, Kid, Killing, Knight, Skill, Spongebob, Sport, Sports","thumb":"https:\/\/img.gamemonetize.com\/3dzg5owhgdnwrvxj8861sb828jtmhvbk\/512x384.jpg","width":"800","height":"600"},{"id":"12992","title":"Funny Faces Match","description":"match the funny faces and get some rewards. This games is a lot of fun it makes you wanna play it again .","instructions":"Match 3 faces in a row by moving those little funny faces ","url":"https:\/\/html5.gamemonetize.com\/zr4edszqdqprn3hn6yswbqjv5vc2m3mm\/","category":"Stickman","tags":"Animal, Grooming, Match-3, Match3, Matching, Minecraft","thumb":"https:\/\/img.gamemonetize.com\/zr4edszqdqprn3hn6yswbqjv5vc2m3mm\/512x384.jpg","width":"800","height":"600"},{"id":"13053","title":"Sort Balls 3D","description":"In Slide Hoops, your aim is spin the metallic form round, and aim it so the colourful earrings turn out to be in the hole. First, you need to analyse the shape in front of you - some of them are intricate and also you need to be clever to clear up them. Then you need to use precision and timing to spin the form the right way to get the jewelry off. Then at last, you need to make sure you intention the figure just proper, so the jewelry emerge as in the hole. If considered one of them ends up outdoor, you lose! Don’t fear, you can retry the extent if you don’t get it! Whilst you play, you furthermore mght acquire coins with a purpose to unlock special rewards: like extraordinary colorings of the earrings, and special degrees. You will in no way get bored once more! This game will check your intelligence, timing, and accuracy! Are you prepared to be hooked? --- From the studio that brought you other unfastened video games like Pull the Pin, Parking Jam three-D, Sandwich!, clash of Blocks, Paint The dice and extra!","instructions":"","url":"https:\/\/html5.gamemonetize.com\/pxegbdsbnhsylh76in58nwf85k37qvog\/","category":"Stickman","tags":"1 Player, 3D, Arcade","thumb":"https:\/\/img.gamemonetize.com\/pxegbdsbnhsylh76in58nwf85k37qvog\/512x384.jpg","width":"800","height":"600"},{"id":"11680","title":"Stickman Heroes Fight","description":"MORE HEROES, MORE SKILLS, MORE FIGHTS! This game is an extremely good fighting game - engaging and funny. Players will play the role of stickman superhero, fighting against the legions of darkness.","instructions":"Arrow key ","url":"https:\/\/html5.gamemonetize.com\/4c1hr39gf9q1iyi9drqr3kzcnijxesxi\/","category":"Stickman","tags":".io, Classic, Fight, Stickman","thumb":"https:\/\/img.gamemonetize.com\/4c1hr39gf9q1iyi9drqr3kzcnijxesxi\/512x384.jpg","width":"800","height":"600"},{"id":"11509","title":"Dragon Ball Stickman Z","description":"This fighting game will give you a chance to become one of Dragon Ball Z heroes to fight with enemies and protect everybody on earth. Enter into the arena and fight for the survival. If you love playing games then this is the game which will amaze you with the swift handling and amazing features. Fight against the most Dragon Ball Boss. We bet you will enjoy the abundant upgrades for and all your stickman heroes in the best action RPG fighting game. How to play Dragon Ball Stickman Z : Kill bosses (Hitz, Jirenz, Zamasuz, Black Gokuz, piccolo, frieza....) and collect balls FEATURES - Easy and Simple to play - Cool transform effect - Cool skill design and effect - Cool transform Saiyanz - New character. - 200 levels Saiyan and 30 saiyan-jins - Ultra instinct","instructions":"The game has the most basic control ever you just need to dodge jump power up to launch your combo attacks","url":"https:\/\/html5.gamemonetize.com\/jboag0pr5qal6wwdjow22ixsmqy9ymoi\/","category":"Stickman","tags":"3D, 3D Games, Action, Arcade, Battle, Battlegrounds, Brawl, Clash, Defense, Dragon Ball Z, Fighting, Game, Games, Monster, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/jboag0pr5qal6wwdjow22ixsmqy9ymoi\/512x384.jpg","width":"960","height":"600"},{"id":"11273","title":"Jumping Puzzle Master","description":"Fight Master is New Wrestling Puzzle Game with Ultimate Action fight Game with 100 + Missions , Enter in the action Kick the Opponents and Eliminate them Have Fun How to Play - Fight Master Game Swipe to Hit the Opponents","instructions":"Fight Master Game Features 100 Wrestling Puzzle Levels Additive Gameplay New Fight game Get ready for Action","url":"https:\/\/html5.gamemonetize.com\/f3ntyizm5nf0tb4j2dmd44ycziiwqa96\/","category":"Stickman","tags":"1 Player, Action, Fighting","thumb":"https:\/\/img.gamemonetize.com\/f3ntyizm5nf0tb4j2dmd44ycziiwqa96\/512x384.jpg","width":"600","height":"960"},{"id":"11087","title":"Light It Up - Glow","description":"Light It Up - Glow Game Here Jump, flip and swing your tiny little body from one neon color shape to another to make them glow and light up. Collect stars as you jump and flip to raise your level. If you miss a jump, if your flip isn’t on point, or if you hit a spike… you fall into nothing ...(like nothing).","instructions":"Light It Up - Glow Game Here Jump flip and swing your tiny little body from one neon color shape to another to make them glow and light up Collect stars as you jump and flip to raise your level If you miss a jump if your fli","url":"https:\/\/html5.gamemonetize.com\/8xnsqeirxedsh3kcudwg8gca7cgvzi67\/","category":"Stickman","tags":"2D, Adventure, Arcade, Battle, Casual, endless, Stickman","thumb":"https:\/\/img.gamemonetize.com\/8xnsqeirxedsh3kcudwg8gca7cgvzi67\/512x384.jpg","width":"960","height":"600"},{"id":"10903","title":"Stick killer","description":"The goal of getting as much money as possible. Of course, the city is a veritable strait. Pedestrians have no priority and the police shoot live bullets!","instructions":"Searching carefully you could find a weapon to defend yourself ","url":"https:\/\/html5.gamemonetize.com\/munhsn4ny8fsxhklmqe6mx0a19v7vkgh\/","category":"Stickman","tags":"1 Player, Adventure, Fighting, Kill, Stickman","thumb":"https:\/\/img.gamemonetize.com\/munhsn4ny8fsxhklmqe6mx0a19v7vkgh\/512x384.jpg","width":"800","height":"600"},{"id":"10752","title":"Stickman City Shooting","description":"The enemy stickmen are trying to kill you! You must survive in the city, and kill and snipe the enemies! Become the ultimate stickman killing machine! 3D Stickman shooter game with many guns and weapons","instructions":"","url":"https:\/\/html5.gamemonetize.com\/7egf7ntv2q7up5mnd6kxmom7kwlfehtm\/","category":"Stickman","tags":"Action, Adventure, Battle, Shooter, Shooting, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/7egf7ntv2q7up5mnd6kxmom7kwlfehtm\/512x384.jpg","width":"800","height":"600"},{"id":"9142","title":"Drive Hills","description":"The game Drive Hills is an excellent 3D car driving game, drive your car and bring an egg to travel around the world. But there will be some obstacles on your road, you need to overcome the difficulties to reach the next city. Don't forget to collect coins to unlock new cars and eggs. Don't miss the Drive Hills!","instructions":"Mouse click or tap the screen to play","url":"https:\/\/html5.gamemonetize.com\/m62u3obbbzhqjiieiddqfe02ctktzx6m\/","category":"Stickman","tags":"Balance, Boy, Boys, Car, Driving, H5, HTML, HTML5, Kids, Obstacle, Platform, Skills, Stickman","thumb":"https:\/\/img.gamemonetize.com\/m62u3obbbzhqjiieiddqfe02ctktzx6m\/512x384.jpg","width":"750","height":"1334"},{"id":"9126","title":"Johnny Trigger 3D Online","description":"In this interesting 3D shooting game Johnny Trigger 3D Online, you only need one hand to control the character. In the process of adventure, you can use the guns and weapons in your hand to shoot and fight the enemy accurately. It's better to shoot the enemy with only one bullet, so you can save more bullets and defeat more enemies. Have fun!","instructions":"Mouse click or tap the screen to play","url":"https:\/\/html5.gamemonetize.com\/r9yzglmdp6ghmiknhy6b31z3k0al2j3u\/","category":"Stickman","tags":"Action, Boys, Gun, H5, HTML, HTML5, Kids, Killing, Shoot 'Em Up, Shooting, Stickman","thumb":"https:\/\/img.gamemonetize.com\/r9yzglmdp6ghmiknhy6b31z3k0al2j3u\/512x384.jpg","width":"750","height":"1334"},{"id":"8862","title":"Stickman Sniper","description":"Move your stickman to avoid the enemy's attack and wait for the opportunity to attack the enemy. Can you accomplish this difficult task?","instructions":"Click to play","url":"https:\/\/html5.gamemonetize.com\/z5v2w6zss3jjcfjws8vzzn58z7efxxuw\/","category":"Stickman","tags":"Gun, Shoot, Sniper, Stickman","thumb":"https:\/\/img.gamemonetize.com\/z5v2w6zss3jjcfjws8vzzn58z7efxxuw\/512x384.jpg","width":"576","height":"1024"},{"id":"8196","title":"Stickman Epic Battle","description":"Medieval themed stickman defense game with lots of action.","instructions":"Mouse","url":"https:\/\/html5.gamemonetize.com\/var3xfa8jqjxj1gb4327ymgnzkt8nhni\/","category":"Stickman","tags":"1 Player, Stickman","thumb":"https:\/\/img.gamemonetize.com\/var3xfa8jqjxj1gb4327ymgnzkt8nhni\/512x384.jpg","width":"800","height":"540"},{"id":"8501","title":"Stickman Fights","description":"Play now our new game Stickman Fights Online !! An epic battle arrives between the little stickmans who are determined to become the number 1 street fighter control the main character and help him beat the other fighters play it now on Kukogames always free remember that we have the best collection of stickman and fighting games . Stickman decided to find out among themselves who is stronger, and to do it in a truly masculine way - to fight! Everyone knows that Stickman are almost always associated with fights and this game is no exception. Stickman and fights are made for each other :) You have to defeat an online opponent in a battle and win a cash prize. The more money you bet, the greater the reward. For the dollars received, you can buy new skins that will decorate your fighter. Stickman fights online - turn your opponent into a cutlet!","instructions":"Control A D - Move W - Jump Left Mouse Button - Kick Right Mouse Button - Punch","url":"https:\/\/html5.gamemonetize.com\/xsnm9j5pt4edsiibqgn1vd8i0twqrclp\/","category":"Stickman","tags":"Battle, Fighting, Kiz 10, kiz10","thumb":"https:\/\/img.gamemonetize.com\/xsnm9j5pt4edsiibqgn1vd8i0twqrclp\/512x384.jpg","width":"800","height":"600"},{"id":"8251","title":"Jurassic World Run","description":"You're in the Jurassic world, and there's an accident. All the dinosaurs came out. They're going to catch you and eat you. You can only run away through a stick.","instructions":"Click on the screen stretch the stick release it and put it down Put it on the other end of the cliff Don t be eaten by dinosaurs","url":"https:\/\/html5.gamemonetize.com\/5e9r7xgwb0a06tr621u3rua9sxnqbrvg\/","category":"Stickman","tags":"Ninja, Ninjago, run, running","thumb":"https:\/\/img.gamemonetize.com\/5e9r7xgwb0a06tr621u3rua9sxnqbrvg\/512x384.jpg","width":"800","height":"600"},{"id":"7863","title":"Among Us Sling","description":"Sling, bounce and swing your character to the top. Get rid of the dangerous obstacles, collect coins to unlock more cool characters. Are you ready for this endless challenge? Play now!","instructions":"Drag the character then release it to sling ","url":"https:\/\/html5.gamemonetize.com\/y0yexhmdc73924ga1ddmmihnd1bia9j9\/","category":"Stickman","tags":"Action, Adventure, Arcade, Best, Casual, HTML, Mobile","thumb":"https:\/\/img.gamemonetize.com\/y0yexhmdc73924ga1ddmmihnd1bia9j9\/512x384.jpg","width":"360","height":"640"},{"id":"7811","title":"Sift Renegade Brawl","description":"Play this incredible exclusive game from kiz10.com called Sift Renegade Brawl totally free !!! In this game full of action and fights between stickman master samurai in a world where revenge and fights between clans is common, our main Hero called Ryu arrives, who was calm enjoying the peace accompanied by his beautiful girlfriend and in a total change of history will face a mission of revenge enjoy this excellent game on kiz10 totally free. The objective of this excellent game is to avenge the death of Ryu's girlfriend, a master of samurai, who must avenge the death of his girlfriend. The mission so dangerous and so many obstacles. Use your katana to cut all enemies. Make incredible combos to eliminate them with style. In the course of the game and the different levels you will be able to collect many trophies and improve your score as many times as you need to play each level again. Enjoy the story and help Ryu to complete all the missions!","instructions":"Use Mouse and Arrow or Use buttons","url":"https:\/\/html5.gamemonetize.com\/v9kun6or775k19iri6nhtxd1hrmv2zvx\/","category":"Stickman","tags":"Action, Fighting, Kiz 10, kiz10","thumb":"https:\/\/img.gamemonetize.com\/v9kun6or775k19iri6nhtxd1hrmv2zvx\/512x384.jpg","width":"800","height":"600"},{"id":"6260","title":"Stickman 3D Wingsuit","description":"Free 3D stickman wingsuit skydiving simulator You are a stickman wingsuit pilot! Fly through beautiful 3D levels and avoid deadly lava, spikes and saw blades. Remember to open up your parachute! Skydiving as a stick man has never been so bloody and deadly! note: the game uses the gyro for the best wingsuit flying experience If you like skydiving and base jumping this game is for you! Become a real stickman! sounds: freesound.org","instructions":"arrows - move space - parachute x - grenade esc - pause","url":"https:\/\/html5.gamemonetize.com\/w88kcmx6jtbjy9pbtmf4vxb1ioidp7dm\/","category":"Stickman","tags":"fly, Sim, Simulation, Stickman","thumb":"https:\/\/img.gamemonetize.com\/w88kcmx6jtbjy9pbtmf4vxb1ioidp7dm\/512x384.jpg","width":"800","height":"500"},{"id":"8080","title":"Stick Hero","description":"How far can you go? Stick Hero : Tap, Hold and Release the stick and see How far can you go with our little Hero. Challenge your friends or Share and Invite your friends. Be at the top of the leaderboard.","instructions":"1 Hold to stretch the stick in the hand of Hero 2 Release hold when you think stick height is enough to reach next block","url":"https:\/\/html5.gamemonetize.com\/inj89oore8r3mso7tbg8nr4ng1m2xhif\/","category":"Stickman","tags":"1 Player, 2D, Arcade, Casual, Hypercasual, Stickman, Superhero","thumb":"https:\/\/img.gamemonetize.com\/inj89oore8r3mso7tbg8nr4ng1m2xhif\/512x384.jpg","width":"800","height":"600"},{"id":"5112","title":"Stick Duel : Medieval Wars","description":"1 player and 2 player stickman wars physics game.","instructions":"Left Player Move A - D keys or Touch Right Player Move Right and Left arrow keys or Touch","url":"https:\/\/html5.gamemonetize.com\/7yt89sszsvq0j0y7frzuxhuksbhneynl\/","category":"Stickman","tags":"2 Player, 2 Player Games, 2D, Physics","thumb":"https:\/\/img.gamemonetize.com\/7yt89sszsvq0j0y7frzuxhuksbhneynl\/512x384.jpg","width":"1280","height":"640"},{"id":"7902","title":"Get On Top Touch","description":"Be ready for playing a wonderful multiplayer and extremely contentious game. At this game you will see the battle of getting on top of two interconnected characters. You will direct a hero and your friend will direct another hero. You can succeed in getting on top by moving your character wisely. But if you play randomly, you will lose. You can play on your computer or mobile devices.","instructions":"Player s Controls First Player Jump W Left A Right D Second Player Jump Upper Arrow Key Left ","url":"https:\/\/html5.gamemonetize.com\/ilnafv1nkh5b0qwxgiy8wv4haz2fy3fg\/","category":"Stickman","tags":"1 Player, 2 Player, 2 Player Games, Arcade, Classic","thumb":"https:\/\/img.gamemonetize.com\/ilnafv1nkh5b0qwxgiy8wv4haz2fy3fg\/512x384.jpg","width":"1280","height":"720"},{"id":"7775","title":"Battle Simulator: Counter Stickman","description":"The stickmen terror forces must be stopped with a tactical strike! You are the battle commander of the counter terrorist stickman (CTS) forces. ▶TABS simulator - style gameplay ▶3D stickmen, levels and gun models ▶Help win the stickman war.. on terror! ▶Accurate stickman tactics Sounds: Freesound.org Music_cornandbeans_generic_techno The stickmen terror forces must be stopped with a tactical strike! You are the battle commander of the counter terrorist stickman (CTS) forces. ▶TABS simulator - style gameplay ▶3D stickmen, levels and gun models ▶Help win the stickman war.. on terror! ▶Accurate stickman tactics Sounds: Freesound.org Music_cornandbeans_generic_techno","instructions":"use the mouse","url":"https:\/\/html5.gamemonetize.com\/xq2vnsqj92v2g5c3y8silywsg3bxiyyf\/","category":"Stickman","tags":"3D, Army, Battle, Battlegrounds, CSGO, Killing, Police, Shoot, Shooter, Shooting, Sim, Simulation, Stickman, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/xq2vnsqj92v2g5c3y8silywsg3bxiyyf\/512x384.jpg","width":"800","height":"600"},{"id":"7755","title":"Tanks attack!","description":"Tank attack is 2D game where you are the one with your fellow tank against an army of stickman tanks.","instructions":" WASD Arrows for movement Mouse click or Touch to shoot ","url":"https:\/\/html5.gamemonetize.com\/xmnk239e5g2rbwpa73pe0kwwucc1vn1t\/","category":"Stickman","tags":"Battle, Classic, endless, Shoot, Tank","thumb":"https:\/\/img.gamemonetize.com\/xmnk239e5g2rbwpa73pe0kwwucc1vn1t\/512x384.jpg","width":"640","height":"480"},{"id":"5641","title":"Stickman City Shooter","description":"Time for some stickman city shooting and killing! Kill kill kill!! The enemy stickmen are trying to kill you! You must survive in the city, and kill and snipe the enemies! Become the ultimate stickman killing machine! - 3D Stickman shooter game with many guns and weapons - Warning: Blood! Lots of blood! - Gun down enemy stickmen, stickman SWAT, stickman Soldiers and boss stickmen - Use cars, tanks, turrets - Great game for venting your anger! - Hours of city shooting fun! - Fully 3D levels Music1:darthduba-Speedrunner Music2:SmokeAvery-InceptiveAction","instructions":"arrows - move left mouse button - shoot right mouse button - grenade E - use","url":"https:\/\/html5.gamemonetize.com\/uc6bb1ntki2ot5ngbq7f67mwp8d5339x\/","category":"Stickman","tags":"3D, city, gta, Shoot, Shoot 'Em Up, Shooter, Shooting, Stickman, Violence, War, weapons","thumb":"https:\/\/img.gamemonetize.com\/uc6bb1ntki2ot5ngbq7f67mwp8d5339x\/512x384.jpg","width":"800","height":"500"},{"id":"7051","title":"Stickman Sports Badminton","description":"Different Stickman characters meet in Stickman Sports Badminton game! The game will give you a good badminton experience with its realistic ball physics. At the same time, the boosters for the game (big racket, fireball, faster) and some negative bonuses  (slowly) increase the fun. You can play the game for 1 Player or 2 Players. There are \"Normal\" and \"Hard\" game modes when playing against the CPU. You can choose the number of sets in the game as 5,7 or 9. Show who is the better badminton player now!","instructions":"PLAYER 1 Move Jump W A S D Swing Racket SPACE PLAYER 2 Move Jump ARROW KEYS Swing Racket M ","url":"https:\/\/html5.gamemonetize.com\/c6zx75jasrpsm0b6a4utgps07dxhs3h5\/","category":"Stickman","tags":"2 Player Games, 3D Games, Classic, Retro, Sports, Stickman","thumb":"https:\/\/img.gamemonetize.com\/c6zx75jasrpsm0b6a4utgps07dxhs3h5\/512x384.jpg","width":"800","height":"450"},{"id":"6566","title":"Mr Spy 3D","description":"Mr Spy is Brand Sniper Game with Perfect Shooting , Aim the Enemies and shoot on perfect time like Play role of undercover agent Spy , Pocket The Sniper 3D Action Game with Ultimate Missions and Targets","instructions":"Mouse Only","url":"https:\/\/html5.gamemonetize.com\/de8ye4lvl4wzc2ha890lzy3x46swazwn\/","category":"Stickman","tags":"3D, Action, Boy, Boys, Cool, Gun, HTML5, Shoot, Shooter, Shooting, Sniper, Stickman, WebGL","thumb":"https:\/\/img.gamemonetize.com\/de8ye4lvl4wzc2ha890lzy3x46swazwn\/512x384.jpg","width":"450","height":"750"},{"id":"6527","title":"police Stick man Fighting Game","description":"Get ready for the global wrestling fight to demonstrate the power of heavyweight champion and use all fighting skills to defeat your opponents in best free stickman wrestling game. Thrill the crowd with your stickman wrestling style in fighting club. Improve your fighting skills and become the best fighter in the world. Become a champion of professional stickman wrestlers in this world fighting club stickman wrestling game. Survive in ring by not giving your rivals a chance to win, fight heavy fighters and improve your skills at the highest level to win the stickman wrestling match.","instructions":"Please use A S D Z X for action","url":"https:\/\/html5.gamemonetize.com\/xlqsy3lky21x6z6wzj2421yqihn3nr3l\/","category":"Stickman","tags":"Fight, Fighting, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/xlqsy3lky21x6z6wzj2421yqihn3nr3l\/512x384.jpg","width":"960","height":"600"},{"id":"6436","title":"Stickman Bike Runner","description":"A game about a Stickman on a mountain bike going up a hill. Stickman eventually gets tired and the game ends, but you can extend his ascent by taking the batteries that will appear along the way. Arrange a competition with your friends, who will drive the longest!","instructions":"Computer - arrows on the keyboard Smartphone tablet - touch control","url":"https:\/\/html5.gamemonetize.com\/0zkh910goccyxzzy132k8cizu1chqclr\/","category":"Stickman","tags":"Bike, Boy, Boys, Race, Racing, run, running, Stickman","thumb":"https:\/\/img.gamemonetize.com\/0zkh910goccyxzzy132k8cizu1chqclr\/512x384.jpg","width":"1280","height":"720"},{"id":"6212","title":"StickMan Jump Fun","description":"Stickman Jump Fun is fun addictive skill game help you relax after working or learning.","instructions":"Left Mouse Button - Jump the stickman ","url":"https:\/\/html5.gamemonetize.com\/3ry6hzrfc19f99l7nwnh0k15amamsmmv\/","category":"Stickman","tags":"Casual, Hypercasual, jump, Jumping, Skill, Stickman","thumb":"https:\/\/img.gamemonetize.com\/3ry6hzrfc19f99l7nwnh0k15amamsmmv\/512x384.jpg","width":"400","height":"600"},{"id":"6217","title":"Stickman Fighting 2 Player","description":"Stickman Fighting 2 Player! A fun, addictive and Multiplayer warriors with realistic Ragdoll physics games. Test your warrior games skill and kill the enemy until the last drop of your blood! An epic Shadow 2 player games. You’ll get the heroic western cowboy fight with full of action and speed. Put your reflex and kill your opponents! real Boxing games, punches, catches, and Kicks! Stickman fighter physics games! Experience realistic Ninja fighting games atmosphere in the best Stickman games with ragdoll Doodle style survival games. Instructions: 1 player - Arrows 2 player - WASD","instructions":"1 player - Arrows 2 player - WASD","url":"https:\/\/html5.gamemonetize.com\/xw8b7fhz3kobelvwy1zvvryy03lh18iy\/","category":"Stickman","tags":"1 Player, 2 Player, Action, Boxing, Boys, Fight, Fighting, HTML5, Physics, WebGL","thumb":"https:\/\/img.gamemonetize.com\/xw8b7fhz3kobelvwy1zvvryy03lh18iy\/512x384.jpg","width":"960","height":"600"},{"id":"5640","title":"Stickman Neon Warriors: Sword Fighting","description":"You’re the Neon Sword Fighting Stickman: Fight the hacker warriors! It is the hacking war of 9999AD - in Stickman Neon Warriors: Sword Fighting you are a stickman ( humans evolved into virtual stickmen) and must fight the enemy hacker warriors using your cyber sword to restore order to the stick internet. ◘ 3D Stickman and environment ◘ Lots of sword fighting and killing ◘”Neon Warriors” Visual Style ◘gamepad support Become the hacker hero warrior! The cyber stickman world depends on you! Sounds:freesound.org Music:Battle_Experiment_foxhead128","instructions":"controls arrows attacks asd zxc","url":"https:\/\/html5.gamemonetize.com\/iyei6rf0ssd8g0plsiw41befnl0foof7\/","category":"Stickman","tags":"Action, Adventure, Fighting, Flight, Stickman, Street Fighting, Sword, Unity3D, Violence, weapons","thumb":"https:\/\/img.gamemonetize.com\/iyei6rf0ssd8g0plsiw41befnl0foof7\/512x384.jpg","width":"800","height":"500"},{"id":"5745","title":"Stickman Police VS Gangsters Street Fight","description":"Be a police stickman hero in city battle as a stickman fighting super hero. The battle starts against stickman gangster city mafia in prison. The stickman hero unleash as evil stickman hero and fight on city roads in stickman games. Being a stickman hero, play and fight as a stickman police cops gangsters, mafia & stickman prisoner criminals. The stickman bad guys are trying to escape from prison, so, show your US police stickman fighting skills to them. Fight as a US police stickman hero with special powers to stop them escaping from US prison.","instructions":"Please use keyboard arrows to controls the stickman hero Use Z X C A S and space buttons for fight","url":"https:\/\/html5.gamemonetize.com\/r8r1f4ujb3xn758fhslv42c9vv0o6oqx\/","category":"Stickman","tags":"Fight, Fighting, Pokemon, Police, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/r8r1f4ujb3xn758fhslv42c9vv0o6oqx\/512x384.jpg","width":"960","height":"600"},{"id":"5735","title":"Stickman Sniper 3D","description":"Call the best shooter, the guns are ready to action! Play now Stickman Sniper 3D, the popular free fun gun shooting game. Be the one men army, the sniper …","instructions":"Use mouse to play ","url":"https:\/\/html5.gamemonetize.com\/t708ya7vk969h80uv3mi7hd296mhykir\/","category":"Stickman","tags":"Shoot, Shoot 'Em Up, Shooter, Shooting, Sniper, Stickman","thumb":"https:\/\/img.gamemonetize.com\/t708ya7vk969h80uv3mi7hd296mhykir\/512x384.jpg","width":"900","height":"600"},{"id":"3818","title":"Stickman Fighting 3D","description":"Time for the stickmen to fight! Choose from many 3D characters, and kill your enemy! - 3D graphics and locations - Realistic 3D physics - Hours of fighting fun! - Many 3D stickmen: normal, zombie, demon, cyber, kyle Become a stick champion! Get revenge on your enemies! Music: CzySzy - Paul ter voorde vs zombies DiePflanze - Fighting Loop Hanupo - Glitch Bot","instructions":" WASD movement TYU GHJ different attacks Space bar pause menu ","url":"https:\/\/html5.gamemonetize.com\/pnlvbjavslmuh2qvcbymodsbpwybce91\/","category":"Stickman","tags":"3D, Fight, Fighting, Stickman, Street Fighting","thumb":"https:\/\/img.gamemonetize.com\/pnlvbjavslmuh2qvcbymodsbpwybce91\/512x384.jpg","width":"800","height":"600"},{"id":"5003","title":"Stickman Run: Shadow Adventure","description":"Once upon a time, in where colors was disappear and the light is dying. The stickmans are just alive as shadows in a Dark villages. There is a strange girl who live in a cottage, her name is Beauty. They said that she still breathes so the light still shines, but she always sickness.","instructions":"Spacebar - Jump Double Jump A - Attack 1 S - Attack 2 D - Attack 3","url":"https:\/\/html5.gamemonetize.com\/jq12638mn4qzb6631gfg8ksn7rnk82ks\/","category":"Stickman","tags":"1 Player, 2D, Arcade, Boys, Fight, HTML5, run, running, Stickman, WebGL","thumb":"https:\/\/img.gamemonetize.com\/jq12638mn4qzb6631gfg8ksn7rnk82ks\/512x384.jpg","width":"960","height":"600"},{"id":"4687","title":"Stickman Run","description":"Stickman Run - is a highly addictive game where you have to help the stickman run and jump over obstacles!","instructions":"Use your mouse or arrow keys ","url":"https:\/\/html5.gamemonetize.com\/x4ro0pdbh1la57jn39kbju3qxcd44jb2\/","category":"Stickman","tags":"Adventure, run, running, Skill, Stickman","thumb":"https:\/\/img.gamemonetize.com\/x4ro0pdbh1la57jn39kbju3qxcd44jb2\/512x384.jpg","width":"800","height":"600"},{"id":"3983","title":"Sniper Shot 3D","description":"Take down your targets as quickly as possible in this action packed 3D stickman sniper game.","instructions":"WASD keys to move Mouse to shoot or use tap controls","url":"https:\/\/html5.gamemonetize.com\/rweudmo4b1aj1yt8mx0xkcfgc4lhhnn9\/","category":"Stickman","tags":"Action, Gun, Shooter, Sniper, Stickman, weapons","thumb":"https:\/\/img.gamemonetize.com\/rweudmo4b1aj1yt8mx0xkcfgc4lhhnn9\/512x384.jpg","width":"800","height":"600"},{"id":"3959","title":"Ragdoll Physics","description":"Hilarious! Strange! Funny Ragdoll Physics where Boneless girl is pulling down into a never ending pit.","instructions":"Left mouse button to Grab the Girl ","url":"https:\/\/html5.gamemonetize.com\/6t6lb5ayvfr47ejoxasgb2t0ur2mvfe1\/","category":"Stickman","tags":"Ballon, fly, Friv, Funny, Jumping, Kiss, Physics, Plane, running, sky","thumb":"https:\/\/img.gamemonetize.com\/6t6lb5ayvfr47ejoxasgb2t0ur2mvfe1\/512x384.jpg","width":"800","height":"600"},{"id":"3725","title":"Stickman Zombie 3D","description":"You are a stickman! Shoot and kill the stickmen zombie horde and also other enemy survivor stick figures! Find a gun, and start killing anything that is still walking! Warning: this game contains lots of blood and fun violence!~ Features - Post apocalyptic 3D world with zombies - Easy controls for running and shooting - Physics based ragdoll deaths of stickmen - Lots of shooting and killing! - Death and blood! Music: Dem0lecule - Global Mechanization","instructions":"arrows - move mouse- rotate z left mouse - shoot X- turn 180 C - Friendly Speech","url":"https:\/\/html5.gamemonetize.com\/w7pel9e6qj8iuoouohapgp2dzk3zcpd8\/","category":"Stickman","tags":"1 Player, 3D, Action, Gun, Shoot, Shoot 'Em Up, Shooter, Shooting, Stickman, Unity3D, Violence, Zombie","thumb":"https:\/\/img.gamemonetize.com\/w7pel9e6qj8iuoouohapgp2dzk3zcpd8\/512x384.jpg","width":"800","height":"600"},{"id":"3728","title":"Killer City","description":"Avoid the killers as you try to grab as much cash as possible. The sequel to Stick City, this time you need to avoid the killers and the vehicles for as long as possible. Pick up the baseball bat to help defend yourself.","instructions":"Use mouse or finger to move","url":"https:\/\/html5.gamemonetize.com\/i13i9qs9e7mmpzpv5bxnhdwyfszm5mso\/","category":"Stickman","tags":"Arcade, Car, Gun, Killing","thumb":"https:\/\/img.gamemonetize.com\/i13i9qs9e7mmpzpv5bxnhdwyfszm5mso\/512x384.jpg","width":"800","height":"600"},{"id":"3647","title":"Stickman Tennis 3D","description":"Control your stickman player and compete in various challenging tennis competitions!","instructions":"Controls Arrow keys to move C to volley X to slice Z to lob ","url":"https:\/\/html5.gamemonetize.com\/2u8d0464psswc2s9sik8sl0g8uizbxkd\/","category":"Stickman","tags":"1 Player, 3D Games, Sport, Stickman, Tennis, Unity3D","thumb":"https:\/\/img.gamemonetize.com\/2u8d0464psswc2s9sik8sl0g8uizbxkd\/512x384.jpg","width":"800","height":"500"},{"id":"3589","title":"Toilet Rush 2","description":"The new Toilet Rush is here is time to break the toilet. Help the troll stickman to rush to the bathroom in each level. Be careful with time or you will get your pants dirty. Complete the hard levels, invisible levels, and dark levels to help this annoying guy.","instructions":"Use the arrow for Move","url":"https:\/\/html5.gamemonetize.com\/uu3nllu760qcv3ylk4ts9wd0ugiiihqc\/","category":"Stickman","tags":"Fun, Funny, Kiz 10, kiz10","thumb":"https:\/\/img.gamemonetize.com\/uu3nllu760qcv3ylk4ts9wd0ugiiihqc\/512x384.jpg","width":"800","height":"480"},{"id":"3329","title":"Stickman Street Fighting","description":"Stickman!!! Fight through the street levels and defeat the enemy stick fighters! Collect weapons such as melee weapons , machine gun, pistol and saw. No one really knows why the fighting in the street began, but YOU will become the ultimate stickman fighter! - Gamepad , joystick controls support - Offline game , no internet required - Fight through over 100 stickman street locations Music: IoChron - TrAnCeD Mastery","instructions":" Arrrow keys to move Space bar to jump Z to punch X to kick C to block ","url":"https:\/\/html5.gamemonetize.com\/1eaqreng04kywpopd6bayxb6fedhq6mr\/","category":"Stickman","tags":"1 Player, 3D, Fight, Fighting, Stickman, Street Fighting, Unity3D, Violence","thumb":"https:\/\/img.gamemonetize.com\/1eaqreng04kywpopd6bayxb6fedhq6mr\/512x384.jpg","width":"800","height":"500"},{"id":"3330","title":"Stickman Simulator: Final Battle!!","description":"It’s time for war! Stickman Simulator: Final Battle is the newest game where you get to choose your epic troops, and claim victory on the battlefield! Become a real hero! • 3D stickman troops and levels • tabs - style gameplay! • Blood and killing! Music: Maestro Segments War Menu 2","instructions":"just use the mouse lmao","url":"https:\/\/html5.gamemonetize.com\/h0evomipes1po2zkz5zhp9fn7e7yu3fc\/","category":"Stickman","tags":"3D, Battle, Knight, Simulation, Simulator, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/h0evomipes1po2zkz5zhp9fn7e7yu3fc\/512x384.jpg","width":"800","height":"500"},{"id":"3250","title":"Stickman Crash","description":"Stickman Crash is a funny thinking game where you need to find the perfect combination of poses and moves for the ragdoll in order to perform the action asked. Use your creative thinking to find the perfect combination and unlock funny features.","instructions":" Use mouse to play","url":"https:\/\/html5.gamemonetize.com\/u2zbs0rhlvi3g1wc5zs63veshbb6yons\/","category":"Stickman","tags":"2D, Physics, WebGL","thumb":"https:\/\/img.gamemonetize.com\/u2zbs0rhlvi3g1wc5zs63veshbb6yons\/512x384.jpg","width":"960","height":"600"},{"id":"2329","title":"Clash Of Stickman Warrior","description":"Do You love Something New Clash of Stickman Warrior Game Now With Rivals with Best Shooting Mission Challenges . Shoot Your Rival Stickman and Slove the Shooting Mission with Clash of Stickman Warrior Game.","instructions":"Space - Shoot","url":"https:\/\/html5.gamemonetize.com\/8io41csob4hgrw0amj25lqms0ce73anc\/","category":"Stickman","tags":"2D, Boy, Boys, Cool, Fun, HTML5, Shoot, Shooter, WebGL","thumb":"https:\/\/img.gamemonetize.com\/8io41csob4hgrw0amj25lqms0ce73anc\/512x384.jpg","width":"960","height":"640"},{"id":"2343","title":"Stick Soldier","description":"Stick soldier is Arcade game, Hold your finger on screen to make the stick grow. Stretch the stick in order to reach and walk on the platforms. If the stick is not long enough, you will fall down!","instructions":"click or touch screen to play","url":"https:\/\/html5.gamemonetize.com\/3hpeoxayy14qfpv0evqm00rbdadij4cm\/","category":"Stickman","tags":"1 Player, 2D, Arcade, Army, Casual, endless, Game, Games, HTML5, Snow, Stickman","thumb":"https:\/\/img.gamemonetize.com\/3hpeoxayy14qfpv0evqm00rbdadij4cm\/512x384.jpg","width":"720","height":"1280"},{"id":"2245","title":"Stickman Fighter: Space War","description":"You are the legend of the village of Stickman Legend, the only force able to withstand and defeat the oncoming waves of evil from Space. Earn money, upgrade your skills, items, buy new weapons. Have a lot of fun playing this game.","instructions":"Use WASD or Arrows to move and Mouse to use skills ","url":"https:\/\/html5.gamemonetize.com\/1v7b0ohoudwo187vdpbkfds58dt319z2\/","category":"Stickman","tags":"Boys, Fight, Fighting, Fun, Girls, Space, Stickman, War","thumb":"https:\/\/img.gamemonetize.com\/1v7b0ohoudwo187vdpbkfds58dt319z2\/512x384.jpg","width":"900","height":"600"},{"id":"2264","title":"Stickman Ninja Warriors","description":"Play as a Stickman Ninja Warriors your duty is to save the princess from the evil ninja, your main character has mastered shuriken skill, solve the puzzle by throw the shuriken to break the cage that imprison the princess.","instructions":"Mouse Only","url":"https:\/\/html5.gamemonetize.com\/kfehmd1vmr9c2l9n72shvibrqbjejv33\/","category":"Stickman","tags":"2D, Boy, Boys, Cool, Crazy, HTML5, WebGL","thumb":"https:\/\/img.gamemonetize.com\/kfehmd1vmr9c2l9n72shvibrqbjejv33\/512x384.jpg","width":"960","height":"640"},{"id":"2177","title":"Mr Bow","description":"Become the legendary archer master and destroy the evil enemy archers. Choose your bow and arrow and destroy the enemy stickman archers in this bow hunting game. Sharpen your archery target and shooting skills and become a champion. Enemy force is near! Pick up your bow and start shooting.","instructions":"use mouse to play ","url":"https:\/\/html5.gamemonetize.com\/sinzont82bnqz8a697g4biossp6wrfsk\/","category":"Stickman","tags":"Bow, Boys, Girls, Kids, Stickman","thumb":"https:\/\/img.gamemonetize.com\/sinzont82bnqz8a697g4biossp6wrfsk\/512x384.jpg","width":"500","height":"750"},{"id":"2115","title":"StickMan Team Force","description":"A new Adventure begins in Kiz10 Special ces called Stickman Team Force are recruited to bring order to the world, where an organization with high technology wants to take over the streets of the world helps to end the threat and become a leader.","instructions":"z or Click to Shoot c Change Hero Space to Special","url":"https:\/\/html5.gamemonetize.com\/wdwndlx5wn7lyptgc8hck6drcfte2miz\/","category":"Stickman","tags":"kiz10, Stickman","thumb":"https:\/\/img.gamemonetize.com\/wdwndlx5wn7lyptgc8hck6drcfte2miz\/512x384.jpg","width":"800","height":"600"},{"id":"1784","title":"XMAS Wheelie","description":"Wheelie your way in to the holidays","instructions":"hold your mouse or finger to wheelie","url":"https:\/\/html5.gamemonetize.com\/ayk2aqpgn246yfncnu1vxd3h7ahxlyfw\/","category":"Stickman","tags":"Action, Christmas","thumb":"https:\/\/img.gamemonetize.com\/ayk2aqpgn246yfncnu1vxd3h7ahxlyfw\/512x384.jpg","width":"1024","height":"640"},{"id":"1777","title":"Wheelie Bike","description":"How far can you wheelie?","instructions":"Hold down your finger or mouse to wheelie for as long as possible ","url":"https:\/\/html5.gamemonetize.com\/0x8t0mbhij0qu4bal4787s9jo5bcjpuj\/","category":"Stickman","tags":"","thumb":"https:\/\/img.gamemonetize.com\/0x8t0mbhij0qu4bal4787s9jo5bcjpuj\/512x384.jpg","width":"1024","height":"640"},{"id":"1587","title":"Stickman Sniper 3","description":"Take down all of your targets in this fun online stickman sniper game.","instructions":"Click or tap to aim and shoot","url":"https:\/\/html5.gamemonetize.com\/46umfc49bzgl2nf80gm60x2r7puy2746\/","category":"Stickman","tags":"1 Player, Gun, Puzzle, Sniper, Stickman, weapons","thumb":"https:\/\/img.gamemonetize.com\/46umfc49bzgl2nf80gm60x2r7puy2746\/512x384.jpg","width":"800","height":"600"},{"id":"1485","title":"Stickman Gun Shooter 3D","description":"Warning: contains blood and shooting!! You are a stickman!!!! Kill and snipe the enemy stickmen - you have to strike first or they will kill you! How long will you survive the before you are dead? In this amazing 3D shooter game, there will be everything you ever wanted: Features - Fully 3D stickman and level - Blood!! Lots of Blooood effects! - Ragdoll \/ physics based death animations - Many Weapons! guns, a shotgun, a machine gun, mp5, m16, ak-47, uzi - Hours of shooting fun! - Lots of death! Instructions - Try to not die for as long as possible! :) Every enemy stickman should fear you, as you hunt down and shoot them. Music:dem0lecule-Global-Mechanization","instructions":"WASD ARROWS - Move CTRL- Shoot Space- Jump G- Grenade","url":"https:\/\/html5.gamemonetize.com\/55uewxpgw5fg83ahhosllieq3819vzw0\/","category":"Stickman","tags":"1 Player, 3D, 3D Games, Gun, Kill, Killing, Shoot, Shoot 'Em Up, Shooter, Shooting, Stickman, Unity3D, weapons","thumb":"https:\/\/img.gamemonetize.com\/55uewxpgw5fg83ahhosllieq3819vzw0\/512x384.jpg","width":"800","height":"500"},{"id":"1184","title":"Stickman Saw 3D","description":"Stickman Saw 3D is a brand new color saw game with true ASMR experience. Move color cubes and cescue the stickman. Avoid obstacles, saw only color cubes and shapes only.","instructions":"Use mouse to play ","url":"https:\/\/html5.gamemonetize.com\/0i9u6lcbud4wtkl32km8ens7wfginpoo\/","category":"Stickman","tags":"3D, 3D Games, Arcade, Boys, Fun, Girls, HTML5, Mobile","thumb":"https:\/\/img.gamemonetize.com\/0i9u6lcbud4wtkl32km8ens7wfginpoo\/512x384.jpg","width":"480","height":"600"},{"id":"1136","title":"Stickman Prison Escape Story 3D","description":"You are stuck in prison for a crime you did not commit. Framed and imprisoned, but never gives up and plans to self-salvation. Persevere, day after day, year after year. Hope can set him free. Finally, you can take the breath of freedom.","instructions":"Use Arrows or WASD to move Space to jump Shift to run Q - to make somersault Mouse to aim shoot 1-2 to change weapons L to show hide cursor ","url":"https:\/\/html5.gamemonetize.com\/vdqwhxttg6ujyz9mkidhgn18j46mrm7m\/","category":"Stickman","tags":"3D, 3D Games, Boys, Escape, Fun, Girl, Girls, HTML5, Prison, Shoot, Shoot 'Em Up, Shooter, Shooting, Stickman, WebGL","thumb":"https:\/\/img.gamemonetize.com\/vdqwhxttg6ujyz9mkidhgn18j46mrm7m\/512x384.jpg","width":"900","height":"600"},{"id":"892","title":"Toilet Rush","description":"Toilet rush is a puzzle platmer game.Find your way and dump your load on the lavatory before you explode. It's a everyday struggle to find peace on toilet.","instructions":"Mouse or Touch and arrow key to move","url":"https:\/\/html5.gamemonetize.com\/jbfqqewsrr8ru56d5zbfxtr4ein5mrq5\/","category":"Stickman","tags":"Fun, Funny, kiz10","thumb":"https:\/\/img.gamemonetize.com\/jbfqqewsrr8ru56d5zbfxtr4ein5mrq5\/512x384.jpg","width":"800","height":"500"},{"id":"882","title":"Stickman Dismount","description":"Features: • Fun physics gameplay • Multiple levels to play • Score system","instructions":"Controls Use mouse to play","url":"https:\/\/html5.gamemonetize.com\/d2pe3o8rrt57q6mro0vjkor7q0xequ04\/","category":"Stickman","tags":"Physics, Unity3D, WebGL","thumb":"https:\/\/img.gamemonetize.com\/d2pe3o8rrt57q6mro0vjkor7q0xequ04\/512x384.jpg","width":"960","height":"600"},{"id":"783","title":"Stickman Adventure Prison Jail Break Mission","description":"Stickman Adventure: Prison Jail Break Mission is a league of legendary stickman games and is rated among our best rpg games parkour stickman adventure fights. Take on the challenge of become the highest rated stickman fighting legends fighter games. Prison Jail Break Mission is your main and primary mission in this parkour stickman adventure","instructions":"WASD - Move Shift - Run Space - Jump Mouse - Attack","url":"https:\/\/html5.gamemonetize.com\/4vs00umh3emfy9v3syh3lfl8o7oqxiv1\/","category":"Stickman","tags":"3D, Boys, Escape, Fighting, HTML5, Prison, Shooting, Stickman, WebGL","thumb":"https:\/\/img.gamemonetize.com\/4vs00umh3emfy9v3syh3lfl8o7oqxiv1\/512x384.jpg","width":"900","height":"600"}]